title: Accessing WinAPI in PowerShell for Credentials Dumping
author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects Accessing to lsass.exe by Powershell
detection:
    SELECTION_1:
        EventID: 8
    SELECTION_2:
        EventID: 10
    SELECTION_3:
        SourceImage: '*\powershell.exe'
    SELECTION_4:
        TargetImage: '*\lsass.exe'
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 3f07b9d1-2082-4c56-9277-613a621983cc
level: high
logsource:
    product: windows
    service: sysmon
modified: 2021/05/24
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
yml_filename: sysmon_accessing_winapi_in_powershell_credentials_dumping.yml
yml_path: /home/itib/git/sigma/rules/windows/sysmon

