
title: T1021 DCOM InternetExplorer.Application Iertutil DLL Hijack
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR), wagga
date: 2020/10/12
description: Detects a threat actor creating a file named `iertutil.dll` in the `C:\Program
  Files\Internet Explorer\` directory over the network and loading it for a DCOM InternetExplorer
  DLL Hijack scenario.
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Image: System
  SELECTION_3:
    TargetFilename: '*\Internet Explorer\iertutil.dll'
  SELECTION_4:
    EventID: 7
  SELECTION_5:
    Image: '*\Internet Explorer\iexplore.exe'
  SELECTION_6:
    ImageLoaded: '*\Internet Explorer\iertutil.dll'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5
    and SELECTION_6))
falsepositives:
- Unknown
id: e554f142-5cf3-4e55-ace9-a1b59e0def65
level: critical
logsource:
  product: windows
  service: sysmon
modified: 2021/06/27
references:
- https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009183000.html
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.002
- attack.t1021.003
