
title: Powershell Store File In Alternate Data Stream
author: frack113
date: 2021/09/02
description: Storing files in Alternate Data Stream (ADS) similar to Astaroth malware.
detection:
  SELECTION_1:
    ScriptBlockText: '*Start-Process*'
  SELECTION_2:
    ScriptBlockText: '*-FilePath "$env:comspec" *'
  SELECTION_3:
    ScriptBlockText: '*-ArgumentList *'
  SELECTION_4:
    ScriptBlockText: '*>*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: a699b30e-d010-46c8-bbd1-ee2e26765fe9
level: medium
logsource:
  category: ps_script
  definition: EnableScriptBlockLogging must be set to enable
  product: windows
modified: 2021/10/16
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1564.004/T1564.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
ruletype: SIGMA
