
title: Suspicious PowerShell Invocations - Generic
author: Florian Roth (rule)
date: 2017/03/12
description: Detects suspicious PowerShell invocation command parameters
detection:
  SELECTION_1:
    ScriptBlockText:
    - '* -enc *'
    - '* -EncodedCommand *'
  SELECTION_2:
    ScriptBlockText:
    - '* -w hidden *'
    - '* -window hidden *'
    - '* -windowstyle hidden *'
  SELECTION_3:
    ScriptBlockText:
    - '* -noni *'
    - '* -noninteractive *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Penetration tests
- Very special / sneaky PowerShell scripts
id: ed965133-513f-41d9-a441-e38076a0798f
level: high
logsource:
  category: ps_script
  product: windows
modified: 2021/10/18
related:
- id: 3d304fda-78aa-43ed-975c-d740798a49c1
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
