
title: Clearing Windows Console History
ruletype: Sigma
author: Austin Songer @austinsonger
date: 2021/11/25
description: Identifies when a user attempts to clear console history. An adversary
  may clear the command history of a compromised account to conceal the actions undertaken
  during an intrusion.
detection:
  SELECTION_1:
    ScriptBlockText:
    - '*Clear-History*'
  SELECTION_2:
    ScriptBlockText:
    - '*Remove-Item*'
    - '*rm*'
  SELECTION_3:
    ScriptBlockText:
    - '*ConsoleHost_history.txt*'
    - '*(Get-PSReadlineOption).HistorySavePath*'
  condition: (SELECTION_1 or (SELECTION_2 and SELECTION_3))
falsepositives:
- Unknown
id: bde47d4b-9987-405c-94c7-b080410e8ea7
level: high
logsource:
  category: ps_script
  product: windows
references:
- https://stefanos.cloud/blog/kb/how-to-clear-the-powershell-command-history/
- https://www.shellhacks.com/clear-history-powershell/
- https://community.sophos.com/sophos-labs/b/blog/posts/powershell-command-history-forensics
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1070.003
