author: Zach Mathis
date: 2020/11/08
modified: 2021/12/22

title: Logon Failure - Unknown Reason
title_jp: ログオンに失敗 - 不明な理由
details: 'User: %TargetUserName%  :  Type: %LogonType%  :  Workstation: %WorkstationName%  :  IP Address: %IpAddress%  :  AuthPackage: %AuthenticationPackageName%'
details_jp: 'ユーザ: %TargetUserName%  :  タイプ: %LogonType%  :  端末: %WorkstationName%  :  IPアドレス: %IpAddress%  :  認証パッケージ: %AuthenticationPackageName%'
description: Prints logon information. 
description_jp: Prints logon information.

id: a85096da-be85-48d7-8ad5-2f957cd74daa
level: low
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4625
    filter:
        - SubStatus: "0xc0000064"   #Non-existent user
        - SubStatus: "0xc000006a"   #Wrong password
    condition: selection and not filter
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: ./sample-evtx/DeepBlueCLI/smb-password-guessing-security.evtx
logsource: default
ruletype: Hayabusa
