author: Zach Mathis
date: 2021/12/20
modified: 2021/12/22

title: Password Guessing Attack
title_jp: パスワード推測攻撃
details: ''  #Cannot be used because this is a count rule
details_jp: '' 
description: Search for many 4625 wrong password failed logon attempts in a short period of time.
description_jp:

id: 35e8a0fc-60c2-46d7-ba39-aafb15b9854e
level: medium
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4625
        SubStatus: "0xc000006a" #Wrong password
    condition: selection | count() by IpAddress >= 5
    timeframe: 5m
falsepositives:
    - User mistyping password
tags:
    - attack.t1110.003
    - attack.credential_access
references: https://attack.mitre.org/techniques/T1110/003/
sample-evtx: ./hayabusa-sample-evtx/DeepBlueCLI/smb-password-guessing-security.evtx
logsource: default
ruletype: Hayabusa
