author: Zach Mathis
date: 2021/12/20
modified: 2021/12/20

title: Password Spray
title_jp: パスワードスプレー攻撃
output: ''  #Cannot be used because this is a count rule
output_jp: '' 
description: Search for many 4648 explicit credential logon attempts in a short period of time.
description_jp:

id: ffd622af-d049-449f-af5a-0492fdcc3a58
level: medium
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4648
    condition: selection | count(TargetUserName) by IpAddress >= 5
    timeframe: 5m
falsepositives:
tags:
    - attack.t1110.003
    - attack.credential_access
references: https://attack.mitre.org/techniques/T1110/003/
sample-evtx: ./hayabusa-sample-evtx/DeepBlueCLI/password-spray.evtx
logsource: default
ruletype: Hayabusa
