
title: Tamper Windows Defender
author: frack113
date: 2021/06/07
description: Attempting to disable scheduled scanning and other parts of windows defender
  atp.
detection:
  SELECTION_1:
    EventID: 600
  SELECTION_2:
    HostApplication: '*Set-MpPreference*'
  SELECTION_3:
    HostApplication:
    - '*-DisableRealtimeMonitoring 1*'
    - '*-DisableBehaviorMonitoring 1*'
    - '*-DisableScriptScanning 1*'
    - '*-DisableBlockAtFirstSeen 1*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: ec19ebab-72dc-40e1-9728-4c0b805d722c
level: high
logsource:
  definition: fields have to be extract from event
  product: windows
  service: powershell-classic
modified: 2021/08/16
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
