
title: Suspicious Encoded Scripts in a WMI Consumer
ruletype: Sigma
author: Florian Roth
date: 2021/09/01
description: Detects suspicious encoded payloads in WMI Event Consumers
detection:
  SELECTION_1:
    EventID: 19
  SELECTION_2:
    EventID: 20
  SELECTION_3:
    EventID: 21
  SELECTION_4:
    Destination:
    - '*V3JpdGVQcm9jZXNzTWVtb3J5*'
    - '*dyaXRlUHJvY2Vzc01lbW9ye*'
    - '*Xcml0ZVByb2Nlc3NNZW1vcn*'
    - '*VGhpcyBwcm9ncmFtIGNhbm5vdCBiZSBydW4gaW4gRE9TIG1vZG*'
    - '*RoaXMgcHJvZ3JhbSBjYW5ub3QgYmUgcnVuIGluIERPUyBtb2Rl*'
    - '*UaGlzIHByb2dyYW0gY2Fubm90IGJlIHJ1biBpbiBET1MgbW9kZ*'
    - '*VGhpcyBwcm9ncmFtIG11c3QgYmUgcnVuIHVuZGVyIFdpbjMy*'
    - '*RoaXMgcHJvZ3JhbSBtdXN0IGJlIHJ1biB1bmRlciBXaW4zM*'
    - '*UaGlzIHByb2dyYW0gbXVzdCBiZSBydW4gdW5kZXIgV2luMz*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Unknown
fields:
- User
- Operation
id: 83844185-1c5b-45bc-bcf3-b5bf3084ca5b
level: high
logsource:
  category: wmi_event
  product: windows
references:
- https://github.com/RiccardoAncarani/LiquidSnake
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.persistence
- attack.t1546.003
