
title: PSExec and WMI Process Creations Block
ruletype: Sigma
author: Bhabesh Raj
date: 2020/07/14
description: Detects blocking of process creations originating from PSExec and WMI
  commands
detection:
  SELECTION_1:
    EventID: 1121
  SELECTION_2:
    ProcessName:
    - '*\wmiprvse.exe'
    - '*\psexesvc.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 97b9ce1e-c5ab-11ea-87d0-0242ac130003
level: high
logsource:
  definition: 'Requirements:Enabled Block process creations originating from PSExec
    and WMI commands from Attack Surface Reduction (GUID: d1e49aac-8f56-4280-b9ba-993a6d77406c)'
  product: windows
  service: windefend
modified: 2021/11/13
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction?WT.mc_id=twitter#block-process-creations-originating-from-psexec-and-wmi-commands
- https://twitter.com/duff22b/status/1280166329660497920
status: experimental
tags:
- attack.execution
- attack.lateral_movement
- attack.t1047
- attack.t1035
- attack.t1569.002
