
title: dotNET DLL Loaded Via Office Applications
author: Antonlovesdnb
date: 2020/02/19
description: Detects any assembly DLL being loaded by an Office Product
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Image:
    - '*\winword.exe'
    - '*\powerpnt.exe'
    - '*\excel.exe'
    - '*\outlook.exe'
  SELECTION_3:
    ImageLoaded:
    - C:\Windows\assembly\\*
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: ff0f2b05-09db-4095-b96d-1b75ca24894a
level: high
logsource:
  category: image_load
  product: windows
modified: 2020/08/23
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: experimental
tags:
- attack.execution
- attack.t1204
- attack.t1204.002
ruletype: SIGMA
