
title: Suspicious System.Drawing Load
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection for processes loading System.Drawing.ni.dll. This
  could be an indicator of potential Screen Capture.
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    ImageLoaded: '*\System.Drawing.ni.dll'
  SELECTION_3:
    Image:
    - C:\Program Files\\*
    - C:\Program Files (x86)\\*
    - C:\Windows\System32\\*
    - C:\Windows\Microsoft.NET\\*
    - C:\Windows\ImmersiveControlPanel\\*
  SELECTION_4:
    Image:
    - C:\Users\\*\AppData\Local\NhNotifSys\nahimic\nahimicNotifSys.exe
    - C:\Users\\*\GitHubDesktop\Update.exe
    - C:\Windows\System32\NhNotifSys.exe
  condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3) or (SELECTION_4)))
falsepositives:
- unknown
id: 666ecfc7-229d-42b8-821e-1a8f8cb7057c
level: low
logsource:
  category: image_load
  product: windows
modified: 2021/12/05
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://threathunterplaybook.com/evals/apt29/detections/7.A.1_3B4E5808-3C71-406A-B181-17B0CE3178C9.html
status: experimental
tags:
- attack.collection
- attack.t1113
