
title: Possible Process Hollowing Image Loading
ruletype: Sigma
author: Markus Neis
date: 2018/01/07
description: Detects Loading of samlib.dll, WinSCard.dll from untypical process e.g.
  through process hollowing by Mimikatz
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Image:
    - '*\notepad.exe'
  SELECTION_3:
    ImageLoaded:
    - '*\samlib.dll'
    - '*\WinSCard.dll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Very likely, needs more tuning
id: e32ce4f5-46c6-4c47-ba69-5de3c9193cd7
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
references:
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for.html
status: test
tags:
- attack.defense_evasion
- attack.t1073
- attack.t1574.002
