
title: Suspicious WSMAN Provider Image Loads
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/06/24
description: Detects signs of potential use of the WSMAN provider from uncommon processes
  locally and remote execution.
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    EventID: 7
  SELECTION_3:
    ImageLoaded:
    - '*\WsmSvc.dll'
    - '*\WsmAuto.dll'
    - '*\Microsoft.WSMan.Management.ni.dll'
  SELECTION_4:
    OriginalFileName:
    - WsmSvc.dll
    - WSMANAUTOMATION.DLL
    - Microsoft.WSMan.Management.dll
  SELECTION_5:
    Image: '*\powershell.exe'
  SELECTION_6:
    Image: '*\svchost.exe'
  SELECTION_7:
    OriginalFileName: WsmWmiPl.dll
  condition: (SELECTION_1 and ((SELECTION_2 and (SELECTION_3 or SELECTION_4) and  not
    (SELECTION_5)) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94
level: medium
logsource:
  category: image_load
  product: windows
modified: 2021/11/17
references:
- https://twitter.com/chadtilbury/status/1275851297770610688
- https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
- https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture
- https://github.com/bohops/WSMan-WinRM
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.003
ruletype: SIGMA
