
title: WMIC Loading Scripting Libraries
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/17
description: Detects threat actors proxy executing code and bypassing application
  controls by leveraging wmic and the `/FORMAT` argument switch to download and execute
  an XSL file (i.e js, vbs, etc).
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Image: '*\wmic.exe'
  SELECTION_3:
    ImageLoaded:
    - '*\jscript.dll'
    - '*\vbscript.dll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Apparently, wmic os get lastboottuptime loads vbscript.dll
id: 06ce37c2-61ab-4f05-9ff5-b1a96d18ae32
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
references:
- https://securitydatasets.com/notebooks/small/windows/05_defense_evasion/SDWIN-201017061100.html
- https://twitter.com/dez_/status/986614411711442944
- https://lolbas-project.github.io/lolbas/Binaries/Wmic/
status: test
tags:
- attack.defense_evasion
- attack.t1220
