
title: APT PRIVATELOG Image Load Pattern
ruletype: Sigma
author: Florian Roth
date: 2021/09/07
description: Detects an image load pattern as seen when a tool named PRIVATELOG is
  used and rarely observed under legitimate circumstances
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Image: '*\svchost.exe'
  SELECTION_3:
    ImageLoaded: '*\clfsw32.dll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Rarely observed
id: 33a2d1dd-f3b0-40bd-8baf-7974468927cc
level: high
logsource:
  category: image_load
  product: windows
references:
- https://www.fireeye.com/blog/threat-research/2021/09/unknown-actor-using-clfs-log-files-for-stealth.html
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
