
title: Tap Driver Installation
ruletype: Sigma
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
detection:
  SELECTION_1:
    Provider_Name: Service Control Manager
  SELECTION_2:
    EventID: 7045
  SELECTION_3:
    ImagePath: '*tap0901*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
level: medium
logsource:
  product: windows
  service: system
modified: 2021/11/30
status: experimental
tags:
- attack.exfiltration
- attack.t1048
