
title: StoneDrill Service Install
ruletype: Sigma
author: Florian Roth
date: 2017/03/07
description: This method detects a service install of the malicious Microsoft Network
  Realtime Inspection Service service described in StoneDrill report by Kaspersky
detection:
  SELECTION_1:
    Provider_Name: Service Control Manager
  SELECTION_2:
    EventID: 7045
  SELECTION_3:
    ServiceName: NtsSrv
  SELECTION_4:
    ServiceFileName: '* LocalService'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: 9e987c6c-4c1e-40d8-bd85-dd26fba8fdd6
level: high
logsource:
  product: windows
  service: system
modified: 2021/11/30
references:
- https://securelist.com/blog/research/77725/from-shamoon-to-stonedrill/
status: test
tags:
- attack.persistence
- attack.g0064
- attack.t1050
- attack.t1543.003
