
title: QuarksPwDump Clearing Access History
ruletype: Sigma
author: Florian Roth
date: 2017/05/15
description: Detects QuarksPwDump clearing access history in hive
detection:
  SELECTION_1:
    EventID: 16
  SELECTION_2:
    HiveName: '*\AppData\Local\Temp\SAM*'
  SELECTION_3:
    HiveName: '*.dmp'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 39f919f3-980b-4e6f-a975-8af7e507ef2b
level: critical
logsource:
  product: windows
  service: system
modified: 2021/11/27
status: test
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.002
