title: Netcat The Powershell Version
author: frack113
date: 2021/07/21
description: Adversaries may use a non-application layer protocol for communication
    between host and C2 server or among infected hosts within a network
detection:
    SELECTION_1:
        EventID: 4103
    SELECTION_2:
        ContextInfo: '*powercat *'
    SELECTION_3:
        ContextInfo: '*powercat.ps1*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2
level: medium
logsource:
    definition: PowerShell Module Logging must be enabled
    product: windows
    service: powershell
modified: 2021/09/07
references:
- https://nmap.org/ncat/
- https://github.com/besimorhino/powercat
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1095/T1095.md
status: experimental
tags:
- attack.command_and_control
- attack.t1095
yml_filename: powershell_powercat.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_module

