title: PowerShell Called from an Executable Version Mismatch
author: Sean Metcalf (source), Florian Roth (rule)
date: 2017/03/05
description: Detects PowerShell called from an executable by the version mismatch
    method
detection:
    SELECTION_1:
        EventID: 400
    SELECTION_2:
        EngineVersion: 2.*
    SELECTION_3:
        EngineVersion: 4.*
    SELECTION_4:
        EngineVersion: 5.*
    SELECTION_5:
        HostVersion: 3.*
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Penetration Tests
- Unknown
id: c70e019b-1479-4b65-b0cc-cd0c6093a599
level: high
logsource:
    definition: fields have to be extract from event
    product: windows
    service: powershell-classic
references:
- https://adsecurity.org/?p=2921
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059.001
- attack.t1086
yml_filename: powershell_exe_calling_ps.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_classic

