title: Abusable Invoke-ATHRemoteFXvGPUDisablementCommand
author: frack113
date: 2021/07/13
description: RemoteFXvGPUDisablement.exe is an abusable, signed PowerShell host executable
    that was introduced in Windows 10 and Server 2019 (OS Build 17763.1339).
detection:
    SELECTION_1:
        HostApplication: '*Invoke-ATHRemoteFXvGPUDisablementCommand *'
    SELECTION_2:
        HostApplication: '*-ModuleName *'
    SELECTION_3:
        HostApplication: '*-ModulePath *'
    SELECTION_4:
        HostApplication: '*-ScriptBlock *'
    SELECTION_5:
        HostApplication: '*-RemoteFXvGPUDisablementFilePath*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: f65e22f9-819e-4f96-9c7b-498364ae7a25
level: medium
logsource:
    definition: fields have to be extract from event
    product: windows
    service: powershell-classic
modified: 2021/09/07
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
related:
-   id: 38a7625e-b2cb-485d-b83d-aff137d859f4
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
yml_filename: powershell_classic_susp_athremotefxvgpudisablementcommand.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_classic

