title: Powershell Local Email Collection
author: frack113
date: 2021/07/21
description: "Adversaries may target user email on local systems to collect sensitive\
    \ information. Files containing email data can be acquired from a user\u2019s\
    \ local system, such as Outlook storage or cache files."
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        ScriptBlockText: '*Get-Inbox.ps1*'
    SELECTION_3:
        ScriptBlockText: '*Microsoft.Office.Interop.Outlook*'
    SELECTION_4:
        ScriptBlockText: '*Microsoft.Office.Interop.Outlook.olDefaultFolders*'
    SELECTION_5:
        ScriptBlockText: '*-comobject outlook.application*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
id: 2837e152-93c8-43d2-85ba-c3cd3c2ae614
level: medium
logsource:
    definition: Script block logging must be enabled
    product: windows
    service: powershell
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1114.001/T1114.001.md
status: experimental
tags:
- attack.collection
- attack.t1114.001
yml_filename: powershell_suspicious_mail_acces.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_script

