title: Automated Collection Command PowerShell
author: frack113
date: 2021/07/28
description: Once established within a system or network, an adversary may use automated
    techniques for collecting internal data.
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_10:
        ScriptBlockText: '*.txt*'
    SELECTION_11:
        ScriptBlockText: '*Get-ChildItem*'
    SELECTION_12:
        ScriptBlockText: '* -Recurse *'
    SELECTION_13:
        ScriptBlockText: '* -Include *'
    SELECTION_2:
        ScriptBlockText: '*.doc*'
    SELECTION_3:
        ScriptBlockText: '*.docx*'
    SELECTION_4:
        ScriptBlockText: '*.xls*'
    SELECTION_5:
        ScriptBlockText: '*.xlsx*'
    SELECTION_6:
        ScriptBlockText: '*.ppt*'
    SELECTION_7:
        ScriptBlockText: '*.pptx*'
    SELECTION_8:
        ScriptBlockText: '*.rtf*'
    SELECTION_9:
        ScriptBlockText: '*.pdf*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10)
        and SELECTION_11 and SELECTION_12 and SELECTION_13)
falsepositives:
- Unknown
id: c1dda054-d638-4c16-afc8-53e007f3fbc5
level: medium
logsource:
    definition: Script block logging must be enabled
    product: windows
    service: powershell
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1119/T1119.md
status: experimental
tags:
- attack.collection
- attack.t1119
yml_filename: powershell_automated_collection.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_script

