title: Netcat The Powershell Version
author: frack113
date: 2021/07/21
description: Adversaries may use a non-application layer protocol for communication
    between host and C2 server or among infected hosts within a network
detection:
    SELECTION_1:
        EventID: 400
    SELECTION_2:
        HostApplication: '*powercat *'
    SELECTION_3:
        HostApplication: '*powercat.ps1*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: c5b20776-639a-49bf-94c7-84f912b91c15
level: medium
logsource:
    definition: fields have to be extract from event
    product: windows
    service: powershell-classic
modified: 2021/09/07
references:
- https://nmap.org/ncat/
- https://github.com/besimorhino/powercat
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1095/T1095.md
related:
-   id: bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2
    type: derived
status: experimental
tags:
- attack.command_and_control
- attack.t1095
yml_filename: powershell_classic_powercat.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_classic

