title: Data Compressed - PowerShell
author: Timur Zinniatullin, oscd.community
date: 2019/10/21
description: An adversary may compress data (e.g., sensitive documents) that is collected
    prior to exfiltration in order to make it portable and minimize the amount of
    data sent over the network.
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        ScriptBlockText: '*-Recurse*'
    SELECTION_3:
        ScriptBlockText: '*|*'
    SELECTION_4:
        ScriptBlockText: '*Compress-Archive*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Highly likely if archive operations are done via PowerShell.
id: 6dc5d284-69ea-42cf-9311-fb1c3932a69a
level: low
logsource:
    definition: Script block logging must be enabled
    product: windows
    service: powershell
modified: 2021/07/06
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560/T1560.md
status: experimental
tags:
- attack.exfiltration
- attack.t1560
- attack.t1002
yml_filename: powershell_data_compressed.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_script

