title: Clear PowerShell History
author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2019/10/25
description: Detects keywords that could indicate clearing PowerShell history
detection:
    SELECTION_1:
        EventID: 4103
    SELECTION_2:
        Payload: '*del*'
    SELECTION_3:
        Payload: '*Remove-Item*'
    SELECTION_4:
        Payload: '*rm*'
    SELECTION_5:
        Payload: '*(Get-PSReadlineOption).HistorySavePath*'
    SELECTION_6:
        Payload: '*Set-PSReadlineOption*'
    SELECTION_7:
        Payload: "*\u2013HistorySaveStyle*"
    SELECTION_8:
        Payload: '*SaveNothing*'
    condition: (SELECTION_1 and (((SELECTION_2 or SELECTION_3 or SELECTION_4) and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate PowerShell scripts
id: f99276ad-d122-4989-a09a-d00904a5f9d2
level: medium
logsource:
    definition: PowerShell Module Logging must be enabled
    product: windows
    service: powershell
modified: 2020/11/28
references:
- https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
related:
-   id: dfba4ce1-e0ea-495f-986e-97140f31af2d
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.003
- attack.t1146
yml_filename: powershell_clear_powershell_history.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_module

