title: WMImplant Hack Tool
author: NVISO
date: 2020/03/26
description: Detects parameters used by WMImplant
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_10:
        ScriptBlockText: '* registry_mod *'
    SELECTION_11:
        ScriptBlockText: '* remote_posh *'
    SELECTION_12:
        ScriptBlockText: '* sched_job *'
    SELECTION_13:
        ScriptBlockText: '* service_mod *'
    SELECTION_14:
        ScriptBlockText: '* process_kill *'
    SELECTION_15:
        ScriptBlockText: '* active_users *'
    SELECTION_16:
        ScriptBlockText: '* basic_info *'
    SELECTION_17:
        ScriptBlockText: '* power_off *'
    SELECTION_18:
        ScriptBlockText: '* vacant_system *'
    SELECTION_19:
        ScriptBlockText: '* logon_events *'
    SELECTION_2:
        ScriptBlockText: '*WMImplant*'
    SELECTION_3:
        ScriptBlockText: '* change_user *'
    SELECTION_4:
        ScriptBlockText: '* gen_cli *'
    SELECTION_5:
        ScriptBlockText: '* command_exec *'
    SELECTION_6:
        ScriptBlockText: '* disable_wdigest *'
    SELECTION_7:
        ScriptBlockText: '* disable_winrm *'
    SELECTION_8:
        ScriptBlockText: '* enable_wdigest *'
    SELECTION_9:
        ScriptBlockText: '* enable_winrm *'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14 or SELECTION_15
        or SELECTION_16 or SELECTION_17 or SELECTION_18 or SELECTION_19))
falsepositives:
- Administrative scripts that use the same keywords.
id: 8028c2c3-e25a-46e3-827f-bbb5abf181d7
level: high
logsource:
    definition: Script block logging must be enabled
    product: windows
    service: powershell
modified: 2021/08/30
references:
- https://github.com/FortyNorthSecurity/WMImplant
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.t1059.001
- attack.t1086
yml_filename: powershell_wmimplant.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_script

