title: Invoke-Obfuscation RUNDLL LAUNCHER
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
detection:
    SELECTION_1:
        EventID: 4103
    SELECTION_2:
        Payload|re: (?i).*rundll32(?:\.exe)?(?:\s+)?shell32\.dll.*shellexec_rundll.*powershell.*\"
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: a23791fe-8846-485a-b16b-ca691e1b03d4
level: medium
logsource:
    definition: PowerShell Module Logging must be enabled
    product: windows
    service: powershell
modified: 2021/10/07
references:
- https://github.com/Neo23x0/sigma/issues/1009
related:
-   id: e6cb92b4-b470-4eb8-8a9d-d63e8583aae0
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
yml_filename: powershell_invoke_obfuscation_via_rundll.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_module

