title: Execution via CL_Mutexverifiers.ps1 (2 Lines)
author: oscd.community, Natalia Shornikova
date: 2020/10/14
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1
    module
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        ScriptBlockText: '*CL_Mutexverifiers.ps1*'
    SELECTION_3:
        ScriptBlockText: '*runAfterCancelProcess*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))| count(ScriptBlockText)
        by Computer > 2
falsepositives:
- Unknown
id: 6609c444-9670-4eab-9636-fe4755a851ce
level: high
logsource:
    definition: Script block logging must be enabled
    product: windows
    service: powershell
modified: 2021/05/21
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/CL_mutexverifiers.yml
- https://twitter.com/pabraeken/status/995111125447577600
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
yml_filename: powershell_cl_mutexverifiers_lolscript_count.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_script

