title: Powershell Store File In Alternate Data Stream
author: frack113
date: 2021/09/02
description: Storing files in Alternate Data Stream (ADS) similar to Astaroth malware.
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        ScriptBlockText: '*Start-Process*'
    SELECTION_3:
        ScriptBlockText: '*-FilePath "$env:comspec" *'
    SELECTION_4:
        ScriptBlockText: '*-ArgumentList *'
    SELECTION_5:
        ScriptBlockText: '*>*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: a699b30e-d010-46c8-bbd1-ee2e26765fe9
level: medium
logsource:
    definition: EnableScriptBlockLogging must be set to enable
    product: windows
    service: powershell
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1564.004/T1564.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
yml_filename: powershell_store_file_in_alternate_data_stream.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_script

