title: Suspicious PowerShell Download
author: Florian Roth
date: 2017/03/05
description: Detects suspicious PowerShell download command
detection:
    SELECTION_1:
        EventID: 400
    SELECTION_2:
        HostApplication: '*System.Net.WebClient*'
    SELECTION_3:
        HostApplication: '*.DownloadFile(*'
    SELECTION_4:
        HostApplication: '*.DownloadString(*'
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4))
falsepositives:
- PowerShell scripts that download content from the Internet
id: 3236fcd0-b7e3-4433-b4f8-86ad61a9af2d
level: medium
logsource:
    definition: fields have to be extract from event
    product: windows
    service: powershell-classic
modified: 2021/09/21
related:
-   id: 65531a81-a694-4e31-ae04-f8ba5bc33759
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
yml_filename: powershell_classic_suspicious_download.yml
yml_path: /home/itib/git/sigma/rules/windows/powershell/powershell_classic

