
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "all of them\n"
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    EventID: 7
  SELECTION_3:
    UserName: abc
  SELECTION_4:
    process: nnn
  SELECTION_5:
    parentprocess: sss
  SELECTION_6:
    uuu: zzzz
  SELECTION_7:
    xxxx: yyyyy
  condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
