
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "base64 encode modifier\n"
detection:
  SELECTION_1:
    UserName: YmFzZTY0X2VuY29kZWQ=
  SELECTION_2:
    TargetUserName: test_start
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
