
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "list test\n"
detection:
  SELECTION_1:
    EventID: 4100
  SELECTION_2:
    EventID: 9000
  SELECTION_3:
    EventID: 8000
  SELECTION_4:
    EventID: aaaa
  SELECTION_5:
    ObjectType: Key
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
