
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "condition or\n"
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    aaa: bbb
  SELECTION_3:
    ccc: ddd
  SELECTION_4:
    eee: fff
  condition: (SELECTION_1 or SELECTION_2 or SELECTION_3 or SELECTION_4)
  timeflame: 2d
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
