
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "all modifier\n"
detection:
  SELECTION_1:
  - 2
  - dee
  - testtesttest
  SELECTION_2:
    EventID: 22
  SELECTION_3:
    EventID: 33
  SELECTION_4:
    EventID: hoge
  condition: ((SELECTION_1) and (SELECTION_2 and SELECTION_3 and SELECTION_4))
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
