
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "endswith pipe modifier and startswith pipe modifier\n"
detection:
  SELECTION_1:
    UserName: '*hogehoge_end'
  SELECTION_2:
    TargetUserName: test_start*
  condition: (SELECTION_1 or SELECTION_2)
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
