
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "all of test\n"
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    EventID: 7
  SELECTION_3:
    EventID: a
  SELECTION_4:
    UserName: abc
  SELECTION_5:
    process: nnn
  SELECTION_6:
    parentprocess: 2
  SELECTION_7:
    uuu: zzzz
  SELECTION_8:
    xxxx: 3
  SELECTION_9:
    ppp: iiii
  condition: (((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7 and SELECTION_8) or SELECTION_9)
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
