
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "condition count\n"
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    aaa: bbb
  condition: (SELECTION_1 and  not (SELECTION_2)) | count(TEAMNAME) by HOGE < 3
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
