title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "simple test\n"
detection:
  SELECTION_1:
    EventID: 4100
  condition: SELECTION_1
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
status: experimental
