title: Invoke-Obfuscation Via Use MSHTA
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
    SELECTION_1:
        ImagePath|re: (?i).*(set).*(&&).*(mshta).*(vbscript:createobject).*(\.run).*\(window\.close\).*"
    SELECTION_2:
        EventID: 7045
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 7e9c7999-0f9b-4d4a-a6ed-af6d553d4af4
level: high
logsource:
    product: windows
    service: system
modified: 2021/09/18
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
yml_filename: win_invoke_obfuscation_via_use_mshta_services.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

