
title: MMC20 Lateral Movement
author: '@2xxeformyshirt (Security Risk Advisors) - rule; Teymur Kheirkhabarov (idea)'
date: 2020/03/04
description: Detects MMC20.Application Lateral Movement; specifically looks for the
  spawning of the parent MMC.exe with a command line of "-Embedding" as a child of
  svchost.exe
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage: '*\svchost.exe'
  SELECTION_3:
    Image: '*\mmc.exe'
  SELECTION_4:
    CommandLine: '*-Embedding*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: f1f3bf22-deb2-418d-8cce-e1a45e46a5bd
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/23
references:
- https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view?usp=sharing
tags:
- attack.execution
- attack.t1175
- attack.t1021.003
