title: HybridConnectionManager Service Installation
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/04/12
description: Rule to detect the Hybrid Connection Manager service installation.
detection:
    SELECTION_1:
        EventID: 4697
    SELECTION_2:
        ServiceName: HybridConnectionManager
    SELECTION_3:
        ServiceFileName: '*HybridConnectionManager*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use of Hybrid Connection Manager via Azure function apps.
id: 0ee4d8a5-4e67-4faf-acfa-62a78457d1f2
level: high
logsource:
    product: windows
    service: security
modified: 2021/08/09
references:
- https://twitter.com/Cyb3rWard0g/status/1381642789369286662
status: experimental
tags:
- attack.persistence
yml_filename: win_hybridconnectionmgr_svc_installation.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

