
title: Valid Users Failing to Authenticate from Single Source Using NTLM
author: Mauricio Velazco
date: 2021/06/01
description: Detects failed logins with multiple valid domain accounts from a single
  source system using the NTLM protocol.
detection:
  SELECTION_1:
    EventID: 4776
  SELECTION_2:
    Status: '*0xC000006A'
  SELECTION_3:
    TargetUserName: '*$'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3)) | count(TargetUserName)
    by Workstation > 10
falsepositives:
- Terminal servers
- Jump servers
- Other multiuser systems like Citrix server farms
- Workstations with frequently changing users
id: f88bab7f-b1f4-41bb-bdb1-4b8af35b0470
level: medium
logsource:
  product: windows
  service: security
modified: 2021/07/07
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation
