title: Sysmon Channel Reference Deletion
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/07/14
description: Potential threat actor tampering with Sysmon manifest and eventually
    disabling it
detection:
    SELECTION_1:
        ObjectName: '*WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}*'
    SELECTION_2:
        ObjectName: '*WINEVT\Channels\Microsoft-Windows-Sysmon/Operational*'
    SELECTION_3:
        EventID: 4657
    SELECTION_4:
        ObjectValueName: Enabled
    SELECTION_5:
        NewValue: '0'
    SELECTION_6:
        EventID: 4663
    SELECTION_7:
        AccessMask: 65536
    condition: ((SELECTION_1 or SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- unknown
id: 18beca67-ab3e-4ee3-ba7a-a46ca8d7d0cc
level: critical
logsource:
    product: windows
    service: security
references:
- https://twitter.com/Flangvik/status/1283054508084473861
- https://twitter.com/SecurityJosh/status/1283027365770276866
- https://securityjosh.github.io/2020/04/23/Mute-Sysmon.html
- https://gist.github.com/Cyb3rWard0g/cf08c38c61f7e46e8404b38201ca01c8
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
yml_filename: win_sysmon_channel_reference_deletion.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

