title: Tap Driver Installation
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunnelling techniques
detection:
    SELECTION_1:
        EventID: 7045
    SELECTION_2:
        ImagePath: '*tap0901*'
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
level: medium
logsource:
    product: windows
    service: system
modified: 2021/09/21
status: experimental
tags:
- attack.exfiltration
- attack.t1048
yml_filename: win_tap_driver_installation.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

