title: Reconnaissance Activity
author: Florian Roth (rule), Jack Croock (method), Jonhnathan Ribeiro (improvements),
    oscd.community
date: 2017/03/07
description: Detects activity as "net user administrator /domain" and "net group domain
    admins /domain"
detection:
    SELECTION_1:
        EventID: 4661
    SELECTION_2:
        ObjectType: SAM_USER
    SELECTION_3:
        ObjectType: SAM_GROUP
    SELECTION_4:
        ObjectName: S-1-5-21-*
    SELECTION_5:
        AccessMask: '0x2d'
    SELECTION_6:
        ObjectName: '*-500'
    SELECTION_7:
        ObjectName: '*-512'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
        and (SELECTION_6 or SELECTION_7))
falsepositives:
- Administrator activity
- Penetration tests
id: 968eef52-9cff-4454-8992-1e74b9cbad6c
level: high
logsource:
    definition: The volume of Event ID 4661 is high on Domain Controllers and therefore
        "Audit SAM" and "Audit Kernel Object" advanced audit policy settings are not
        configured in the recommendations for server systems
    product: windows
    service: security
modified: 2020/08/23
references:
- https://findingbad.blogspot.de/2017/01/hunting-what-does-it-look-like.html
status: experimental
tags:
- attack.discovery
- attack.t1087
- attack.t1087.002
- attack.t1069
- attack.t1069.002
- attack.s0039
yml_filename: win_susp_net_recon_activity.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

