
title: Suspicious Werfault.exe Network Connection Outbound
author: Sreeman
date: 2021/03/09
description: Adversaries can migrate cobalt strike/metasploit/C2 beacons on compromised
  systems to legitimate werfault.exe process to avoid detection.
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    Image: werfault.exe
  SELECTION_3:
    EventID: 3
  SELECTION_4:
    ParentImage: svchost.exe
  SELECTION_5:
    DestinationIp:
    - 104.42.151.234
    - 104.43.193.48
    - 52.255.188.83
    - 13.64.90.137
    - 168.61.161.212
    - 13.88.21.125
    - 40.88.32.150
    - 52.147.198.201
    - 52.239.207.100
    - 52.176.224.96
    - 2607:7700:0:24:0:1:287e:1894
    - 10.*
    - 192.168.*
    - 127.*
  SELECTION_6:
    DestinationHostname:
    - '*.windowsupdate.com*'
    - '*.microsoft.com*'
  condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3 and SELECTION_4 and
    SELECTION_5 and SELECTION_6)))
falsepositives:
- Communication to other corporate systems that use IP addresses from public address
  spaces and Microsoft IP spaces
id: e12c75f2-d09e-43f6-90e4-6a23842907af
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2021/06/11
references:
- https://thedfirreport.com/2021/03/08/bazar-drops-the-anchor/
status: experimental
tags:
- attack.command_and_control
- attack.t1571
