title: Active Directory Replication from Non Machine Account
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/07/26
description: Detects potential abuse of Active Directory Replication Service (ADRS)
    from a non machine account to request credentials.
detection:
    SELECTION_1:
        EventID: 4662
    SELECTION_2:
        AccessMask: '0x100'
    SELECTION_3:
        Properties: '*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*'
    SELECTION_4:
        Properties: '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
    SELECTION_5:
        Properties: '*89e95b76-444d-4c62-991a-0facbeda640c*'
    SELECTION_6:
        SubjectUserName: '*$'
    SELECTION_7:
        SubjectUserName: MSOL_*
    condition: ((SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4 or SELECTION_5))
        and  not (SELECTION_6 or SELECTION_7))
falsepositives:
- Unknown
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
id: 17d619c1-e020-4347-957e-1d1207455c93
level: critical
logsource:
    product: windows
    service: security
modified: 2020/08/23
references:
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-180815210510.html
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.006
yml_filename: win_ad_replication_non_machine_account.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

