title: Detected Windows Software Discovery
author: Nikita Nazarov, oscd.community
date: 2020/10/16
description: Adversaries may attempt to enumerate software for a variety of reasons,
    such as figuring out what security measures are present or if the compromised
    system has a version of software that is vulnerable.
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        ScriptBlockText: '*get-itemProperty*'
    SELECTION_3:
        ScriptBlockText: '*\software\\*'
    SELECTION_4:
        ScriptBlockText: '*select-object*'
    SELECTION_5:
        ScriptBlockText: '*format-table*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitimate administration activities
id: 2650dd1a-eb2a-412d-ac36-83f06c4f2282
level: medium
logsource:
    definition: Script block logging must be enabled
    product: windows
    service: powershell
modified: 2021/09/21
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1518/T1518.md
- https://github.com/harleyQu1nn/AggressorScripts
status: experimental
tags:
- attack.discovery
- attack.t1518
yml_filename: win_software_discovery.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

