title: Scanner PoC for CVE-2019-0708 RDP RCE Vuln
author: Florian Roth (rule), Adam Bradbury (idea)
date: 2019/06/02
description: Detects the use of a scanner by zerosum0x0 that discovers targets vulnerable
    to  CVE-2019-0708 RDP RCE aka BlueKeep
detection:
    SELECTION_1:
        EventID: 4625
    SELECTION_2:
        AccountName: AAAAAAA
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unlikely
id: 8400629e-79a9-4737-b387-5db940ab2367
level: critical
logsource:
    product: windows
    service: security
references:
- https://twitter.com/AdamTheAnalyst/status/1134394070045003776
- https://github.com/zerosum0x0/CVE-2019-0708
tags:
- attack.lateral_movement
- attack.t1210
- car.2013-07-002
yml_filename: win_rdp_bluekeep_poc_scanner.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

