title: Turla Service Install
author: Florian Roth
date: 2017/03/31
description: This method detects a service install of malicious services mentioned
    in Carbon Paper - Turla report by ESET
detection:
    SELECTION_1:
        EventID: 7045
    SELECTION_2:
        ServiceName: srservice
    SELECTION_3:
        ServiceName: ipvpn
    SELECTION_4:
        ServiceName: hkmsvc
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: 1df8b3da-b0ac-4d8a-b7c7-6cb7c24160e4
level: high
logsource:
    product: windows
    service: system
references:
- https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/
tags:
- attack.persistence
- attack.g0010
- attack.t1050
- attack.t1543.003
yml_filename: win_apt_carbonpaper_turla.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

