title: Impacket PsExec Execution
author: Bhabesh Raj
date: 2020/12/14
description: Detects execution of Impacket's psexec.py.
detection:
    SELECTION_1:
        EventID: 5145
    SELECTION_2:
        ShareName: \\*\IPC$
    SELECTION_3:
        RelativeTargetName: '*RemCom_stdint*'
    SELECTION_4:
        RelativeTargetName: '*RemCom_stdoutt*'
    SELECTION_5:
        RelativeTargetName: '*RemCom_stderrt*'
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- nothing observed so far
id: 32d56ea1-417f-44ff-822b-882873f5f43b
level: high
logsource:
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
    product: windows
    service: security
references:
- https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
tags:
- attack.lateral_movement
- attack.t1021.002
yml_filename: win_impacket_psexec.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

