title: Potential RDP Exploit CVE-2019-0708
author: Lionel PRAT, Christophe BROCAS, @atc_project (improvements)
date: 2019/05/24
description: Detect suspicious error on protocol RDP, potential CVE-2019-0708
detection:
    SELECTION_1:
        EventID: 56
    SELECTION_2:
        EventID: 50
    SELECTION_3:
        Source: TermDD
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3)
falsepositives:
- Bad connections or network interruptions
id: aaa5b30d-f418-420b-83a0-299cb6024885
level: high
logsource:
    product: windows
    service: system
modified: 2020/08/23
references:
- https://github.com/zerosum0x0/CVE-2019-0708
- https://github.com/Ekultek/BlueKeep
status: experimental
tags:
- attack.lateral_movement
- attack.t1210
- car.2013-07-002
yml_filename: win_rdp_potential_cve_2019_0708.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

