title: Invoke-Obfuscation COMPRESS OBFUSCATION
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
    SELECTION_1:
        ImagePath|re: (?i).*new-object.*(?:system\.io\.compression\.deflatestream|system\.io\.streamreader).*text\.encoding\]::ascii.*readtoend
    SELECTION_2:
        EventID: 7045
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- unknown
id: 175997c5-803c-4b08-8bb0-70b099f47595
level: medium
logsource:
    product: windows
    service: system
modified: 2021/08/09
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
yml_filename: win_invoke_obfuscation_via_compress_services.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

