title: Vulnerable Netlogon Secure Channel Connection Allowed
author: NVISO
date: 2020/09/15
description: Detects that a vulnerable Netlogon secure channel connection was allowed,
    which could be an indicator of CVE-2020-1472.
detection:
    SELECTION_1:
        EventID: 5829
    condition: SELECTION_1
falsepositives:
- Unknown
fields:
- SAMAccountName
id: a0cb7110-edf0-47a4-9177-541a4083128a
level: high
logsource:
    product: windows
    service: system
modified: 2021/08/09
references:
- https://support.microsoft.com/en-us/help/4557222/how-to-manage-the-changes-in-netlogon-secure-channel-connections-assoc
status: experimental
tags:
- attack.privilege_escalation
yml_filename: win_vul_cve_2020_1472.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

