title: Suspicious Remote Logon with Explicit Credentials
author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st
date: 2020/10/05
description: Detects suspicious processes logging on with explicit credentials
detection:
    SELECTION_1:
        EventID: 4648
    SELECTION_10:
        TargetServerName: localhost
    SELECTION_2:
        Image: '*\cmd.exe'
    SELECTION_3:
        Image: '*\powershell.exe'
    SELECTION_4:
        Image: '*\pwsh.exe'
    SELECTION_5:
        Image: '*\winrs.exe'
    SELECTION_6:
        Image: '*\wmic.exe'
    SELECTION_7:
        Image: '*\net.exe'
    SELECTION_8:
        Image: '*\net1.exe'
    SELECTION_9:
        Image: '*\reg.exe'
    condition: ((SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9)) and  not (SELECTION_10))
falsepositives:
- Administrators that use the RunAS command or scheduled tasks
id: 941e5c45-cda7-4864-8cea-bbb7458d194a
level: medium
logsource:
    product: windows
    service: security
modified: 2021/07/07
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
status: experimental
tags:
- attack.t1078
- attack.lateral_movement
yml_filename: win_susp_logon_explicit_credentials.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

