title: Transferring Files with Credential Data via Network Shares
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
description: Transferring files with well-known filenames (sensitive files with credential
    data) using network shares
detection:
    SELECTION_1:
        EventID: 5145
    SELECTION_2:
        RelativeTargetName: '*\mimidrv*'
    SELECTION_3:
        RelativeTargetName: '*\lsass*'
    SELECTION_4:
        RelativeTargetName: '*\windows\minidump\\*'
    SELECTION_5:
        RelativeTargetName: '*\hiberfil*'
    SELECTION_6:
        RelativeTargetName: '*\sqldmpr*'
    SELECTION_7:
        RelativeTargetName: '*\sam*'
    SELECTION_8:
        RelativeTargetName: '*\ntds.dit*'
    SELECTION_9:
        RelativeTargetName: '*\security*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9))
falsepositives:
- Transferring sensitive files for legitimate administration work by legitimate administrator
id: 910ab938-668b-401b-b08c-b596e80fdca5
level: medium
logsource:
    product: windows
    service: security
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.002
- attack.t1003.001
- attack.t1003.003
yml_filename: win_transferring_files_with_credential_data_via_network_shares.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

