title: Invoke-Obfuscation Via Stdin
author: Nikita Nazarov, oscd.community
date: 2020/10/12
description: Detects Obfuscated Powershell via Stdin in Scripts
detection:
    SELECTION_1:
        ImagePath|re: (?i).*(set).*&&\s?set.*(environment|invoke|\${?input).*&&.*"
    SELECTION_2:
        EventID: 7045
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 487c7524-f892-4054-b263-8a0ace63fc25
level: high
logsource:
    product: windows
    service: system
modified: 2021/09/18
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
yml_filename: win_invoke_obfuscation_via_stdin_services.yml
yml_path: /home/itib/git/sigma/rules/windows/builtin

