
title: Volume Shadow Copy Mount
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/20
description: Detects volume shadow copy mount
detection:
  SELECTION_1:
    Source: Microsoft-Windows-Ntfs
  SELECTION_2:
    EventID: 98
  SELECTION_3:
    DeviceName: '*HarddiskVolumeShadowCopy*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use of volume shadow copy mounts (backups maybe).
id: f512acbf-e662-4903-843e-97ce4652b740
level: medium
logsource:
  product: windows
  service: system
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
