
title: VSSAudit Security Event Source Registration
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/20
description: Detects the registration of the security event source VSSAudit. It would
  usually trigger when volume shadow copy operations happen.
detection:
  SELECTION_1:
    AuditSourceName: VSSAudit
  SELECTION_2:
    EventID: 4904
  SELECTION_3:
    EventID: 4905
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Legitimate use of VSSVC. Maybe backup operations. It would usually be done by C:\Windows\System32\VSSVC.exe.
id: e9faba72-4974-4ab2-a4c5-46e25ad59e9b
level: medium
logsource:
  product: windows
  service: security
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
