
title: PowerShell Scripts Run by a Services
author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects powershell script installed as a Service
detection:
  SELECTION_1:
    EventID: 6
  SELECTION_2:
    ImageLoaded:
    - '*powershell*'
    - '*pwsh*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 46deb5e1-28c9-4905-b2df-51cdcc9e6073
level: high
logsource:
  category: driver_load
  product: windows
modified: 2021/09/21
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
related:
- id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1569.002
ruletype: SIGMA
