title: PsExec Tool Execution
author: Thomas Patzke
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
    Sysmon)
detection:
    SELECTION_1:
        EventID: 17
    SELECTION_2:
        EventID: 18
    SELECTION_3:
        PipeName: \PSEXESVC
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3)
falsepositives:
- unknown
fields:
- EventID
- CommandLine
- ParentCommandLine
- ServiceName
- ServiceFileName
- TargetFilename
- PipeName
id: f3f3a972-f982-40ad-b63c-bca6afdfad7c
level: low
logsource:
    category: pipe_created
    product: windows
modified: 2021/09/21
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
related:
-   id: 42c575ea-e41e-41f1-b248-8093c3e82a28
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1035
- attack.t1569.002
- attack.s0029
yml_filename: pipe_created_tool_psexec.yml
yml_path: /home/itib/git/sigma/rules/windows/pipe_created

