
title: ADFS Database Named Pipe Connection
author: Roberto Rodriguez @Cyb3rWard0g
date: 2021/10/08
description: Detects suspicious local connections via a named pipe to the AD FS configuration
  database (Windows Internal Database). Used to access information such as the AD
  FS configuration settings which contains sensitive information used to sign SAML
  tokens.
detection:
  SELECTION_1:
    PipeName: \MICROSOFT##WID\tsql\query
  SELECTION_2:
    Image:
    - '*Microsoft.IdentityServer.ServiceHost.exe'
    - '*Microsoft.Identity.Health.Adfs.PshSurrogate.exe'
    - '*AzureADConnect.exe'
    - '*Microsoft.Tri.Sensor.exe'
    - '*wsmprovhost.exe'
    - '*mmc.exe'
    - '*sqlservr.exe'
  condition: (SELECTION_1 and  not (SELECTION_2))
falsepositives:
- Processes in the filter condition
id: 1ea13e8c-03ea-409b-877d-ce5c3d2c1cb3
level: critical
logsource:
  product: windows
  service: pipe_connected
modified: 2021/10/08
references:
- https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/ADFSDBNamedPipeConnection.yaml
- https://o365blog.com/post/adfs/
- https://github.com/Azure/SimuLand
status: experimental
tags:
- attack.collection
- attack.t1005
