
title: Turla Group Named Pipes
author: Markus Neis
date: 2017/11/06
description: Detects a named pipe used by Turla group samples
detection:
  SELECTION_1:
    EventID: 17
  SELECTION_2:
    EventID: 18
  SELECTION_3:
    PipeName:
    - \atctl
    - \userpipe
    - \iehelper
    - \sdlrpc
    - \comnap
  condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3)
falsepositives:
- Unknown
id: 739915e4-1e70-4778-8b8a-17db02f66db1
level: critical
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for PipeEvents in Symson config
  product: windows
references:
- Internal Research
status: experimental
tags:
- attack.g0010
