title: Malicious Named Pipe
author: Florian Roth, blueteam0ps
date: 2017/11/06
description: Detects the creation of a named pipe used by known APT malware
detection:
    SELECTION_1:
        EventID: 17
    SELECTION_10:
        PipeName: \46a676ab7f179e511e30dd2dc41bd388
    SELECTION_11:
        PipeName: \9f81f59bc58452127884ce513865ed20
    SELECTION_12:
        PipeName: \e710f28d59aa529d6792ca6ff0ca1b34
    SELECTION_13:
        PipeName: \rpchlp_3
    SELECTION_14:
        PipeName: \NamePipe_MoreWindows
    SELECTION_15:
        PipeName: \pcheap_reuse
    SELECTION_16:
        PipeName: \gruntsvc
    SELECTION_17:
        PipeName: \583da945-62af-10e8-4902-a8f205c72b2e
    SELECTION_18:
        PipeName: \bizkaz
    SELECTION_19:
        PipeName: \svcctl
    SELECTION_2:
        EventID: 18
    SELECTION_20:
        PipeName: \Posh*
    SELECTION_21:
        PipeName: \jaccdpqnvbrrxlaf
    SELECTION_22:
        PipeName: \csexecsvc
    SELECTION_23:
        PipeName: \6e7645c4-32c5-4fe3-aabf-e94c2f4370e7
    SELECTION_3:
        PipeName: \isapi_http
    SELECTION_4:
        PipeName: \isapi_dg
    SELECTION_5:
        PipeName: \isapi_dg2
    SELECTION_6:
        PipeName: \sdlrpc
    SELECTION_7:
        PipeName: \ahexec
    SELECTION_8:
        PipeName: \winsession
    SELECTION_9:
        PipeName: \lsassw
    condition: ((SELECTION_1 or SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14 or SELECTION_15
        or SELECTION_16 or SELECTION_17 or SELECTION_18 or SELECTION_19 or SELECTION_20
        or SELECTION_21 or SELECTION_22 or SELECTION_23))
falsepositives:
- Unknown
id: fe3ac066-98bb-432a-b1e7-a5229cb39d4a
level: critical
logsource:
    category: pipe_created
    definition: Note that you have to configure logging for PipeEvents in Sysmon config
    product: windows
references:
- Various sources
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
yml_filename: sysmon_mal_namedpipes.yml
yml_path: /home/itib/git/sigma/rules/windows/pipe_created

