
title: Cred Dump-Tools Named Pipes
author: Teymur Kheirkhabarov, oscd.community
date: 2019/11/01
description: Detects well-known credential dumping tools execution via specific named
  pipes
detection:
  SELECTION_1:
    EventID: 17
  SELECTION_2:
    EventID: 18
  SELECTION_3:
    PipeName:
    - '*\lsadump*'
    - '*\cachedump*'
    - '*\wceservicepipe*'
  condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3)
falsepositives:
- Legitimate Administrator using tool for password recovery
id: 961d0ba2-3eea-4303-a930-2cf78bbfcc5e
level: critical
logsource:
  category: pipe_created
  product: windows
modified: 2020/08/28
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
