
title: Dnscat Execution
author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
description: Dnscat exfiltration tool execution
detection:
  SELECTION_1:
    EventID: 4104
  SELECTION_2:
    ScriptBlockText: '*Start-Dnscat2*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate usage of PowerShell Dnscat2 — DNS Exfiltration tool (unlikely)
id: a6d67db4-6220-436d-8afc-f3842fe05d43
level: critical
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2020/08/24
status: experimental
tags:
- attack.exfiltration
- attack.t1048
- attack.execution
- attack.t1059.001
- attack.t1086
