
title: PowerShell Execution
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
description: Detects execution of PowerShell
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Description: System.Management.Automation
  SELECTION_3:
    ImageLoaded: '*System.Management.Automation*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- ComputerName
- Image
- ProcessID
- ImageLoaded
id: 867613fb-fa60-4497-a017-a82df74a172c
level: medium
logsource:
  category: image_load
  product: windows
modified: 2019/11/10
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
status: experimental
tags:
- attack.execution
- attack.t1086
- attack.t1059.001
