title: Time Travel Debugging Utility Usage
author: "Ensar \u015Eamil, @sblmsrsn, @oscd_initiative"
date: 2020/10/06
description: Detects usage of Time Travel Debugging Utility. Adversaries can execute
    malicious processes and dump processes, such as lsass.exe, via tttracer.exe.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        ImageLoaded: '*\ttdrecord.dll'
    SELECTION_3:
        ImageLoaded: '*\ttdwriter.dll'
    SELECTION_4:
        ImageLoaded: '*\ttdloader.dll'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate usage by software developers/testers
id: e76c8240-d68f-4773-8880-5c6f63595aaf
level: high
logsource:
    category: image_load
    product: windows
modified: 2021/09/21
references:
- https://lolbas-project.github.io/lolbas/Binaries/Tttracer/
- https://twitter.com/mattifestation/status/1196390321783025666
- https://twitter.com/oulusoyum/status/1191329746069655553
status: experimental
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1218
- attack.t1003.001
yml_filename: sysmon_tttracer_mod_load.yml
yml_path: /home/itib/git/sigma/rules/windows/image_load

