title: Unsigned Image Loaded Into LSASS Process
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
description: Loading unsigned image (DLL, EXE) into LSASS process
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Image: '*\lsass.exe'
    SELECTION_3:
        Signed: 'false'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Valid user connecting using RDP
id: 857c8db3-c89b-42fb-882b-f681c7cf4da2
level: medium
logsource:
    category: image_load
    product: windows
modified: 2020/08/23
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
yml_filename: sysmon_unsigned_image_loaded_into_lsass.yml
yml_path: /home/itib/git/sigma/rules/windows/image_load

