
title: Active Directory Kerberos DLL Loaded Via Office Applications
author: Antonlovesdnb
date: 2020/02/19
description: Detects Kerberos DLL being loaded by an Office Product
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Image:
    - '*\winword.exe'
    - '*\powerpnt.exe'
    - '*\excel.exe'
    - '*\outlook.exe'
  SELECTION_3:
    ImageLoaded:
    - '*\kerberos.dll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: 7417e29e-c2e7-4cf6-a2e8-767228c64837
level: high
logsource:
  category: image_load
  product: windows
modified: 2020/08/23
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: experimental
tags:
- attack.execution
- attack.t1204
- attack.t1204.002
