
title: In-memory PowerShell
author: Tom Kern, oscd.community, Natalia Shornikova
date: 2019/11/14
description: Detects loading of essential DLL used by PowerShell, but not by the process
  powershell.exe. Detects meterpreter's "load powershell" extension.
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    ImageLoaded:
    - '*\System.Management.Automation.Dll'
    - '*\System.Management.Automation.ni.Dll'
  SELECTION_3:
    Image:
    - '*\powershell.exe'
    - '*\powershell_ise.exe'
    - '*\WINDOWS\System32\sdiagnhost.exe'
    - '*\mscorsvw.exe'
    - '*\WINDOWS\System32\RemoteFXvGPUDisablement.exe'
    - '*\sqlps.exe'
    - '*\wsmprovhost.exe'
    - '*\winrshost.exe'
    - '*\syncappvpublishingserver.exe'
    - '*\runscripthelper.exe'
    - '*\ServerManager.exe'
  condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
enrichment:
- EN_0001_cache_sysmon_event_id_1_info
- EN_0003_enrich_other_sysmon_events_with_event_id_1_data
falsepositives:
- Used by some .NET binaries, minimal on user workstation.
id: 092bc4b9-3d1d-43b4-a6b4-8c8acd83522f
level: high
logsource:
  category: image_load
  product: windows
modified: 2020/10/12
references:
- https://adsecurity.org/?p=2921
- https://github.com/p3nt4/PowerShdll
status: experimental
tags:
- attack.t1086
- attack.t1059.001
- attack.execution
