
title: Invoke-Obfuscation Via Use Clip
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
detection:
  SELECTION_1:
    ImagePath|re: (?i).*?echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?).*
  SELECTION_2:
    EventID: 7045
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 63e3365d-4824-42d8-8b82-e56810fefa0c
level: high
logsource:
  product: windows
  service: system
modified: 2021/09/18
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
ruletype: SIGMA
