
title: Register new Logon Process by Rubeus
author: Roberto Rodriguez (source), Ilyas Ochkov (rule), oscd.community
date: 2019/10/24
description: Detects potential use of Rubeus via registered new trusted logon process
detection:
  SELECTION_1:
    EventID: 4611
  SELECTION_2:
    LogonProcessName: User32LogonProcesss
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 12e6d621-194f-4f59-90cc-1959e21e69f7
level: critical
logsource:
  product: windows
  service: security
modified: 2021/08/14
references:
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
status: experimental
tags:
- attack.lateral_movement
- attack.privilege_escalation
- attack.t1208
- attack.t1558.003
