
title: Multiple Users Failing to Authenticate from Single Process
author: Mauricio Velazco
date: 2021/06/01
description: Detects failed logins with multiple accounts from a single process on
  the system.
detection:
  SELECTION_1:
    EventID: 4625
  SELECTION_2:
    LogonType: 2
  SELECTION_3:
    ProcessName: '-'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3)) | count(TargetUserName)
    by ProcessName > 10
falsepositives:
- Terminal servers
- Jump servers
- Other multiuser systems like Citrix server farms
- Workstations with frequently changing users
id: fe563ab6-ded4-4916-b49f-a3a8445fe280
level: medium
logsource:
  product: windows
  service: security
modified: 2021/07/07
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
- https://www.trimarcsecurity.com/single-post/2018/05/06/trimarc-research-detecting-password-spraying-with-security-event-auditing
status: experimental
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation
ruletype: SIGMA
