
title: Invoke-Obfuscation Obfuscated IEX Invocation
author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the following code block — https://github.com/danielbohannon/Invoke-Obfuscation/blob/master/Out-ObfuscatedStringCommand.ps1#L873-L888
detection:
  SELECTION_1:
    EventID: 7045
  SELECTION_2:
    ImagePath|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  SELECTION_3:
    ImagePath|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  SELECTION_4:
    ImagePath|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  SELECTION_5:
    ImagePath|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  SELECTION_6:
    ImagePath|re: \\*mdr\*\W\s*\)\.Name
  SELECTION_7:
    ImagePath|re: \$VerbosePreference\.ToString\(
  SELECTION_8:
    ImagePath|re: \String\]\s*\$VerbosePreference
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
    or SELECTION_6 or SELECTION_7 or SELECTION_8))
falsepositives:
- Unknown
id: 51aa9387-1c53-4153-91cc-d73c59ae1ca9
level: high
logsource:
  product: windows
  service: system
modified: 2021/09/16
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
ruletype: SIGMA
