
title: Activity Related to NTDS.dit Domain Hash Retrieval
ruletype: Sigma
author: Florian Roth, Michael Haag
date: 2019/01/16
description: Detects suspicious commands that could be related to activity that uses
  volume shadow copy to steal and retrieve hashes from the NTDS.dit file remotely
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - vssadmin.exe Delete Shadows
    - 'vssadmin create shadow /for=C:'
    - copy \\?\GLOBALROOT\Device\\*\windows\ntds\ntds.dit
    - copy \\?\GLOBALROOT\Device\\*\config\SAM
    - 'vssadmin delete shadows /for=C:'
    - 'reg SAVE HKLM\SYSTEM '
    - esentutl.exe /y /vss *\ntds.dit*
    - esentutl.exe /y /vss *\SAM
    - esentutl.exe /y /vss *\SYSTEM
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: b932b60f-fdda-4d53-8eda-a170c1d97bbd
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.swordshield.com/2015/07/getting-hashes-from-ntds-dit-file/
- https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/
- https://www.trustwave.com/Resources/SpiderLabs-Blog/Tutorial-for-NTDS-goodness-(VSSADMIN,-WMIS,-NTDS-dit,-SYSTEM)/
- https://securingtomorrow.mcafee.com/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/
- https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/
status: deprecated
tags:
- attack.credential_access
- attack.t1003
