title: Renamed Powershell Under Powershell Channel
author: Harish Segar, frack113
date: 2020/06/29
description: Detects renamed powershell
detection:
    SELECTION_1:
        HostName: ConsoleHost
    SELECTION_2:
        HostApplication: powershell.exe*
    SELECTION_3:
        HostApplication: C:\WINDOWS\System32\WindowsPowerShell\v1.0\powershell.exe*
    condition: (SELECTION_1 and  not ((SELECTION_2 or SELECTION_3)))
falsepositives:
- unknown
id: 30a8cb77-8eb3-4cfb-8e79-ad457c5a4592
level: low
logsource:
    category: ps_classic_start
    definition: fields have to be extract from event
    product: windows
modified: 2021/10/16
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: test
tags:
- attack.execution
- attack.t1086
- attack.t1059.001
yml_filename: powershell_renamed_powershell.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/powershell/powershell_classic

