title: Suspicious PowerShell Invocations - Generic
author: Florian Roth (rule)
date: 2017/03/12
description: Detects suspicious PowerShell invocation command parameters
detection:
    SELECTION_1:
        ContextInfo: '* -enc *'
    SELECTION_2:
        ContextInfo: '* -EncodedCommand *'
    SELECTION_3:
        ContextInfo: '* -w hidden *'
    SELECTION_4:
        ContextInfo: '* -window hidden *'
    SELECTION_5:
        ContextInfo: '* -windowstyle hidden *'
    SELECTION_6:
        ContextInfo: '* -noni *'
    SELECTION_7:
        ContextInfo: '* -noninteractive *'
    condition: ((SELECTION_1 or SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
        and (SELECTION_6 or SELECTION_7))
falsepositives:
- Penetration tests
- Very special / sneaky PowerShell scripts
id: bbb80e91-5746-4fbe-8898-122e2cafdbf4
level: high
logsource:
    category: ps_module
    product: windows
modified: 2021/10/18
related:
-   id: 3d304fda-78aa-43ed-975c-d740798a49c1
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
yml_filename: powershell_suspicious_invocation_generic_in_contextinfo.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/powershell/powershell_module

