title: Abusable Invoke-ATHRemoteFXvGPUDisablementCommand
author: frack113
date: 2021/07/13
description: RemoteFXvGPUDisablement.exe is an abusable, signed PowerShell host executable
    that was introduced in Windows 10 and Server 2019 (OS Build 17763.1339).
detection:
    SELECTION_1:
        ContextInfo: '*Invoke-ATHRemoteFXvGPUDisablementCommand *'
    SELECTION_2:
        ContextInfo: '*-ModuleName *'
    SELECTION_3:
        ContextInfo: '*-ModulePath *'
    SELECTION_4:
        ContextInfo: '*-ScriptBlock *'
    SELECTION_5:
        ContextInfo: '*-RemoteFXvGPUDisablementFilePath*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 38a7625e-b2cb-485d-b83d-aff137d859f4
level: medium
logsource:
    category: ps_module
    definition: PowerShell Module Logging must be enabledd
    product: windows
modified: 2021/10/16
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
yml_filename: powershell_susp_athremotefxvgpudisablementcommand.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/powershell/powershell_module

