title: Excel Proxy Executing Regsvr32 With Payload
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: Excel called wmic to finally proxy execute regsvr32 with the payload.
    An attacker wanted to break suspicious parent-child chain (Office app spawns LOLBin).But
    we have command-line in the event which allow us to "restore" this suspicious
    parent-child chain and detect it. Monitor process creation with "wmic process
    call create" and LOLBins in command-line with parent Office application processes.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        ParentImage: '*excel.exe'
    SELECTION_11:
        ParentImage: '*powerpnt.exe'
    SELECTION_12:
        ParentCommandLine: '*process*'
    SELECTION_13:
        ParentCommandLine: '*create*'
    SELECTION_14:
        ParentCommandLine: '*call*'
    SELECTION_2:
        ParentCommandLine: '*regsvr32*'
    SELECTION_3:
        ParentCommandLine: '*rundll32*'
    SELECTION_4:
        ParentCommandLine: '*msiexec*'
    SELECTION_5:
        ParentCommandLine: '*mshta*'
    SELECTION_6:
        ParentCommandLine: '*verclsid*'
    SELECTION_7:
        Image: '*\wbem\WMIC.exe'
    SELECTION_8:
        ParentCommandLine: '*wmic *'
    SELECTION_9:
        ParentImage: '*winword.exe'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6) and (SELECTION_7 or SELECTION_8) and (SELECTION_9 or SELECTION_10
        or SELECTION_11) and SELECTION_12 and SELECTION_13 and SELECTION_14)
falsepositives:
- Unknown
id: c0e1c3d5-4381-4f18-8145-2583f06a1fe5
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/09
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
yml_filename: process_creation_office_from_proxy_executing_regsvr32_payload2.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

