title: Usage of Sysinternals Tools
author: Markus Neis
date: 2017/08/28
description: Detects the usage of Sysinternals Tools due to accepteula key being added
    to Registry
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '* -accepteula*'
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate use of SysInternals tools
- Programs that use the same Registry Key
id: 7cccd811-7ae9-4ebe-9afd-cb5c406b824b
level: low
logsource:
    category: process_creation
    product: windows
modified: 2021/09/12
references:
- https://twitter.com/Moti_B/status/1008587936735035392
related:
-   id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
    type: derived
status: experimental
tags:
- attack.resource_development
- attack.t1588.002
yml_filename: process_creation_sysinternals_eula_accepted.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

