title: Suspicious PowerShell Mailbox Export to Share
author: Florian Roth
date: 2021/08/07
description: Detects a PowerShell New-MailboxExportRequest that exports a mailbox
    to a local share, as used in ProxyShell exploitations
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*New-MailboxExport*'
    SELECTION_3:
        CommandLine: '* -Mailbox *'
    SELECTION_4:
        CommandLine: '* -FilePath \\127.0.0.1\C$*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- unknown
fields:
- CommandLine
- ParentCommandLine
id: 889719ef-dd62-43df-86c3-768fb08dc7c0
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://youtu.be/5mqid-7zp8k?t=2481
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
- https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1
status: experimental
tags:
- attack.persistence
- attack.t1505.003
- attack.resource_development
- attack.t1584.006
yml_filename: process_mailboxexport_share.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

