title: Ryuk Ransomware
author: Vasiliy Burov
date: 2019/08/06
description: Detects Ryuk Ransomware command lines
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\net.exe'
    SELECTION_3:
        Image: '*\net1.exe'
    SELECTION_4:
        CommandLine: '*stop*'
    SELECTION_5:
        CommandLine: '*samss*'
    SELECTION_6:
        CommandLine: '*audioendpointbuilder*'
    SELECTION_7:
        CommandLine: '*unistoresvc_?????*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and (SELECTION_5
        or SELECTION_6 or SELECTION_7))
falsepositives:
- Unlikely
id: 0acaad27-9f02-4136-a243-c357202edd74
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://research.checkpoint.com/ryuk-ransomware-targeted-campaign-break/
status: experimental
tags:
- attack.execution
- attack.t1204
yml_filename: process_creation_mal_ryuk.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/malware

