title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
author: frack113
date: 2021/07/27
description: An adversary may compress or encrypt data that is collected prior to
    exfiltration using 3rd party utilities
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*7z.exe*'
    SELECTION_3:
        CommandLine: '*7za.exe*'
    SELECTION_4:
        CommandLine: '* -p*'
    SELECTION_5:
        CommandLine: '* a *'
    SELECTION_6:
        CommandLine: '* u *'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and (SELECTION_5
        or SELECTION_6))
falsepositives:
- Command line parameter combinations that contain all included strings
fields:
- CommandLine
- ParentCommandLine
- CurrentDirectory
id: 9fbf5927-5261-4284-a71d-f681029ea574
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md
status: experimental
tags:
- attack.collection
- attack.t1560.001
yml_filename: process_creation_susp_7z.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

