title: Ursnif
author: megan201296
date: 2019/02/13
description: Detects new registry key created by Ursnif malware.
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*\Software\AppDataLow\Software\Microsoft\\*'
    SELECTION_5:
        TargetObject: '*\SOFTWARE\AppDataLow\Software\Microsoft\Internet Explorer\\*'
    SELECTION_6:
        TargetObject: '*\SOFTWARE\AppDataLow\Software\Microsoft\RepService\\*'
    SELECTION_7:
        TargetObject: '*\SOFTWARE\AppDataLow\Software\Microsoft\IME\\*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and  not
        ((SELECTION_5 or SELECTION_6 or SELECTION_7)))
falsepositives:
- Unknown
id: 21f17060-b282-4249-ade0-589ea3591558
level: critical
logsource:
    category: registry_event
    product: windows
modified: 2021/10/28
references:
- https://blog.yoroi.company/research/ursnif-long-live-the-steganography/
- https://blog.trendmicro.com/trendlabs-security-intelligence/phishing-campaign-uses-hijacked-emails-to-deliver-ursnif-by-replying-to-ongoing-threads/
status: experimental
tags:
- attack.execution
- attack.t1112
yml_filename: registry_event_mal_ursnif.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/malware

