title: Turla Group Named Pipes
author: Markus Neis
date: 2017/11/06
description: Detects a named pipe used by Turla group samples
detection:
    SELECTION_1:
        EventID: 17
    SELECTION_2:
        EventID: 18
    SELECTION_3:
        PipeName: \atctl
    SELECTION_4:
        PipeName: \userpipe
    SELECTION_5:
        PipeName: \iehelper
    SELECTION_6:
        PipeName: \sdlrpc
    SELECTION_7:
        PipeName: \comnap
    condition: ((SELECTION_1 or SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7))
falsepositives:
- Unknown
id: 739915e4-1e70-4778-8b8a-17db02f66db1
level: critical
logsource:
    category: pipe_created
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
    product: windows
references:
- Internal Research
status: experimental
tags:
- attack.g0010
yml_filename: sysmon_apt_turla_namedpipes.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/pipe_created

