title: Suspicious Camera and Microphone Access
author: Den Iuzvyk
date: 2020/06/07
description: Detects Processes accessing the camera and microphone from suspicious
    folder
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_10:
        TargetObject: '*:#Temp#*'
    SELECTION_11:
        TargetObject: '*:#Users#Public#*'
    SELECTION_12:
        TargetObject: '*:#Users#Default#*'
    SELECTION_13:
        TargetObject: '*:#Users#Desktop#*'
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*\Software\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\\*'
    SELECTION_5:
        TargetObject: '*\NonPackaged*'
    SELECTION_6:
        TargetObject: '*microphone*'
    SELECTION_7:
        TargetObject: '*webcam*'
    SELECTION_8:
        TargetObject: '*:#Windows#Temp#*'
    SELECTION_9:
        TargetObject: '*:#$Recycle.bin#*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
        and (SELECTION_6 or SELECTION_7) and (SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13))
falsepositives:
- Unlikely, there could be conferencing software running from a Temp folder accessing
    the devices
id: 62120148-6b7a-42be-8b91-271c04e281a3
level: high
logsource:
    category: registry_event
    product: windows
modified: 2021/09/17
references:
- https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
tags:
- attack.collection
- attack.t1125
- attack.t1123
yml_filename: sysmon_susp_mic_cam_access.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/registry_event

