title: Always Install Elevated MSI Spawned Cmd And Powershell
author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
date: 2020/10/13
description: This rule will looks for Windows Installer service (msiexec.exe) spawned
    command line and/or powershell
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\cmd.exe'
    SELECTION_3:
        Image: '*\powershell.exe'
    SELECTION_4:
        ParentImage: '*\Windows\Installer\\*'
    SELECTION_5:
        ParentImage: '*msi*'
    SELECTION_6:
        ParentImage: '*tmp'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
        and (SELECTION_6))
falsepositives:
- Penetration test
fields:
- Image
- ParentImage
id: 1e53dd56-8d83-4eb4-a43e-b790a05510aa
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-50-638.jpg
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548.002
yml_filename: sysmon_always_install_elevated_msi_spawned_cmd_and_powershell.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

