title: Powershell Profile.ps1 Modification
author: HieuTT35
date: 2019/10/24
description: Detects a change in profile.ps1 of the Powershell profile
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        TargetFilename: '*\profile.ps1*'
    SELECTION_3:
        TargetFilename: '*\My Documents\PowerShell\\*'
    SELECTION_4:
        TargetFilename: '*C:\Windows\System32\WindowsPowerShell\v1.0\\*'
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4))
falsepositives:
- System administrator create Powershell profile manually
id: b5b78988-486d-4a80-b991-930eff3ff8bf
level: high
logsource:
    category: file_event
    product: windows
modified: 2020/08/24
references:
- https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.013
yml_filename: sysmon_suspicious_powershell_profile_create.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/file_event

