title: DNS Tunnel Technique from MuddyWater
author: '@caliskanfurkan_'
date: 2020/06/04
description: Detecting DNS tunnel activity for Muddywater actor
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\powershell.exe'
    SELECTION_3:
        ParentImage: '*\excel.exe'
    SELECTION_4:
        CommandLine: '*DataExchange.dll*'
    condition: (SELECTION_1 and (SELECTION_2) and (SELECTION_3) and (SELECTION_4))
falsepositives:
- Unknown
id: 36222790-0d43-4fe8-86e4-674b27809543
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://www.virustotal.com/gui/file/5ad401c3a568bd87dd13f8a9ddc4e450ece61cd9ce4d1b23f68ce0b1f3c190b7/
- https://www.vmray.com/analyses/5ad401c3a568/report/overview.html
status: experimental
tags:
- attack.command_and_control
- attack.t1071
- attack.t1071.004
yml_filename: sysmon_apt_muddywater_dnstunnel.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

