title: Python Py2Exe Image Load
author: Patrick St. John, OTR (Open Threat Research)
date: 2020/05/03
description: Detects the image load of Python Core indicative of a Python script bundled
    with Py2Exe.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Description: Python Core
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legit Py2Exe Binaries
fields:
- Description
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
level: medium
logsource:
    category: image_load
    product: windows
modified: 2021/05/12
references:
- https://www.py2exe.org/
- https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.002
yml_filename: sysmon_susp_python_image_load.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/image_load

