title: Ncat Execution
author: frack113
date: 2021/07/21
description: Adversaries may use a non-application layer protocol for communication
    between host and C2 server or among infected hosts within a network
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\ncat.exe'
    SELECTION_3:
        CommandLine: '* -lvp *'
    SELECTION_4:
        CommandLine: '* -l --proxy-type http *'
    SELECTION_5:
        CommandLine: '* --exec cmd.exe *'
    SELECTION_6:
        CommandLine: '* -vnl --exec *'
    condition: (SELECTION_1 and ((SELECTION_2) or (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6)))
falsepositives:
- Legitimate ncat use
id: e31033fc-33f0-4020-9a16-faf9b31cbf08
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://nmap.org/ncat/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1095/T1095.md
status: experimental
tags:
- attack.command_and_control
- attack.t1095
yml_filename: sysmon_netcat_execution.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

