title: Cred Dump-Tools Named Pipes
author: Teymur Kheirkhabarov, oscd.community
date: 2019/11/01
description: Detects well-known credential dumping tools execution via specific named
    pipes
detection:
    SELECTION_1:
        EventID: 17
    SELECTION_2:
        EventID: 18
    SELECTION_3:
        PipeName: '*\lsadump*'
    SELECTION_4:
        PipeName: '*\cachedump*'
    SELECTION_5:
        PipeName: '*\wceservicepipe*'
    condition: ((SELECTION_1 or SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Legitimate Administrator using tool for password recovery
id: 961d0ba2-3eea-4303-a930-2cf78bbfcc5e
level: critical
logsource:
    category: pipe_created
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
    product: windows
modified: 2020/08/28
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
yml_filename: sysmon_cred_dump_tools_named_pipes.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/pipe_created

