title: Dllhost Internet Connection
author: bartblaze
date: 2020/07/13
description: Detects Dllhost that communicates with public IP addresses
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_10:
        DestinationIp: 172.20.*
    SELECTION_11:
        DestinationIp: 172.21.*
    SELECTION_12:
        DestinationIp: 172.22.*
    SELECTION_13:
        DestinationIp: 172.23.*
    SELECTION_14:
        DestinationIp: 172.24.*
    SELECTION_15:
        DestinationIp: 172.25.*
    SELECTION_16:
        DestinationIp: 172.26.*
    SELECTION_17:
        DestinationIp: 172.27.*
    SELECTION_18:
        DestinationIp: 172.28.*
    SELECTION_19:
        DestinationIp: 172.29.*
    SELECTION_2:
        Image: '*\dllhost.exe'
    SELECTION_20:
        DestinationIp: 172.30.*
    SELECTION_21:
        DestinationIp: 172.31.*
    SELECTION_22:
        DestinationIp: 127.*
    SELECTION_3:
        Initiated: 'true'
    SELECTION_4:
        DestinationIp: 10.*
    SELECTION_5:
        DestinationIp: 192.168.*
    SELECTION_6:
        DestinationIp: 172.16.*
    SELECTION_7:
        DestinationIp: 172.17.*
    SELECTION_8:
        DestinationIp: 172.18.*
    SELECTION_9:
        DestinationIp: 172.19.*
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
        or SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9
        or SELECTION_10 or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14
        or SELECTION_15 or SELECTION_16 or SELECTION_17 or SELECTION_18 or SELECTION_19
        or SELECTION_20 or SELECTION_21 or SELECTION_22)))
falsepositives:
- Communication to other corporate systems that use IP addresses from public address
    spaces
id: cfed2f44-16df-4bf3-833a-79405198b277
level: medium
logsource:
    category: network_connection
    product: windows
modified: 2020/08/24
references:
- https://github.com/Neo23x0/sigma/blob/master/rules/windows/network_connection/sysmon_rundll32_net_connections.yml
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.execution
- attack.t1559.001
- attack.t1175
yml_filename: sysmon_dllhost_net_connections.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/network_connection

