title: Suspicious System.Drawing Load
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection for processes loading System.Drawing.ni.dll. This
    could be an indicator of potential Screen Capture.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        ImageLoaded: '*\System.Drawing.ni.dll'
    SELECTION_3:
        Image: '*\WmiPrvSE.exe'
    condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
falsepositives:
- unknown
id: 666ecfc7-229d-42b8-821e-1a8f8cb7057c
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://threathunterplaybook.com/evals/apt29/detections/7.A.1_3B4E5808-3C71-406A-B181-17B0CE3178C9.html
status: experimental
tags:
- attack.collection
- attack.t1113
yml_filename: sysmon_susp_system_drawing_load.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/image_load

