title: Suspicious Outbound RDP Connections
author: Markus Neis - Swisscom
date: 2019/05/15
description: Detects Non-Standard Tools Connecting to TCP port 3389 indicating possible
    lateral movement
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_10:
        Image: '*\RemoteDesktopManagerFree.exe'
    SELECTION_11:
        Image: '*\RemoteDesktopManager.exe'
    SELECTION_12:
        Image: '*\RemoteDesktopManager64.exe'
    SELECTION_13:
        Image: '*\mRemoteNG.exe'
    SELECTION_14:
        Image: '*\mRemote.exe'
    SELECTION_15:
        Image: '*\Terminals.exe'
    SELECTION_16:
        Image: '*\spiceworks-finder.exe'
    SELECTION_17:
        Image: '*\FSDiscovery.exe'
    SELECTION_18:
        Image: '*\FSAssessment.exe'
    SELECTION_19:
        Image: '*\MobaRTE.exe'
    SELECTION_2:
        DestinationPort: 3389
    SELECTION_20:
        Image: '*\chrome.exe'
    SELECTION_21:
        Image: '*\System32\dns.exe'
    SELECTION_22:
        Image: '*\thor.exe'
    SELECTION_23:
        Image: '*\thor64.exe'
    SELECTION_3:
        Initiated: 'true'
    SELECTION_4:
        Image: '*\mstsc.exe'
    SELECTION_5:
        Image: '*\RTSApp.exe'
    SELECTION_6:
        Image: '*\RTS2App.exe'
    SELECTION_7:
        Image: '*\RDCMan.exe'
    SELECTION_8:
        Image: '*\ws_TunnelService.exe'
    SELECTION_9:
        Image: '*\RSSensor.exe'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
        or SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9
        or SELECTION_10 or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14
        or SELECTION_15 or SELECTION_16 or SELECTION_17 or SELECTION_18 or SELECTION_19
        or SELECTION_20 or SELECTION_21 or SELECTION_22 or SELECTION_23)))
falsepositives:
- Other Remote Desktop RDP tools
- domain controller using dns.exe
id: ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
level: high
logsource:
    category: network_connection
    product: windows
modified: 2020/08/24
references:
- https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.001
- attack.t1076
- car.2013-07-002
yml_filename: sysmon_susp_rdp.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/network_connection

