title: VBScript Payload Stored in Registry
author: Florian Roth
date: 2021/03/05
description: Detects VBScript content stored into registry keys as seen being used
    by UNC2452 group
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_10:
        Details: '*RunHTMLApplication*'
    SELECTION_11:
        Details: '*Execute(*'
    SELECTION_12:
        Details: '*CreateObject*'
    SELECTION_13:
        Details: '*RegRead*'
    SELECTION_14:
        Details: '*window.close*'
    SELECTION_15:
        TargetObject: '*Software\Microsoft\Windows\CurrentVersion\Run*'
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*Software\Microsoft\Windows\CurrentVersion*'
    SELECTION_5:
        Details: '*vbscript*'
    SELECTION_6:
        Details: '*jscript*'
    SELECTION_7:
        Details: '*mshtml*'
    SELECTION_8:
        Details: '*mshtml,*'
    SELECTION_9:
        Details: '*mshtml *'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 and (SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14)) and  not
        (SELECTION_15))
falsepositives:
- Unknown
id: 46490193-1b22-4c29-bdd6-5bf63907216f
level: high
logsource:
    category: registry_event
    product: windows
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
status: experimental
tags:
- attack.persistence
- attack.t1547.001
yml_filename: sysmon_reg_vbs_payload_stored.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/registry_event

