title: Tap Driver Installation
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunnelling techniques
detection:
    SELECTION_1:
        EventID: 4697
    SELECTION_2:
        ServiceFileName: '*tap0901*'
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 9c8afa4d-0022-48f0-9456-3712466f9701
level: medium
logsource:
    product: windows
    service: security
modified: 2021/09/21
related:
-   id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
    type: derived
status: experimental
tags:
- attack.exfiltration
- attack.t1048
yml_filename: win_security_tap_driver_installation.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

