title: Set OabVirtualDirectory ExternalUrl Property
author: Jose Rodriguez @Cyb3rPandaH
date: 2021/03/15
description: Rule to detect an adversary setting OabVirtualDirectory External URL
    property to a script
detection:
    condition: (Set-OabVirtualDirectory and ExternalUrl and Page_Load and script)
falsepositives:
- Unknown
id: 9db37458-4df2-46a5-95ab-307e7f29e675
level: high
logsource:
    product: windows
    service: msexchange-management
references:
- https://twitter.com/OTR_Community/status/1371053369071132675
status: experimental
tags:
- attack.persistence
- attack.t1505.003
yml_filename: win_set_oabvirtualdirectory_externalurl.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

