title: Bypass UAC via WSReset.exe
author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
date: 2019/10/24
description: Identifies use of WSReset.exe to bypass User Account Control. Adversaries
    use this technique to execute privileged processes.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        ParentImage: '*\wsreset.exe'
    SELECTION_3:
        Image: '*\conhost.exe'
    condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
falsepositives:
- Unknown
id: d797268e-28a9-49a7-b9a8-2f5039011c5c
level: high
logsource:
    category: process_creation
    product: windows
modified: 2019/11/11
references:
- https://eqllib.readthedocs.io/en/latest/analytics/532b5ed4-7930-11e9-8f5c-d46d6d62a49e.html
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548.002
- attack.t1088
yml_filename: win_uac_wsreset.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

