title: DCERPC SMB Spoolss Named Pipe
author: OTR (Open Threat Research)
date: 2018/11/28
description: Detects the use of the spoolss named pipe over SMB. This can be used
    to trigger the authentication via NTLM of any machine that has the spoolservice
    enabled.
detection:
    SELECTION_1:
        EventID: 5145
    SELECTION_2:
        ShareName: \\*\IPC$
    SELECTION_3:
        RelativeTargetName: spoolss
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Domain Controllers acting as printer servers too? :)
id: 214e8f95-100a-4e04-bb31-ef6cba8ce07e
level: medium
logsource:
    product: windows
    service: security
references:
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
- https://dirkjanm.io/a-different-way-of-abusing-zerologon/
- https://twitter.com/_dirkjan/status/1309214379003588608
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.002
yml_filename: win_dce_rpc_smb_spoolss_named_pipe.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

