title: Conti Volume Shadow Listing
author: Max Altgelt, Tobias Michalski
date: 2021/08/09
description: Detects a command used by conti to access volume shadow backups
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*copy \\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy*'
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Some rare backup scenarios
id: c73124a7-3e89-44a3-bdc1-25fe4df754b1
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/vxunderground/status/1423336151860002816?s=20
- https://www.virustotal.com/gui/file/03e9b8c2e86d6db450e5eceec057d7e369ee2389b9daecaf06331a95410aa5f8/detection
status: experimental
tags:
- attack.impact
- attack.t1490
yml_filename: win_susp_cmd_shadowcopy_access.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

