title: Possible Impacket SecretDump Remote Activity
author: Samir Bousseaden, wagga
date: 2019/04/03
description: Detect AD credential dumping using impacket secretdump HKTL
detection:
    SELECTION_1:
        EventID: 5145
    SELECTION_2:
        ShareName: \\*\ADMIN$
    SELECTION_3:
        RelativeTargetName: '*SYSTEM32\\*'
    SELECTION_4:
        RelativeTargetName: '*.tmp*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- pentesting
id: 252902e3-5830-4cf6-bf21-c22083dfd5cf
level: high
logsource:
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
    product: windows
    service: security
modified: 2021/06/27
references:
- https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.002
- attack.t1003.004
- attack.t1003.003
yml_filename: win_impacket_secretdump.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

