title: Execution via CL_Mutexverifiers.ps1
author: oscd.community, Natalia Shornikova
date: 2020/10/14
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1
    module
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*CL_Mutexverifiers.ps1*'
    SELECTION_3:
        CommandLine: '*runAfterCancelProcess*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 99465c8f-f102-4157-b11c-b0cddd53b79a
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/05/21
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/CL_mutexverifiers.yml
- https://twitter.com/pabraeken/status/995111125447577600
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
yml_filename: win_cl_mutexverifiers_lolscript.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

