title: Defrag Deactivation
author: Florian Roth, Bartlomiej Czyz (@bczyz1)
date: 2019/03/04
description: Detects the deactivation and disabling of the Scheduled defragmentation
    task as seen by Slingshot APT group
detection:
    SELECTION_1:
        EventID: 4701
    SELECTION_2:
        TaskName: \Microsoft\Windows\Defrag\ScheduledDefrag
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: c5a178bf-9cfb-4340-b584-e4df39b6a3e7
level: medium
logsource:
    definition: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'
    product: windows
    service: security
modified: 2021/09/19
references:
- https://securelist.com/apt-slingshot/84312/
related:
-   id: 958d81aa-8566-4cea-a565-59ccd4df27b0
    type: derived
tags:
- attack.persistence
- attack.s0111
yml_filename: win_apt_slingshot.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

