title: Exfiltration and Tunneling Tools Execution
author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
description: Execution of well known tools for data exfiltration and tunneling
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\plink.exe'
    SELECTION_3:
        Image: '*\socat.exe'
    SELECTION_4:
        Image: '*\stunnel.exe'
    SELECTION_5:
        Image: '*\httptunnel.exe'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Legitimate Administrator using tools
id: c75309a3-59f8-4a8d-9c2c-4c927ad50555
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2020/08/29
status: experimental
tags:
- attack.exfiltration
- attack.command_and_control
- attack.t1043
- attack.t1041
- attack.t1572
- attack.t1071.001
yml_filename: win_exfiltration_and_tunneling_tools_execution.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

