title: Suspicious Splwow64 Without Params
author: Florian Roth
date: 2021/08/23
description: Detects suspicious Splwow64.exe process without any command line parameters
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\splwow64.exe'
    SELECTION_3:
        CommandLine: '*splwow64.exe'
    condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
falsepositives:
- Unknown
id: 1f1a8509-2cbb-44f5-8751-8e1571518ce2
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/sbousseaden/status/1429401053229891590?s=12
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
yml_filename: win_susp_splwow64.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

