title: Regedit as Trusted Installer
author: Florian Roth
date: 2021/05/27
description: Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\regedit.exe'
    SELECTION_3:
        ParentImage: '*\TrustedInstaller.exe'
    SELECTION_4:
        ParentImage: '*\ProcessHacker.exe'
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unlikely
id: 883835a7-df45-43e4-bf1d-4268768afda4
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
tags:
- attack.privilege_escalation
- attack.t1548
yml_filename: win_susp_regedit_trustedinstaller.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

