title: Persistence and Execution at Scale via GPO Scheduled Task
author: Samir Bousseaden
date: 2019/04/03
description: Detect lateral movement using GPO scheduled task, usually used to deploy
    ransomware at scale
detection:
    SELECTION_1:
        EventID: 5145
    SELECTION_2:
        ShareName: \\*\SYSVOL
    SELECTION_3:
        RelativeTargetName: '*ScheduledTasks.xml'
    SELECTION_4:
        Accesses: '*WriteData*'
    SELECTION_5:
        Accesses: '*%%4417*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and (SELECTION_4 or SELECTION_5))
falsepositives:
- if the source IP is not localhost then it's super suspicious, better to monitor
    both local and remote changes to GPO scheduledtasks
id: a8f29a7b-b137-4446-80a0-b804272f3da2
level: high
logsource:
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
    product: windows
    service: security
references:
- https://twitter.com/menasec1/status/1106899890377052160
- https://www.secureworks.com/blog/ransomware-as-a-distraction
tags:
- attack.persistence
- attack.lateral_movement
- attack.t1053
- attack.t1053.005
yml_filename: win_gpo_scheduledtasks.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

