title: Using Sticky-keys To Obtain Unauthenticated, Privileged Console Access
author: Sreeman
date: 2020/02/18
description: By replacing the sticky keys executable with the local admins CMD executable,
    an attacker is able to access a privileged windows console session without authenticating
    to the system. When the sticky keys are "activated" the privilleged shell is launched.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: copy /y C:\windows\system32\cmd.exe C:\windows\system32\sethc.exe
    condition: (SELECTION_1 and (SELECTION_2))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentProcess
id: 1070db9a-3e5d-412e-8e7b-7183b616e1b3
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/06/11
references:
- https://www.fireeye.com/blog/threat-research/2017/03/apt29_domain_frontin.html
- https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
status: experimental
tags:
- attack.t1015
- attack.t1546.008
- attack.privilege_escalation
yml_filename: win_sticky_keys_unauthenticated_privileged_console_access.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

