title: Possible Shim Database Persistence via sdbinst.exe
author: Markus Neis
date: 2019/01/16
description: Detects installation of a new shim using sdbinst.exe. A shim can be used
    to load malicious DLLs into applications.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\sdbinst.exe'
    SELECTION_3:
        CommandLine: '*.sdb*'
    SELECTION_4:
        CommandLine: '*iisexpressshim.sdb*'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)))
falsepositives:
- Unknown
id: 517490a7-115a-48c6-8862-1a481504d5a8
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/08/14
references:
- https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.011
- attack.t1138
yml_filename: win_sdbinst_shim_persistence.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

