title: Windows 10 Scheduled Task SandboxEscaper 0-day
author: Olaf Hartong
date: 2019/05/22
description: Detects Task Scheduler .job import arbitrary DACL write\par
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\schtasks.exe'
    SELECTION_3:
        CommandLine: '*/change*'
    SELECTION_4:
        CommandLine: '*/TN*'
    SELECTION_5:
        CommandLine: '*/RU*'
    SELECTION_6:
        CommandLine: '*/RP*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 931b6802-d6a6-4267-9ffa-526f57f22aaf
level: high
logsource:
    category: process_creation
    product: windows
modified: 2020/08/29
references:
- https://github.com/SandboxEscaper/polarbearrepo/tree/master/bearlpe
status: experimental
tags:
- attack.privilege_escalation
- attack.t1053.005
- attack.t1053
- car.2013-08-001
yml_filename: win_win10_sched_task_0day.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

