title: Bypass UAC via CMSTP
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: 2019/10/24
description: Detect child processes of automatically elevated instances of Microsoft
    Connection Manager Profile Installer (cmstp.exe).
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\cmstp.exe'
    SELECTION_3:
        CommandLine: '*/s*'
    SELECTION_4:
        CommandLine: '*/au*'
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate use of cmstp.exe utility by legitimate user
fields:
- ComputerName
- User
- CommandLine
id: e66779cc-383e-4224-a3a4-267eeb585c40
level: high
logsource:
    category: process_creation
    product: windows
modified: 2020/08/29
references:
- https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1191/T1191.md
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
- attack.t1218.003
- attack.t1191
- attack.t1088
yml_filename: win_uac_cmstp.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

