title: Sysprep on AppData Folder
author: Florian Roth
date: 2018/06/22
description: Detects suspicious sysprep process start with AppData folder as target
    (as used by Trojan Syndicasec in Thrip report by Symantec)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\sysprep.exe'
    SELECTION_3:
        CommandLine: '*\AppData\\*'
    condition: (SELECTION_1 and (SELECTION_2) and (SELECTION_3))
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
    environment
id: d5b9ae7a-e6fc-405e-80ff-2ff9dcc64e7e
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2018/12/11
references:
- https://www.symantec.com/blogs/threat-intelligence/thrip-hits-satellite-telecoms-defense-targets
- https://app.any.run/tasks/61a296bb-81ad-4fee-955f-3b399f4aaf4b
status: experimental
tags:
- attack.execution
yml_filename: win_susp_sysprep_appdata.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

