title: Maze Ransomware
author: Florian Roth
date: 2020/05/08
description: Detects specific process characteristics of Maze ransomware word document
    droppers
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        ParentImage: '*\WINWORD.exe'
    SELECTION_3:
        Image: '*.tmp'
    SELECTION_4:
        Image: '*\wmic.exe'
    SELECTION_5:
        ParentImage: '*\Temp\\*'
    SELECTION_6:
        CommandLine: '*shadowcopy delete'
    SELECTION_7:
        CommandLine: '*shadowcopy delete'
    SELECTION_8:
        CommandLine: '*\..\..\system32*'
    condition: (SELECTION_1 and (((SELECTION_2) and (SELECTION_3)) or (SELECTION_4
        and SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unlikely
fields:
- ComputerName
- User
- Image
id: 29fd07fc-9cfd-4331-b7fd-cc18dfa21052
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2021/06/27
references:
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://app.any.run/tasks/51e7185c-52d7-4efb-ac0d-e86340053473/
- https://app.any.run/tasks/65a79440-373a-4725-8d74-77db9f2abda4/
status: experimental
tags:
- attack.execution
- attack.t1204.002
- attack.t1204
- attack.t1047
- attack.impact
- attack.t1490
yml_filename: win_crime_maze_ransomware.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

