title: Wmic Uninstall Security Product
author: Florian Roth
date: 2021/01/30
description: Detects deinstallation of security products using WMIC utility
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*Endpoint Detection*'
    SELECTION_11:
        CommandLine: '*Endpoint Protection*'
    SELECTION_12:
        CommandLine: '*Endpoint Security*'
    SELECTION_13:
        CommandLine: '*Endpoint Sensor*'
    SELECTION_14:
        CommandLine: '*ESET File Security*'
    SELECTION_15:
        CommandLine: '*Malwarebytes*'
    SELECTION_16:
        CommandLine: '*McAfee Agent*'
    SELECTION_17:
        CommandLine: '*Microsoft Security Client*'
    SELECTION_18:
        CommandLine: '*Threat Protection*'
    SELECTION_19:
        CommandLine: '*VirusScan*'
    SELECTION_2:
        CommandLine: '*wmic*'
    SELECTION_20:
        CommandLine: '*Webroot SecureAnywhere*'
    SELECTION_21:
        CommandLine: '*Windows Defender*'
    SELECTION_3:
        CommandLine: '*product where name=*'
    SELECTION_4:
        CommandLine: '*call uninstall*'
    SELECTION_5:
        CommandLine: '*/nointeractive*'
    SELECTION_6:
        CommandLine: '*Antivirus*'
    SELECTION_7:
        CommandLine: '*AVG *'
    SELECTION_8:
        CommandLine: '*Crowdstrike Sensor*'
    SELECTION_9:
        CommandLine: '*DLP Endpoint*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and (SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14 or SELECTION_15
        or SELECTION_16 or SELECTION_17 or SELECTION_18 or SELECTION_19 or SELECTION_20
        or SELECTION_21))
falsepositives:
- Legitimate administration
id: 847d5ff3-8a31-4737-a970-aeae8fe21765
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/10/18
references:
- https://twitter.com/cglyer/status/1355171195654709249
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: win_susp_wmic_security_product_uninstall.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

