title: Netsh Program Allowed with Suspcious Location
author: Sander Wiebing, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2020/05/25
description: Detects Netsh commands that allows a suspcious application location on
    Windows Firewall
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*program=*'
    SELECTION_11:
        CommandLine: '*%TEMP%*'
    SELECTION_12:
        CommandLine: '*:\RECYCLER\\*'
    SELECTION_13:
        CommandLine: '*C:\$Recycle.bin\\*'
    SELECTION_14:
        CommandLine: '*:\SystemVolumeInformation\\*'
    SELECTION_15:
        CommandLine: '*C:\Windows\Temp\\*'
    SELECTION_16:
        CommandLine: '*C:\Temp\\*'
    SELECTION_17:
        CommandLine: '*C:\Users\Public\\*'
    SELECTION_18:
        CommandLine: '*C:\Users\Default\\*'
    SELECTION_19:
        CommandLine: '*C:\Users\Desktop\\*'
    SELECTION_2:
        EventID: 1
    SELECTION_20:
        CommandLine: '*\Downloads\\*'
    SELECTION_21:
        CommandLine: '*\Temporary Internet Files\Content.Outlook\\*'
    SELECTION_22:
        CommandLine: '*\Local Settings\Temporary Internet Files\\*'
    SELECTION_23:
        CommandLine: C:\Windows\Tasks\\*
    SELECTION_24:
        CommandLine: C:\Windows\debug\\*
    SELECTION_25:
        CommandLine: C:\Windows\fonts\\*
    SELECTION_26:
        CommandLine: C:\Windows\help\\*
    SELECTION_27:
        CommandLine: C:\Windows\drivers\\*
    SELECTION_28:
        CommandLine: C:\Windows\addins\\*
    SELECTION_29:
        CommandLine: C:\Windows\cursors\\*
    SELECTION_3:
        Image: '*\netsh.exe'
    SELECTION_30:
        CommandLine: C:\Windows\system32\tasks\\*
    SELECTION_31:
        CommandLine: '%Public%\\*'
    SELECTION_4:
        CommandLine: '*firewall*'
    SELECTION_5:
        CommandLine: '*add*'
    SELECTION_6:
        CommandLine: '*allowedprogram*'
    SELECTION_7:
        CommandLine: '*advfirewall*'
    SELECTION_8:
        CommandLine: '*rule*'
    SELECTION_9:
        CommandLine: '*action=allow*'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and (SELECTION_6 or (SELECTION_7 and SELECTION_8 and SELECTION_9 and SELECTION_10)))
        and ((SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14 or SELECTION_15
        or SELECTION_16 or SELECTION_17 or SELECTION_18 or SELECTION_19 or SELECTION_20
        or SELECTION_21 or SELECTION_22) or (SELECTION_23 or SELECTION_24 or SELECTION_25
        or SELECTION_26 or SELECTION_27 or SELECTION_28 or SELECTION_29 or SELECTION_30
        or SELECTION_31)))
falsepositives:
- Legitimate administration
id: a35f5a72-f347-4e36-8895-9869b0d5fc6d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2020/11/28
references:
- https://www.virusradar.com/en/Win32_Kasidet.AD/description
- https://www.hybrid-analysis.com/sample/07e789f4f2f3259e7559fdccb36e96814c2dbff872a21e1fa03de9ee377d581f?environmentId=100
status: experimental
tags:
- attack.defense_evasion
- attack.t1089
- attack.t1562.004
yml_filename: win_netsh_fw_add_susp_image.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

