title: Password Change on Directory Service Restore Mode (DSRM) Account
author: Thomas Patzke
date: 2017/02/19
description: The Directory Service Restore Mode (DSRM) account is a local administrator
    account on Domain Controllers. Attackers may change the password to gain persistence.
detection:
    SELECTION_1:
        EventID: 4794
    condition: SELECTION_1
falsepositives:
- Initial installation of a domain controller
id: 53ad8e36-f573-46bf-97e4-15ba5bf4bb51
level: high
logsource:
    product: windows
    service: security
modified: 2020/08/23
references:
- https://adsecurity.org/?p=1714
status: stable
tags:
- attack.persistence
- attack.t1098
yml_filename: win_susp_dsrm_password_change.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

