title: Mouse Lock Credential Gathering
author: Cian Heasley
date: 2020/08/13
description: In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate
    tool "Mouse Lock" as being used for both credential access and collection in security
    incidents.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Product: '*Mouse Lock*'
    SELECTION_3:
        Company: '*Misc314*'
    SELECTION_4:
        CommandLine: '*Mouse Lock_*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate uses of Mouse Lock software
fields:
- Product
- Company
- CommandLine
id: c9192ad9-75e5-43eb-8647-82a0a5b493e3
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/klsecservices/Publications/blob/master/Incident-Response-Analyst-Report-2020.pdf
- https://sourceforge.net/projects/mouselock/
status: experimental
tags:
- attack.credential_access
- attack.collection
- attack.t1056.002
yml_filename: win_mouse_lock.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

