title: UAC Bypass Using IEInstal - Process
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        IntegrityLevel: High
    SELECTION_3:
        IntegrityLevel: System
    SELECTION_4:
        ParentImage: '*\ieinstal.exe'
    SELECTION_5:
        Image: '*\AppData\Local\Temp\\*'
    SELECTION_6:
        Image: '*consent.exe'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 80fc36aa-945e-4181-89f2-2f907ab6775d
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
yml_filename: win_uac_bypass_ieinstal.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

