title: Application Whitelisting Bypass via Bginfo
author: Beyu Denis, oscd.community
date: 2019/10/26
description: Execute VBscript code that is referenced within the *.bgi file.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\bginfo.exe'
    SELECTION_3:
        CommandLine: '*/popup*'
    SELECTION_4:
        CommandLine: '*/nolicprompt*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: aaf46cdc-934e-4284-b329-34aa701e3771
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2020/09/05
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Bginfo.yml
- https://oddvar.moe/2017/05/18/bypassing-application-whitelisting-with-bginfo/
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.defense_evasion
- attack.t1218
- attack.t1202
yml_filename: win_susp_bginfo.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

