author: Zach Mathis
date: 2021/12/11
modified: 2021/12/11

title: Process Creation
title_jp: プロセス起動
details: 'Command: %CommandLine%  :  Path: %Image%  :  User: %User%  :  Parent Command: %ParentCommandLine%'
details_jp: 'コマンド: %CommandLine%  :  パス: %Image%  :  ユーザ: %User%  :  親コマンド: %ParentCommandLine%'
description: Sysmon process creation. Displays only commands that have not been flagged with a sysmon detection rule.
description_jp: Sysmonログによるプロセス起動のログ

id: 85790e3e-e270-499f-a6ad-f8afe85c35f1
level: informational
status: stable
detection:
    selection_1:
        Channel: Microsoft-Windows-Sysmon/Operational
        EventID: 1
    selection_2:
        - RuleName: ""
        - RuleName: "-"
    condition: selection_1 and selection_2
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: sysmon
ruletype: Hayabusa