
title: Wmiprvse Wbemcomn DLL Hijack
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/12
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
  directory over the network and loading it for a WMI DLL Hijack scenario.
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Image: System
  SELECTION_3:
    TargetFilename: '*\wbem\wbemcomn.dll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 614a7e17-5643-4d89-b6fe-f9df1a79641c
level: critical
logsource:
  category: file_event
  product: windows
modified: 2021/09/09
references:
- https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.lateral_movement
- attack.t1021.002
