
title: UAC Bypass Using IEInstal - File
ruletype: Sigma
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Image: C:\Program Files\Internet Explorer\IEInstal.exe
  SELECTION_3:
    TargetFilename: C:\Users\\*
  SELECTION_4:
    TargetFilename: '*\AppData\Local\Temp\\*'
  SELECTION_5:
    TargetFilename: '*consent.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: bdd8157d-8e85-4397-bb82-f06cc9c71dbb
level: high
logsource:
  category: file_event
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
