
title: Suspicious ADSI-Cache Usage By Unknown Tool
ruletype: Sigma
author: xknow @xknow_infosec
date: 2019/03/24
description: Detects the usage of ADSI (LDAP) operations by tools. This may also detect
  tools like LDAPFragger.
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename: '*\Local\Microsoft\Windows\SchCache\\*'
  SELECTION_3:
    TargetFilename: '*.sch'
  SELECTION_4:
    Image:
    - C:\windows\system32\svchost.exe
    - C:\windows\system32\dllhost.exe
    - C:\windows\system32\mmc.exe
    - C:\windows\system32\WindowsPowerShell\v1.0\powershell.exe
    - C:\Windows\CCM\CcmExec.exe
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Other legimate tools, which do ADSI (LDAP) operations, e.g. any remoting activity
  by MMC, Powershell, Windows etc.
id: 75bf09fa-1dd7-4d18-9af9-dd9e492562eb
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/11/27
references:
- https://medium.com/@ivecodoe/detecting-ldapfragger-a-newly-released-cobalt-strike-beacon-using-ldap-for-c2-communication-c274a7f00961
- https://blog.fox-it.com/2020/03/19/ldapfragger-command-and-control-over-ldap-attributes/
- https://github.com/fox-it/LDAPFragger
status: test
tags:
- attack.t1071
- attack.t1001.003
- attack.command_and_control
