
title: RedMimicry Winnti Playbook Dropped File
ruletype: Sigma
author: Alexander Rausch
date: 2020/06/24
description: Detects actions caused by the RedMimicry Winnti playbook
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename:
    - '*gthread-3.6.dll*'
    - '*sigcmm-2.4.dll*'
    - '*\Windows\Temp\tmp.bat*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 130c9e58-28ac-4f83-8574-0a4cc913b97e
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/11/27
references:
- https://redmimicry.com
status: test
tags:
- attack.defense_evasion
- attack.t1027
