
title: UAC Bypass Using .NET Code Profiler on MMC
ruletype: Sigma
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using .NET Code Profiler and mmc.exe
  DLL hijacking (UACMe 39)
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename: C:\Users\\*
  SELECTION_3:
    TargetFilename: '*\AppData\Local\Temp\pe386.dll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 93a19907-d4f9-4deb-9f91-aac4692776a6
level: high
logsource:
  category: file_event
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
