
title: Windows Network Access Suspicious desktop.ini Action
ruletype: Sigma
author: Tim Shelton (HAWK.IO)
date: 2021/12/06
description: Detects unusual processes accessing desktop.ini remotely over network
  share, which can be leveraged to alter how Explorer displays a folder's content
  (i.e. renaming files) without changing them on disk.
detection:
  SELECTION_1:
    EventID: 5145
  SELECTION_2:
    ObjectType: File
  SELECTION_3:
    RelativeTargetName: '*\desktop.ini'
  SELECTION_4:
    AccessList:
    - '*WriteData*'
    - '*DELETE*'
    - '*WriteDAC*'
    - '*AppendData*'
    - '*AddSubdirectory*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Read only access list authority
id: 35bc7e28-ee6b-492f-ab04-da58fcf6402e
level: medium
logsource:
  category: security
  product: windows
modified: 2021/12/06
references:
- https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/
status: test
tags:
- attack.persistence
- attack.t1023
- attack.t1547.009
