
title: Suspicious Word Cab File Write CVE-2021-40444
ruletype: Sigma
author: Florian Roth, Sittikorn S
date: 2021/09/10
description: Detects file creation patterns noticeable during the exploitation of
  CVE-2021-40444
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Image: \winword.exe
  SELECTION_3:
    TargetFilename: '*.cab'
  SELECTION_4:
    TargetFilename: '*\Windows\INetCache*'
  SELECTION_5:
    TargetFilename: '*\AppData\Local\Temp\\*'
  SELECTION_6:
    TargetFilename: '*.inf*'
  condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6)))
falsepositives:
- unknown
fields:
- TargetFilename
id: 60c0a111-787a-4e8a-9262-ee485f3ef9d5
level: critical
logsource:
  category: file_event
  product: windows
modified: 2021/09/13
references:
- https://twitter.com/RonnyTNL/status/1436334640617373699?s=20
- https://twitter.com/vanitasnk/status/1437329511142420483?s=21
status: experimental
tags:
- attack.resource_development
- attack.t1587
