title: Windows Pcap Drivers
author: Cian Heasley
date: 2020/06/10
description: Detects Windows Pcap driver installation based on a list of associated
    .sys files.
detection:
    SELECTION_1:
        EventID: 4697
    SELECTION_10:
        ServiceFileName: '*pktmon*'
    SELECTION_2:
        ServiceFileName: '*pcap*'
    SELECTION_3:
        ServiceFileName: '*npcap*'
    SELECTION_4:
        ServiceFileName: '*npf*'
    SELECTION_5:
        ServiceFileName: '*nm3*'
    SELECTION_6:
        ServiceFileName: '*ndiscap*'
    SELECTION_7:
        ServiceFileName: '*nmnt*'
    SELECTION_8:
        ServiceFileName: '*windivert*'
    SELECTION_9:
        ServiceFileName: '*USBPcap*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10))
falsepositives:
- unknown
fields:
- EventID
- ServiceFileName
- Account_Name
- Computer_Name
- Originating_Computer
- ServiceName
id: 7b687634-ab20-11ea-bb37-0242ac130002
level: medium
logsource:
    product: windows
    service: security
references:
- https://ragged-lab.blogspot.com/2020/06/capturing-pcap-driver-installations.html#more
status: experimental
tags:
- attack.discovery
- attack.credential_access
- attack.t1040
yml_filename: win_pcap_drivers.yml
yml_path: /home/itib/git/sigma/rules/windows/other

