title: PsExec Tool Execution
author: Thomas Patzke
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
    Sysmon)
detection:
    SELECTION_1:
        ServiceName: PSEXESVC
    SELECTION_2:
        EventID: 7045
    SELECTION_3:
        ServiceFileName: '*\PSEXESVC.exe'
    SELECTION_4:
        EventID: 7036
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or SELECTION_4))
falsepositives:
- unknown
fields:
- EventID
- CommandLine
- ParentCommandLine
- ServiceName
- ServiceFileName
- TargetFilename
- PipeName
id: 42c575ea-e41e-41f1-b248-8093c3e82a28
level: low
logsource:
    product: windows
    service: system
modified: 2021/09/21
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
status: experimental
tags:
- attack.execution
- attack.t1035
- attack.t1569.002
- attack.s0029
yml_filename: win_tool_psexec.yml
yml_path: /home/itib/git/sigma/rules/windows/other

