
title: Clear PowerShell History
author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2019/10/25
description: Detects keywords that could indicate clearing PowerShell history
detection:
  SELECTION_1:
    EventID: 4103
  SELECTION_2:
    Payload:
    - '*del*'
    - '*Remove-Item*'
    - '*rm*'
  SELECTION_3:
    Payload: '*(Get-PSReadlineOption).HistorySavePath*'
  SELECTION_4:
    Payload: '*Set-PSReadlineOption*'
  SELECTION_5:
    Payload: '*–HistorySaveStyle*'
  SELECTION_6:
    Payload: '*SaveNothing*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5
    and SELECTION_6)))
falsepositives:
- Legitimate PowerShell scripts
id: f99276ad-d122-4989-a09a-d00904a5f9d2
level: medium
logsource:
  definition: PowerShell Module Logging must be enabled
  product: windows
  service: powershell
modified: 2020/11/28
references:
- https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
related:
- id: dfba4ce1-e0ea-495f-986e-97140f31af2d
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.003
- attack.t1146
