
title: File Creation by Office Applications
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: This rule will monitor executable and script file creation by office
  applications. Please add more file extensions or magic bytes to the logic of your
  choice.
detection:
  SELECTION_1:
    Image:
    - '*winword.exe'
    - '*excel.exe'
    - '*powerpnt.exe'
  SELECTION_2:
    FileName:
    - '*.exe'
    - '*.dll'
    - '*.ocx'
    - '*.com'
    - '*.ps1'
    - '*.vbs'
    - '*.sys'
    - '*.bat'
    - '*.scr'
    - '*.proj'
  SELECTION_3:
    FileMagicBytes:
    - 4D5A*
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: 8c6fd6fc-28fc-4597-a86a-fc1de20b039d
level: high
logsource:
  category: file_event
  product: Windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
