title: Startup Folder File Write
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection for files being created in the Windows startup directory.
    This could be an indicator of persistence.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        TargetFilename: '*ProgramData\Microsoft\Windows\Start Menu\Programs\StartUp*'
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- unknown
id: 2aa0a6b4-a865-495b-ab51-c28249537b75
level: low
logsource:
    category: file_event
    product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/12
- https://threathunterplaybook.com/evals/apt29/detections/5.B.1_611FCA99-97D0-4873-9E51-1C1BA2DBB40D.html
status: experimental
tags:
- attack.persistence
- attack.t1547.001
yml_filename: sysmon_startup_folder_file_write.yml
yml_path: /home/itib/git/sigma/rules/windows/file_event

