title: Files Dropped to Program Files by Non-Priviledged Process
author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
date: 2020/10/17
description: Search for dropping of files to Windows/Program Files fodlers by non-priviledged
    processes
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        IntegrityLevel: Medium
    SELECTION_3:
        TargetFilename: '*\Program Files\\*'
    SELECTION_4:
        TargetFilename: '*\Program Files (x86)\\*'
    SELECTION_5:
        TargetFilename: \Windows\\*
    SELECTION_6:
        TargetFilename: '*temp*'
    condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 or SELECTION_4) or (SELECTION_5
        and  not (SELECTION_6))))
falsepositives:
- Unknown
id: d6d9f4fb-4c1c-4f53-b306-62a22c7c61e1
level: medium
logsource:
    category: file_event
    product: windows
modified: 2021/08/14
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-37-638.jpg
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1574
- attack.t1574.010
yml_filename: sysmon_non_priv_program_files_move.yml
yml_path: /home/itib/git/sigma/rules/windows/file_event

