title: Powerup Write Hijack DLL
author: Subhash Popuri (@pbssubhash)
date: 2021/08/21
description: Powerup tool's Write Hijack DLL exploits DLL hijacking for privilege
    escalation. In it's default mode, it builds a self deleting .bat file which executes
    malicious command. The detection rule relies on creation of the malicious bat
    file (debug.bat by default).
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Image: '*\powershell.exe'
    SELECTION_3:
        TargetFilename: '*.bat'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Pentest
- Any powershell script that creates bat files
id: 602a1f13-c640-4d73-b053-be9a2fa58b96
level: high
logsource:
    category: file_event
    product: windows
references:
- https://powersploit.readthedocs.io/en/latest/Privesc/Write-HijackDll/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1574.001
yml_filename: sysmon_detect_powerup_dllhijacking.yml
yml_path: /home/itib/git/sigma/rules/windows/file_event

