title: Suspicious PROCEXP152.sys File Created In TMP
author: xknow (@xknow_infosec), xorxes (@xor_xes)
date: 2019/04/08
description: Detects the creation of the PROCEXP152.sys file in the application-data
    local temporary folder. This driver is used by Sysinternals Process Explorer but
    also by KDU (https://github.com/hfiref0x/KDU) or Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs),
    which uses KDU.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        TargetFilename: '*\AppData\Local\Temp\\*'
    SELECTION_3:
        TargetFilename: '*PROCEXP152.sys'
    SELECTION_4:
        Image: '*\procexp64.exe*'
    SELECTION_5:
        Image: '*\procexp.exe*'
    SELECTION_6:
        Image: '*\procmon64.exe*'
    SELECTION_7:
        Image: '*\procmon.exe*'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
        or SELECTION_5 or SELECTION_6 or SELECTION_7)))
falsepositives:
- Other legimate tools using this driver and filename (like Sysinternals). Note -
    Clever attackers may easily bypass this detection by just renaming the driver
    filename. Therefore just Medium-level and don't rely on it.
id: 3da70954-0f2c-4103-adff-b7440368f50e
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
status: experimental
tags:
- attack.t1089
- attack.t1562.001
- attack.defense_evasion
yml_filename: sysmon_susp_procexplorer_driver_created_in_tmp_folder.yml
yml_path: /home/itib/git/sigma/rules/windows/file_event

