
title: Credentials Dumping Tools Accessing LSASS Memory
author: Florian Roth, Roberto Rodriguez, Dimitrios Slamaris, Mark Russinovich, Thomas
  Patzke, Teymur Kheirkhabarov, Sherif Eldeeb, James Dickenson, Aleksey Potapov, oscd.community
  (update)
date: 2017/02/16
description: Detects process access LSASS memory which is typical for credentials
  dumping tools
detection:
  SELECTION_1:
    EventID: 10
  SELECTION_2:
    TargetImage: '*\lsass.exe'
  SELECTION_3:
    GrantedAccess:
    - 0x40*
    - 0x1000*
    - 0x1400*
    - 0x100000*
    - 0x1410*
    - 0x1010*
    - 0x1438*
    - 0x143a*
    - 0x1418*
    - 0x1f0fff*
    - 0x1f1fff*
    - 0x1f2fff*
    - 0x1f3fff*
  SELECTION_4:
    SourceImage:
    - '*\wmiprvse.exe'
    - '*\taskmgr.exe'
    - '*\procexp64.exe'
    - '*\procexp.exe'
    - '*\lsm.exe'
    - '*\MsMpEng.exe'
    - '*\csrss.exe'
    - '*\wininit.exe'
    - '*\vmtoolsd.exe'
  SELECTION_5:
    GrantedAccess:
    - '0x1000'
    - '0x1410'
  SELECTION_6:
    SourceImage:
    - '*\MicrosoftEdgeUpdate.exe'
    - '*\GamingServices.exe'
    - '*C:\Windows\System32\svchost.exe'
    - '*\aurora-agent.exe'
    - '*\aurora-agent-64.exe'
    - '*C:\WINDOWS\system32\taskhostw.exe'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
    and  not (SELECTION_5 and SELECTION_6))
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason; update the whitelist
  with it
fields:
- ComputerName
- User
- SourceImage
id: 32d0d3e2-e58d-4d41-926b-18b520b2b32d
level: high
logsource:
  category: process_access
  product: windows
modified: 2021/11/20
references:
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
- attack.s0002
- car.2019-04-004
