
title: Credentials Dumping Tools Accessing LSASS Memory
ruletype: Sigma
author: Florian Roth, Roberto Rodriguez, Dimitrios Slamaris, Mark Russinovich, Thomas
  Patzke, Teymur Kheirkhabarov, Sherif Eldeeb, James Dickenson, Aleksey Potapov, oscd.community
  (update)
date: 2017/02/16
description: Detects process access LSASS memory which is typical for credentials
  dumping tools
detection:
  SELECTION_1:
    EventID: 10
  SELECTION_10:
    SourceImage:
    - '*\PROCEXP64.EXE'
    - '*\PROCEXP.EXE'
    - '*C:\WINDOWS\system32\taskhostw.exe'
  SELECTION_11:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  SELECTION_12:
    SourceImage: C:\ProgramData\VMware\VMware Tools\\*
  SELECTION_13:
    SourceImage: '*\vmtoolsd.exe'
  SELECTION_14:
    SourceImage: C:\WINDOWS\system32\svchost.exe
  SELECTION_15:
    GrantedAccess: '0x100000'
  SELECTION_16:
    SourceImage:
    - C:\WINDOWS\system32\wbem\wmiprvse.exe
    - C:\Windows\syswow64\MsiExec.exe
    - C:\Windows\System32\msiexec.exe
  SELECTION_17:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  SELECTION_18:
    SourceImage:
    - '*\thor.exe'
    - '*\thor64.exe'
  SELECTION_19:
    GrantedAccess:
    - '0x40'
    - '0x1010'
  SELECTION_2:
    TargetImage: '*\lsass.exe'
  SELECTION_20:
    SourceImage: '*\explorer.exe'
  SELECTION_21:
    GrantedAccess: '0x401'
  SELECTION_22:
    SourceImage:
    - C:\Program Files\\*
    - C:\Program Files (x86)\\*
  SELECTION_23:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  SELECTION_24:
    SourceImage: C:\Program Files (x86)\Microsoft\Edge\Application\\*
  SELECTION_25:
    SourceImage: '*\Installer\setup.exe'
  SELECTION_3:
    GrantedAccess:
    - 0x40*
    - 0x100000*
    - 0x1410*
    - 0x1438*
    - 0x143a*
    - 0x1418*
    - 0x1f0fff*
    - 0x1f1fff*
    - 0x1f2fff*
    - 0x1f3fff*
  SELECTION_4:
    SourceImage:
    - C:\WINDOWS\system32\taskmgr.exe
  SELECTION_5:
    SourceImage: C:\ProgramData\Microsoft\Windows Defender\\*
  SELECTION_6:
    SourceImage: '*\MsMpEng.exe'
  SELECTION_7:
    SourceImage: C:\Program Files\WindowsApps\\*
  SELECTION_8:
    SourceImage: '*\GamingServices.exe'
  SELECTION_9:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)
    or (SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)
    or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13) or (SELECTION_14
    and SELECTION_15) or (SELECTION_16 and SELECTION_17) or (SELECTION_18 and SELECTION_19)
    or (SELECTION_20 and SELECTION_21) or (SELECTION_22 and SELECTION_23) or (SELECTION_24
    and SELECTION_25)))
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason; please add more
  filters
fields:
- ComputerName
- User
- SourceImage
id: 32d0d3e2-e58d-4d41-926b-18b520b2b32d
level: high
logsource:
  category: process_access
  product: windows
modified: 2021/12/04
references:
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
- attack.s0002
- car.2019-04-004
