
title: Suspicious GrantedAccess Flags on LSASS Access
ruletype: Sigma
author: Florian Roth
date: 2021/11/22
description: Detects process access to LSASS memory with suspicious access flags
detection:
  SELECTION_1:
    EventID: 10
  SELECTION_10:
    SourceImage:
    - '*\PROCEXP64.EXE'
    - '*\PROCEXP.EXE'
  SELECTION_11:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  SELECTION_12:
    SourceImage: C:\ProgramData\VMware\VMware Tools\\*
  SELECTION_13:
    SourceImage: '*\vmtoolsd.exe'
  SELECTION_14:
    SourceImage:
    - C:\Progra Files\\*
    - C:\Progra Files (x86)\\*
  SELECTION_15:
    SourceImage:
    - '*Antivirus*'
  SELECTION_16:
    SourceImage: C:\WINDOWS\system32\wbem\wmiprvse.exe
  SELECTION_17:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  SELECTION_18:
    SourceImage:
    - C:\Program Files\\*
    - C:\Program Files (x86)\\*
    - C:\WINDOWS\system32\\*
  SELECTION_19:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  SELECTION_2:
    TargetImage: '*\lsass.exe'
  SELECTION_3:
    GrantedAccess:
    - '*10'
    - '*30'
    - '*50'
    - '*70'
    - '*90'
    - '*B0'
    - '*D0'
    - '*F0'
    - '*18'
    - '*38'
    - '*58'
    - '*78'
    - '*98'
    - '*B8'
    - '*D8'
    - '*F8'
    - '*1A'
    - '*3A'
    - '*5A'
    - '*7A'
    - '*9A'
    - '*BA'
    - '*DA'
    - '*FA'
    - '*0x14C2'
  SELECTION_4:
    SourceImage:
    - C:\WINDOWS\system32\taskmgr.exe
    - C:\Program Files\Malwarebytes\Anti-Malware\MBAMService.exe
    - C:\PROGRAMDATA\MALWAREBYTES\MBAMSERVICE\ctlrupdate\mbupdatr.exe
    - C:\WINDOWS\system32\taskhostw.exe
    - C:\Users\\*\AppData\Local\Programs\Microsoft VS Code\Code.exe
    - C:\Program Files\Windows Defender\MsMpEng.exe
  SELECTION_5:
    SourceImage: C:\ProgramData\Microsoft\Windows Defender\\*
  SELECTION_6:
    SourceImage: '*\MsMpEng.exe'
  SELECTION_7:
    SourceImage: C:\Program Files\WindowsApps\\*
  SELECTION_8:
    SourceImage: '*\GamingServices.exe'
  SELECTION_9:
    GrantedAccess:
    - '0x1410'
    - '0x410'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)
    or (SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)
    or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13) or (SELECTION_14
    and SELECTION_15) or (SELECTION_16 and SELECTION_17) or (SELECTION_18 and SELECTION_19)))
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason
fields:
- User
- SourceImage
- GrantedAccess
id: a18dd26b-6450-46de-8c91-9659150cf088
level: high
logsource:
  category: process_access
  product: windows
modified: 2021/12/03
references:
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
related:
- id: 32d0d3e2-e58d-4d41-926b-18b520b2b32d
  type: obsoletes
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
- attack.s0002
