title: Abusing Windows Telemetry For Persistence
author: Sreeman
date: 2020/09/29
description: Windows telemetry makes use of the binary CompatTelRunner.exe to run
    a variety of commands and perform the actual telemetry collections. This binary
    was created to be easily extensible, and to that end, it relies on the registry
    to instruct on which commands to run. The problem is, it will run any arbitrary
    command without restriction of location or type.
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_10:
        Details: '*.cmd'
    SELECTION_11:
        Details: '*.js'
    SELECTION_12:
        Details: '*.ps'
    SELECTION_13:
        Details: '*.vb'
    SELECTION_14:
        Details: '*.jar'
    SELECTION_15:
        Details: '*.hta'
    SELECTION_16:
        Details: '*.msi'
    SELECTION_17:
        Details: '*.vbs'
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\TelemetryController\\*'
    SELECTION_5:
        Details: '*.sh'
    SELECTION_6:
        Details: '*.exe'
    SELECTION_7:
        Details: '*.dll'
    SELECTION_8:
        Details: '*.bin'
    SELECTION_9:
        Details: '*.bat'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and (SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14 or SELECTION_15
        or SELECTION_16 or SELECTION_17))
falsepositives:
- none
fields:
- EventID
- CommandLine
- TargetObject
- Details
id: 4e8d5fd3-c959-441f-a941-f73d0cdcdca5
level: high
logsource:
    category: registry_event
    product: windows
modified: 2021/09/24
references:
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1112
- attack.t1053
yml_filename: registry_event_abusing_windows_telemetry_for_persistence.yml
yml_path: /home/itib/git/sigma/rules/windows/registry_event

