
title: Removal Amsi Provider Reg Key
author: frack113
date: 2021/06/07
description: Remove the AMSI Provider registry key in HKLM\Software\Microsoft\AMSI
  to disable AMSI inspection
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: DeleteKey
  SELECTION_5:
    TargetObject:
    - '*{2781761E-28E0-4109-99FE-B9D127C57AFE}'
    - '*{A7C452EF-8E9F-42EB-9F2B-245613CA0DC9}'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- unknown
id: 41d1058a-aea7-4952-9293-29eaaf516465
level: high
logsource:
  category: registry_event
  definition: key must be add to the sysmon configuration to works
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
- https://seclists.org/fulldisclosure/2020/Mar/45
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
