title: Sysinternals SDelete Registry Keys
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection to trigger for the creation or modification of .*\Software\Sysinternals\SDelete
    registry keys. Indicators of the use of Sysinternals SDelete tool.
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*\Software\Sysinternals\SDelete*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- unknown
id: 9841b233-8df8-4ad7-9133-b0b4402a9014
level: medium
logsource:
    category: registry_event
    product: windows
modified: 2021/05/12
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/9
- https://threathunterplaybook.com/evals/apt29/detections/4.B.2_59A9AC92-124D-4C4B-A6BF-3121C98677C3.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
yml_filename: sysmon_sysinternals_sdelete_registry_keys.yml
yml_path: /home/itib/git/sigma/rules/windows/registry_event

