title: Wdigest Enable UseLogonCredential
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2019/09/12
description: Detects potential malicious modification of the property value of UseLogonCredential
    from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to enable
    clear-text credentials
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*WDigest\UseLogonCredential'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Unknown
id: d6a9b252-c666-4de6-8806-5561bbbd3bdc
level: high
logsource:
    category: registry_event
    product: windows
modified: 2021/05/27
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
yml_filename: sysmon_wdigest_enable_uselogoncredential.yml
yml_path: /home/itib/git/sigma/rules/windows/registry_event

