title: DLL Load via LSASS
author: Florian Roth
date: 2019/10/16
description: Detects a method to load DLL via LSASS process using an undocumented
    Registry key
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*\CurrentControlSet\Services\NTDS\DirectoryServiceExtPt*'
    SELECTION_5:
        TargetObject: '*\CurrentControlSet\Services\NTDS\LsaDbExtPt*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
id: b3503044-60ce-4bf4-bbcb-e3db98788823
level: high
logsource:
    category: registry_event
    product: windows
modified: 2020/07/01
references:
- https://blog.xpnsec.com/exploring-mimikatz-part-1/
- https://twitter.com/SBousseaden/status/1183745981189427200
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.t1177
- attack.t1547.008
yml_filename: sysmon_susp_lsass_dll_load.yml
yml_path: /home/itib/git/sigma/rules/windows/registry_event

