title: Suspicious New Printer Ports in Registry (CVE-2020-1048)
author: EagleEye Team, Florian Roth, NVISO
date: 2020/05/13
description: Detects a new and suspicious printer port creation in Registry that could
    be an attempt to exploit CVE-2020-1048
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Ports*
    SELECTION_5:
        Details: '*.dll*'
    SELECTION_6:
        Details: '*.exe*'
    SELECTION_7:
        Details: '*.bat*'
    SELECTION_8:
        Details: '*.com*'
    SELECTION_9:
        Details: '*C:*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and (SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9))
falsepositives:
- New printer port install on host
id: 7ec912f2-5175-4868-b811-ec13ad0f8567
level: high
logsource:
    category: registry_event
    product: windows
modified: 2020/09/06
references:
- https://windows-internals.com/printdemon-cve-2020-1048/
status: experimental
tags:
- attack.persistence
- attack.execution
- attack.defense_evasion
- attack.t1112
yml_filename: sysmon_cve_2020_1048.yml
yml_path: /home/itib/git/sigma/rules/windows/registry_event

