title: Persistent Outlook Landing Pages
author: Tobias Michalski
date: 2021/06/10
description: Detects the manipulation of persistent URLs which could execute malicious
    code
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*Software\Microsoft\Office\\*'
    SELECTION_5:
        TargetObject: '*\Outlook\Today\\*'
    SELECTION_6:
        TargetObject: '*Stamp'
    SELECTION_7:
        Details: DWORD (0x00000001)
    SELECTION_8:
        TargetObject: '*UserDefinedUrl'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 or SELECTION_5)
        and ((SELECTION_6 and SELECTION_7) or SELECTION_8))
falsepositives:
- unknown
fields:
- Details
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
    category: registry_event
    product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
status: experimental
tags:
- attack.persistence
- attack.t1112
yml_filename: win_outlook_registry_todaypage.yml
yml_path: /home/itib/git/sigma/rules/windows/registry_event

