
title: Silenttrinity Stager Msbuild Activity
author: Kiran kumar s, oscd.community
date: 2020/10/11
description: Detects a possible remote connections to Silenttrinity c2
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    Image: '*\msbuild.exe'
  SELECTION_3:
    DestinationPort:
    - '80'
    - '443'
  SELECTION_4:
    Initiated: 'true'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- unknown
id: 50e54b8d-ad73-43f8-96a1-5191685b17a4
level: high
logsource:
  category: network_connection
  product: windows
references:
- https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/
status: experimental
tags:
- attack.execution
- attack.t1127.001
