author: Zach Mathis
date: 2021/12/16
modified: 2021/12/16

title: Network Share Access
title_jp: ネットワーク共有へのアクセス
details: 'User: %SubjectUserName%  :  Share Name: %ShareName%  :  Share Path: %ShareLocalPath%  :  IP Address: %IpAddress%  :  LogonID: %SubjectLogonId%'
details_jp: 'ユーザ: %SubjectUserName%  :  共有名: %ShareName%  :  共有パス: %ShareLocalPath%  :  IPアドレス: %IpAddress%  :  ログオンID: %SubjectLogonId%'
description: 
description_jp: 

id: 15d042c1-07c6-4e16-ae7d-e0e556ccd9a8
level: informational
status: stable
detection:
    selection:
        Channel: Security
        EventID: 5140
    condition: selection
falsepositives:
    - normal system usage
tags:
    - attack.t1039 # Data from network shared drive
    - attack.collection
references:
sample-evtx: ./EVTX-to-MITRE-Attack/TA0007-Discovery/T1135.xxx-Network Share Discovery/ID5140-5145-Bloodhound-SharpHound enumeration via SMB.evtx
logsource: non-default
ruletype: Hayabusa