author: Zach Mathis
date: 2020/11/08
modified: 2021/11/26

title: Logon Type 5 - Service
title_jp: ログオンタイプ 5 - サービス
output: 'User: %TargetUserName%  :  Workstation: %WorkstationName%  :  IP Address: %IpAddress%  :  Port: %IpPort%  :  LogonID: %TargetLogonId%'
output_jp: 'ユーザ: %TargetUserName%  :  端末: %WorkstationName%  :  IPアドレス: %IpAddress%  :  ポート番号: %IpPort%  :  ログオンID: %TargetLogonId%'
description: Prints logon information
description_jp: Prints logon information

id: 408e1304-51d7-4d3e-ab31-afd07192400b
level: low
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 5
    filter:
        - TargetUserName: "SYSTEM"
        - TargetUserName: "NETWORK SERVICE"
        - TargetUserName: "LOCAL SERVICE"
    condition: selection and not filter
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: default
ruletype: Hayabusa