author: Zach Mathis
date: 2020/11/08
modified: 2021/11/26

title: Logon Type 13 - CachedUnlock
title_jp: ログオンタイプ 13 - キャッシュされたアンロック
details: 'User: %TargetUserName%  :  Workstation: %WorkstationName%  :  IP Address: %IpAddress%  :  LogonID: %TargetLogonId%  :  (Warning: Credentials are stored in memory)'
details_jp: 'ユーザ: %TargetUserName%  :  端末: %WorkstationName%  :  IPアドレス: %IpAddress%  :  ログオンID: %TargetLogonId%  :  (注意: 資格情報がメモリに格納される)'
description: Prints logon information. 
description_jp: Prints logon information.

id: e50e3952-06d9-44a8-ab07-7a41c9801d78
level: informational
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 13
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: default
ruletype: Hayabusa
