author: Zach Mathis
date: 2020/11/08
modified: 2021/11/26

title: Logon Type 9 - NewCredentials
title_jp: ログオンタイプ 9 - 新しい資格情報
output: 'User: %TargetUserName%  :  Workstation: %WorkstationName%  :  IP Address: %IpAddress%  :  Port: %IpPort%  :  LogonID: %TargetLogonId%  :  (Warning: Credentials are stored in memory)'
output_jp: 'ユーザ: %TargetUserName%  :  端末: %WorkstationName%  :  IPアドレス: %IpAddress%  :  ポート番号: %IpPort%  :  ログオンID: %TargetLogonId%  :  (注意: 資格情報がメモリに格納される)'
description: Prints logon information. 
description_jp: Prints logon information.

id: d80facaa-ca97-47bb-aed2-66362416eb49
level: informational
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 9
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: default
ruletype: Hayabusa