author: Zach Mathis
date: 2020/11/08
modified: 2021/11/26

title: Logon Type 10 - RDP (Remote Interactive)
title_jp: ログオンタイプ 10 - RDP (リモートインタラクティブ)
output: 'User: %TargetUserName%  :  Workstation: %WorkstationName%  :  IP Address: %IpAddress%  :  Port: %IpPort%  :  LogonID: %TargetLogonId%  :  (Warning: Credentials are stored in memory)'
output_jp: 'ユーザ: %TargetUserName%  :  端末: %WorkstationName%  :  IPアドレス: %IpAddress%  :  ポート番号: %IpPort%  :  ログオンID: %TargetLogonId%  :  (注意: 資格情報がメモリに格納される)'
description: Prints logon information. 
description_jp: Prints logon information.

id: a4e05f05-ff88-48b9-8524-a88c1c32fe19
level: informational
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 10
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: default
ruletype: Hayabusa
