author: Zach Mathis
date: 2020/11/08
modified: 2021/11/26

title: Logon Type 0 - System
title_jp: ログオンタイプ 0 - System
output: 'Bootup'
output_jp: 'システム起動'
description: Prints logon information
description_jp: Prints logon information

id: 9fa273cc-bcb2-4789-85e3-14ca253ac7f4
level: informational
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 0
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: default
ruletype: Hayabusa