author: Zach Mathis
date: 2021/12/17
modified: 2021/12/17

title: Explicit Logon
title_jp: 明示的なログオン
details: 'Source User: %SubjectUserName%  :  Target User: %TargetUserName%  :  IP Address: %IpAddress%  :  Process: %ProcessName%  :  Target Server: %TargetInfo%'
details_jp: 'ソースユーザ: %SubjectUserName%  :  ターゲットユーザ: %TargetUserName%  :  IPアドレス: %IpAddress%  :  プロセス: %ProcessName%  :  ターゲットサーバ: %TargetInfo%'
description: |
    (From ultimatewindowsecurity.com)
    This log is generated when
    1. A user connects to a server or runs a program locally using alternate credentials.  
       For instance a user maps a drive to a server but specifies a different user's credentials or opens a shortcut under RunAs by shift-control-right-clicking on the shortcut, 
       selecting Run as..., and then filling in a different user's credentials in the dialog box that appears.  Or a user logs on to a web site using new specific credentials. 
    2. When a process logs on as a different account such as when the Scheduled Tasks service starts a task as the specified user. 
    3. With User Account Control enabled, an end user runs a program requiring admin authority.  You will get this event where the process information is consent.exe.  
       Unfortunately the Subject does not identify the end user.
    4. Logging on interactively to a server with a domain account. (Two 4624 events will also be generated.)
description_jp:

id: 8c1899fe-493d-4faf-aae1-0853a33a3278
level: informational
status: stable
detection:
    selection_basic_info:
        Channel: Security
        EventID: 4648
    selection_TargetUserIsComputerAccount:
        TargetUserName|endswith: "$"  
        IpAddress: "-"
    filter_SuspiciousProcess:
        - ProcessName|endswith: "powershell.exe"
        - ProcessName|endswith: "WMIC.exe"
    filter_UsersAndTargetServerAreComputerAccounts:     #Filter system noise
        SubjectUserName|endswith: "$"
        TargetUserName|endswith: "$"
        TargetInfo|endswith: "$"
    filter_SubjectUserIsComputerAccount:
        SubjectUserName|endswith: "$" 
    filter_SystemAccounts:
        TargetUserName|re: "(DWM|UMFD)-([0-9]|1[0-2])$" #Filter out default Desktop Windows Manager and User Mode Driver Framework accounts
        IpAddress: "-"                                  #Don't filter if the IP address is remote to catch attackers who created backdoor accounts that look like DWM-12, etc..
    condition: selection_basic_info and not (selection_TargetUserIsComputerAccount and not filter_SubjectUserIsComputerAccount) and not filter_SystemAccounts 
               and not filter_UsersAndTargetServerAreComputerAccounts and not filter_SuspiciousProcess
falsepositives:
    - normal system usage
tags:
    - attack.privilege_escalation
    - attack.lateral_movement
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4648
sample-evtx: ./EVTX-ATTACK-SAMPLES/Privilege Escalation/Runas_4624_4648_Webshell_CreateProcessAsUserA.evtx
logsource: default
ruletype: Hayabusa