author: Zach Mathis
date: 2020/11/08
modified: 2021/11/26

title: Kerberos TGT was requested
title_jp: Kerberos TGTが要求された
details: 'User: %TargetUserName%  :  Service: %ServiceName%  :  IP Address: %IpAddress%  :  Status: %Status%  :  PreAuthType: %PreAuthType%'
details_jp: 'ユーザ: %TargetUserName%  :  サービス: %ServiceName%  :  IPアドレス: %IpAddress%  :  ステータス: %Status%  :  事前認証タイプ: %PreAuthType%'
description: Prints logon information. 
description_jp: Prints logon information.

id: d9f336ea-bb16-4a35-8a9c-183216b8d59c
level: informational
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4768
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: default
ruletype: Hayabusa
