
title: Disabled Users Failing To Authenticate From Source Using Kerberos
ruletype: Sigma
author: Mauricio Velazco, frack113
date: 2021/06/01
description: Detects failed logins with multiple disabled domain accounts from a single
  source system using the Kerberos protocol.
detection:
  SELECTION_1:
    EventID: 4768
  SELECTION_2:
    Status: '0x12'
  SELECTION_3:
    TargetUserName: '*$'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3)) | count(TargetUserName)
    by IpAddress > 10
  timeframe: 24h
falsepositives:
- Vulnerability scanners
- Misconfigured systems
- Remote administration tools
- VPN terminators
- Multiuser systems like Citrix server farms
id: 4b6fe998-b69c-46d8-901b-13677c9fb663
level: medium
logsource:
  product: windows
  service: security
modified: 2021/07/06
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
status: experimental
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation
