
title: WMI Persistence
ruletype: Sigma
author: Florian Roth, Gleb Sukhodolskiy, Timur Zinniatullin oscd.community
date: 2017/08/22
description: Detects suspicious WMI event filter and command line event consumer based
  on WMI and Security Logs.
detection:
  SELECTION_1:
    EventID: 4662
  SELECTION_2:
    ObjectType: WMI Namespace
  SELECTION_3:
    ObjectName: '*subscription*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown (data set is too small; further testing needed)
id: f033f3f3-fd24-4995-97d8-a3bb17550a88
level: medium
logsource:
  product: windows
  service: security
modified: 2021/09/21
references:
- https://twitter.com/mattifestation/status/899646620148539397
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
related:
- id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
  type: derived
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1084
- attack.t1546.003
