
title: First Time Seen Remote Named Pipe
ruletype: Sigma
author: Samir Bousseaden
date: 2019/04/03
description: This detection excludes known namped pipes accessible remotely and notify
  on newly observed ones, may help to detect lateral movement and remote exec using
  named pipes
detection:
  SELECTION_1:
    EventID: 5145
  SELECTION_2:
    ShareName: \\\*\IPC$
  SELECTION_3:
    RelativeTargetName:
    - atsvc
    - samr
    - lsarpc
    - lsass
    - winreg
    - netlogon
    - srvsvc
    - protected_storage
    - wkssvc
    - browser
    - netdfs
    - svcctl
    - spoolss
    - ntsvcs
    - LSM_API_service
    - HydraLsPipe
    - TermSrv_API_service
    - MsFteWds
    - sql\query
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- update the excluded named pipe to filter out any newly observed legit named pipe
id: 52d8b0c6-53d6-439a-9e41-52ad442ad9ad
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
modified: 2021/12/06
references:
- https://twitter.com/menasec1/status/1104489274387451904
status: test
tags:
- attack.lateral_movement
- attack.t1077
- attack.t1021.002
