
title: RDP over Reverse SSH Tunnel WFP
ruletype: Sigma
author: Samir Bousseaden
date: 2019/02/16
description: Detects svchost hosting RDP termsvcs communicating with the loopback
  address
detection:
  SELECTION_1:
    EventID: 5156
  SELECTION_2:
    SourcePort: 3389
  SELECTION_3:
    DestAddress:
    - 127.*
    - ::1
  SELECTION_4:
    DestPort: 3389
  SELECTION_5:
    SourceAddress:
    - 127.*
    - ::1
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5)))
falsepositives:
- unknown
id: 5bed80b6-b3e8-428e-a3ae-d3c757589e41
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/06
references:
- https://twitter.com/SBousseaden/status/1096148422984384514
- https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Command%20and%20Control/DE_RDP_Tunnel_5156.evtx
status: experimental
tags:
- attack.defense_evasion
- attack.command_and_control
- attack.lateral_movement
- attack.t1076
- attack.t1090
- attack.t1090.001
- attack.t1090.002
- attack.t1021.001
- car.2013-07-002
