
title: AD Object WriteDAC Access
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
description: Detects WRITE_DAC access to a domain object
detection:
  SELECTION_1:
    EventID: 4662
  SELECTION_2:
    ObjectServer: DS
  SELECTION_3:
    AccessMask: '0x40000'
  SELECTION_4:
    ObjectType:
    - 19195a5b-6da0-11d0-afd3-00c04fd930c9
    - domainDNS
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 028c7842-4243-41cd-be6f-12f3cf1a26c7
level: critical
logsource:
  product: windows
  service: security
modified: 2021/11/27
references:
- https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190101151110.html
status: test
tags:
- attack.defense_evasion
- attack.t1222
- attack.t1222.001
