
title: T1047 Wmiprvse Wbemcomn DLL Hijack
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/12
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
  directory over the network for a WMI DLL Hijack scenario.
detection:
  SELECTION_1:
    Provider_Name: Microsoft-Windows-Eventlog
  SELECTION_2:
    EventID: 5145
  SELECTION_3:
    RelativeTargetName: '*\wbem\wbemcomn.dll'
  SELECTION_4:
    SubjectUserName: '*$'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Unknown
id: f6c68d5f-e101-4b86-8c84-7d96851fd65c
level: critical
logsource:
  product: windows
  service: security
modified: 2021/11/30
references:
- https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html
status: test
tags:
- attack.execution
- attack.t1047
- attack.lateral_movement
- attack.t1021.002
