title: Sysmon Check command lines
description: hogehoge
enabled: true
author: Yea
logsource:
    product: windows
detection:
    selection:
        EventLog: Sysmon
        EventID: 1
        CommandLine: "*"
    condition: selection
falsepositives:
    - unknown
level: low
tags:
    - tag1
    - tag2
output: "CommandLine=%CommandLine%¥nParentImage=%ParentImage%"
creation_date: 2020/11/8
updated_date: 2020/11/8
