id: 00000000-0000-0000-0000-000000000005
title: Sysmon Check command lines
description: hogehoge
enabled: true
author: Yea
logsource:
    product: windows
detection:
    selection:
        EventLog: Sysmon
        EventID: 1
        CommandLine: "*"
    condition: selection
falsepositives:
    - unknown
level: medium
tags:
    - tag12
output: "CommandLine=%CommandLine%¥nParentImage=%ParentImage%"
date: 2020-11-8
modified_data: 2020-11-8
ruletype: Hayabusa
status: experimental