
title: Turla Group Named Pipes
ruletype: Sigma
author: Markus Neis
date: 2017/11/06
description: Detects a named pipe used by Turla group samples
detection:
  SELECTION_1:
    EventID: 17
  SELECTION_2:
    EventID: 18
  SELECTION_3:
    PipeName:
    - \atctl
    - \userpipe
    - \iehelper
    - \sdlrpc
    - \comnap
  condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3)
falsepositives:
- Unknown
id: 739915e4-1e70-4778-8b8a-17db02f66db1
level: critical
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
  product: windows
modified: 2021/11/27
references:
- Internal Research
- https://attack.mitre.org/groups/G0010/
status: test
tags:
- attack.g0010
- attack.execution
- attack.t1106
