title: test
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
description: |
    condition not ()
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 3
    selection2:
        aaa: bbb
    selection3:
        ccc: ddd
    selection4:
        eee: fff
    selection5:
        ggg: hhh
    condition: not selection1 and not( selection2 and not (selection3 or selection4)) and selection5
falsepositives:
    - Unknown
level: medium
