title: test
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
description: |
    timeflame 
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 3
    timeflame: 2d
    condition: selection1
falsepositives:
    - Unknown
level: medium
