title: test
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
description: |
    base64 encode modifier
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection:
        UserName|base64: base64_encoded
        TargetUserName: test_start
    condition: selection
falsepositives:
    - Unknown
level: medium
