title: test
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
description: |
    map test and escape str test and empty string test and null test
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4100
        ObjectType: 'Key'
        ObjectKey: 'aaaValu__-*|3''|e '
        Ojb: ''
        aaa: null
    condition: selection
falsepositives:
    - Unknown
level: medium
