title: test
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
description: |
    endswith pipe modifier and startswith pipe modifier
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection:
        - UserName|endswith: hogehoge_end
        - TargetUserName|startswith: test_start
    condition: selection
falsepositives:
    - Unknown
level: medium
