
title: UAC Bypass via Event Viewer
ruletype: Sigma
author: Florian Roth
date: 2017/03/19
description: Detects UAC bypass method using Windows event viewer
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage: '*\eventvwr.exe'
  SELECTION_3:
    Image: '*\mmc.exe'
  condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
falsepositives:
- unknown
fields:
- CommandLine
- ParentCommandLine
id: be344333-921d-4c4d-8bb8-e584cf584780
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/09/12
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
related:
- id: 7c81fec3-1c1d-43b0-996a-46753041b1b6
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1088
- attack.t1548.002
- car.2019-04-001
