
title: WhoAmI as Parameter
ruletype: Sigma
author: Florian Roth
date: 2021/11/29
description: Detects a suspicious process command line that uses whoami as first parameter
  (as e.g. used by EfsPotato)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*.exe whoami*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: e9142d84-fbe0-401d-ac50-3e519fb00c89
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/blackarrowsec/status/1463805700602224645?s=12
status: experimental
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001
