
title: Office Applications Spawning Wmi Cli
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: Initial execution of malicious document calls wmic to execute the file
  with regsvr32
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\wbem\WMIC.exe'
  SELECTION_3:
    ParentCommandLine: '*wmic *'
  SELECTION_4:
    ParentImage:
    - winword.exe
    - excel.exe
    - powerpnt.exe
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Unknown
id: 04f5363a-6bca-42ff-be70-0d28bf629ead
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/09
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
ruletype: SIGMA
