
title: Suspicious Dump64.exe Execution
ruletype: Sigma
author: Austin Songer @austinsonger, Florian Roth
date: 2021/11/26
description: Detects when a user bypasses Defender by renaming a tool to dump64.exe
  and placing it in a Visual Studio folder
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\dump64.exe'
  SELECTION_3:
    Image: '*\Installer\Feedback\dump64.exe*'
  SELECTION_4:
    CommandLine:
    - '* -ma *'
    - '*accpeteula*'
  condition: (SELECTION_1 and SELECTION_2 and ( not (SELECTION_3) or SELECTION_4))
falsepositives:
- Dump64.exe in other folders than the excluded one
id: 129966c9-de17-4334-a123-8b58172e664d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/mrd0x/status/1460597833917251595
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
