
title: Suspicious Del in CommandLine
author: frack113
date: 2021/10/26
description: suspicious command line to remove exe or dll
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*del *'
  SELECTION_3:
    CommandLine: '*/f *'
  SELECTION_4:
    CommandLine: '*/q *'
  SELECTION_5:
    CommandLine: '*.exe*'
  SELECTION_6:
    CommandLine: '*C:\ProgramData\\*'
  SELECTION_7:
    CommandLine: '*.dll*'
  condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7)))
falsepositives:
- unknown
id: 204b17ae-4007-471b-917b-b917b315c5db
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.joesandbox.com/analysis/509330/0/html#1044F3BDBE3BB6F734E357235F4D5898582D
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
