
title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
ruletype: Sigma
author: frack113
date: 2021/07/27
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*7z.exe*'
    - '*7za.exe*'
  SELECTION_3:
    CommandLine: '* -p*'
  SELECTION_4:
    CommandLine:
    - '* a *'
    - '* u *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Command line parameter combinations that contain all included strings
fields:
- CommandLine
- ParentCommandLine
- CurrentDirectory
id: 9fbf5927-5261-4284-a71d-f681029ea574
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/12/02
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md
status: experimental
tags:
- attack.collection
- attack.t1560.001
