
title: Mavinject Inject DLL Into Running Process
author: frack113
date: 2021/07/12
description: Injects arbitrary DLL into running process specified by process ID. Requires
  Windows 10.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '* /INJECTRUNNING*'
  SELECTION_3:
    CommandLine: '*.dll*'
  SELECTION_4:
    OriginalFileName: '*mavinject*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 4f73421b-5a0b-4bbf-a892-5a7fb99bea66
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1056.004/T1056.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.collection
- attack.t1218
- attack.t1056.004
ruletype: SIGMA
