
title: Logon Scripts (UserInitMprLogonScript)
ruletype: Sigma
author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12
description: Detects creation or execution of UserInitMprLogonScript persistence method
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage: '*\userinit.exe'
  SELECTION_3:
    Image: '*\explorer.exe'
  SELECTION_4:
    CommandLine:
    - '*netlogon*.bat*'
    - '*UsrLogon.cmd*'
  SELECTION_5:
    CommandLine: '*UserInitMprLogonScript*'
  condition: (SELECTION_1 and (((SELECTION_2 and  not (SELECTION_3)) and  not (SELECTION_4))
    or SELECTION_5))
falsepositives:
- exclude legitimate logon scripts
- penetration tests, red teaming
id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/29
references:
- https://attack.mitre.org/techniques/T1037/
status: test
tags:
- attack.t1037
- attack.t1037.001
- attack.persistence
