
title: Run Once Task Execution as Configured in Registry
author: Avneet Singh @v3t0_, oscd.community
date: 2020/10/18
description: This rule detects the execution of Run Once task as configured in the
  registry
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image:
    - '*\runonce.exe'
  SELECTION_3:
    Description:
    - Run Once Wrapper
  SELECTION_4:
    CommandLine:
    - '* /AlternateShellStartup*'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Unknown
id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Runonce.yml
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
ruletype: SIGMA
