
title: ScreenConnect Remote Access
ruletype: Sigma
author: Florian Roth
date: 2021/02/11
description: Detects ScreenConnect program starts that establish a remote access to
  that system (not meeting, not remote support)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*e=Access&*'
  SELECTION_3:
    CommandLine: '*y=Guest&*'
  SELECTION_4:
    CommandLine: '*&p=*'
  SELECTION_5:
    CommandLine: '*&c=*'
  SELECTION_6:
    CommandLine: '*&k=*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Legitimate use by administrative staff
id: 75bfe6e6-cd8e-429e-91d3-03921e1d7962
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies
status: experimental
tags:
- attack.initial_access
- attack.t1133
