
title: CreateMiniDump Hacktool
ruletype: Sigma
author: Florian Roth
date: 2019/12/22
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
  memory for credential extraction on the attacker's machine
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\CreateMiniDump.exe*'
  SELECTION_3:
    Imphash: 4a07f944a83e8a7c2525efa35dd30e2f
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: 36d88494-1d43-4dc0-b3fa-35c8fea0ca9d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
references:
- https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
