
title: Suspicious Network Command
ruletype: Sigma
author: frack113
date: 2021/12/07
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*ipconfig /all*'
    - '*netsh interface show interface*'
    - '*arp -a*'
    - '*nbtstat -n*'
    - '*net config*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- administrator, hotline ask to user
id: a29c1813-ab1f-4dde-b489-330b952e91ae
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md#atomic-test-1---system-network-configuration-discovery-on-windows
status: experimental
tags:
- attack.discovery
- attack.t1016
