
title: Windows Shell Spawning Suspicious Program
author: Florian Roth
date: 2018/04/06
description: Detects a suspicious child process of a Windows shell
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage:
    - '*\mshta.exe'
    - '*\powershell.exe'
    - '*\rundll32.exe'
    - '*\cscript.exe'
    - '*\wscript.exe'
    - '*\wmiprvse.exe'
  SELECTION_3:
    Image:
    - '*\schtasks.exe'
    - '*\nslookup.exe'
    - '*\certutil.exe'
    - '*\bitsadmin.exe'
    - '*\mshta.exe'
  SELECTION_4:
    CurrentDirectory: '*\ccmcache\\*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Administrative scripts
- Microsoft SCCM
fields:
- CommandLine
- ParentCommandLine
id: 3a6586ad-127a-4d3b-a677-1e6eacdf8fde
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/06
references:
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1064
- attack.t1059.005
- attack.t1059.001
- attack.t1218
ruletype: SIGMA
