
title: Windows Update Client LOLBIN
ruletype: Sigma
author: FPT.EagleEye Team
date: 2020/10/17
description: Detects code execution via the Windows Update client (wuauclt)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*/UpdateDeploymentProvider*'
  SELECTION_3:
    CommandLine: '*/RunHandlerComServer*'
  SELECTION_4:
    CommandLine: '*.dll*'
  SELECTION_5:
    Image:
    - '*\wuauclt.exe'
  SELECTION_6:
    CommandLine:
    - '* /ClassId *'
    - '* wuaueng.dll *'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not (SELECTION_6))
falsepositives:
- Unknown
id: d7825193-b70a-48a4-b992-8b5b3015cc11
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/18
references:
- https://dtm.uk/wuauclt/
status: experimental
tags:
- attack.command_and_control
- attack.execution
- attack.t1105
- attack.t1218
