
title: Renamed SysInternals Debug View
author: Florian Roth
date: 2020/05/28
description: Detects suspicious renamed SysInternals DebugView execution
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Product:
    - Sysinternals DebugView
    - Sysinternals Debugview
  SELECTION_3:
    OriginalFileName: Dbgview.exe
  SELECTION_4:
    Image: '*\Dbgview.exe'
  condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3 and SELECTION_4))
falsepositives:
- Unknown
id: cd764533-2e07-40d6-a718-cfeec7f2da7f
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.epicturla.com/blog/sysinturla
status: experimental
tags:
- attack.resource_development
- attack.t1588.002
ruletype: SIGMA
