
title: WSL Execution
author: oscd.community, Zach Stanford @svch0st
date: 2020/10/05
description: Detects Possible usage of Windows Subsystem for Linux (WSL) binary as
  a LOLBIN
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image:
    - '*\wsl.exe'
  SELECTION_3:
    CommandLine:
    - '* -e *'
    - '* --exec *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Automation and orchestration scripts may use this method execute scripts etc
id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202
ruletype: SIGMA
