
title: DNS Exfiltration and Tunneling Tools Execution
ruletype: Sigma
author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
description: Well-known DNS Exfiltration tools execution
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\iodine.exe'
  SELECTION_3:
    Image: '*\dnscat2*'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Legitimate usage of iodine or dnscat2 — DNS Exfiltration tools (unlikely)
id: 98a96a5a-64a0-4c42-92c5-489da3866cb0
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
status: test
tags:
- attack.exfiltration
- attack.t1048.001
- attack.t1048
- attack.command_and_control
- attack.t1071.004
- attack.t1071
- attack.t1132.001
- attack.t1132
