
title: Lazarus Loaders
ruletype: Sigma
author: Florian Roth, wagga
date: 2020/12/23
description: Detects different loaders as described in various threat reports on Lazarus
  group activity
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*cmd.exe /c *'
  SELECTION_3:
    CommandLine: '* -p 0x*'
  SELECTION_4:
    CommandLine:
    - '*C:\ProgramData\\*'
    - '*C:\RECYCLER\\*'
  SELECTION_5:
    CommandLine: '*rundll32.exe *'
  SELECTION_6:
    CommandLine: '*C:\ProgramData\\*'
  SELECTION_7:
    CommandLine:
    - '*.bin,*'
    - '*.tmp,*'
    - '*.dat,*'
    - '*.io,*'
    - '*.ini,*'
    - '*.db,*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6 and SELECTION_7)))
falsepositives:
- unknown
id: 7b49c990-4a9a-4e65-ba95-47c9cc448f6e
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/06/27
references:
- https://www.hvs-consulting.de/lazarus-report/
- https://securelist.com/lazarus-covets-covid-19-related-intelligence/99906/
status: experimental
tags:
- attack.g0032
- attack.execution
- attack.t1059
