
title: Suspicious Compression Tool Parameters
author: Florian Roth, Samir Bousseaden
date: 2019/10/15
description: Detects suspicious command line arguments of common data compression
  tools
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    OriginalFileName:
    - 7z*.exe
    - '*rar.exe'
    - '*Command*Line*RAR*'
  SELECTION_3:
    CommandLine:
    - '* -p*'
    - '* -ta*'
    - '* -tb*'
    - '* -sdel*'
    - '* -dw*'
    - '* -hp*'
  SELECTION_4:
    ParentImage: C:\Program*
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- unknown
id: 27a72a60-7e5e-47b1-9d17-909c9abafdcd
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
references:
- https://twitter.com/SBousseaden/status/1184067445612535811
status: experimental
tags:
- attack.collection
- attack.t1560.001
- attack.exfiltration
- attack.t1020
- attack.t1002
ruletype: SIGMA
