
title: BlueMashroom DLL Load
author: Florian Roth
date: 2019/10/02
description: Detects a suspicious DLL loading from AppData Local path as described
  in BlueMashroom report
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*\AppData\Local\\*'
  SELECTION_3:
    CommandLine: '*\regsvr32*'
  SELECTION_4:
    CommandLine: '*,DllEntry*'
  condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unlikely
id: bd70d3f8-e60e-4d25-89f0-0b5a9cff20e0
level: critical
logsource:
  category: process_creation
  product: windows
references:
- https://www.virusbulletin.com/conference/vb2019/abstracts/apt-cases-exploiting-vulnerabilities-region-specific-software
status: experimental
tags:
- attack.defense_evasion
- attack.t1117
- attack.t1218.010
ruletype: SIGMA
