
title: AnyDesk Silent Installation
author: Ján Trenčanský
date: 2021/08/06
description: AnyDesk Remote Desktop silent installation can be used by attacker to
  gain remote access.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*--install*'
  SELECTION_3:
    CommandLine: '*--start-with-win*'
  SELECTION_4:
    CommandLine: '*--silent*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate deployment of AnyDesk
fields:
- CommandLine
- ParentCommandLine
- CurrentDirectory
id: 114e7f1c-f137-48c8-8f54-3088c24ce4b9
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/TheDFIRReport/status/1423361119926816776?s=20
- https://support.anydesk.com/Automatic_Deployment
status: experimental
tags:
- attack.t1219
ruletype: SIGMA
