
title: Suspicious Netsh DLL Persistence
author: Victor Sergeev, oscd.community
date: 2019/10/25
description: Detects persitence via netsh helper
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\netsh.exe'
  SELECTION_3:
    CommandLine: '*add*'
  SELECTION_4:
    CommandLine: '*helper*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 56321594-9087-49d9-bf10-524fe8479452
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/30
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.007/T1546.007.md
- https://attack.mitre.org/software/S0108/
status: test
tags:
- attack.privilege_escalation
- attack.t1546.007
- attack.s0108
ruletype: SIGMA
