
title: UAC Bypass Abusing Winsat Path Parsing - Process
ruletype: Sigma
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    IntegrityLevel:
    - High
    - System
  SELECTION_3:
    ParentImage: '*\AppData\Local\Temp\system32\winsat.exe'
  SELECTION_4:
    ParentCommandLine: '*C:\Windows \system32\winsat.exe*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 7a01183d-71a2-46ad-ad5c-acd989ac1793
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
