
title: Microsoft Workflow Compiler
author: Nik Seetharaman, frack113
date: 2019/01/16
description: Detects invocation of Microsoft Workflow Compiler, which may permit the
  execution of arbitrary unsigned code.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\Microsoft.Workflow.Compiler.exe'
  SELECTION_3:
    OriginalFileName: Microsoft.Workflow.Compiler.exe
  SELECTION_4:
    CommandLine: '*.xml*'
  condition: (SELECTION_1 and (SELECTION_2 or (SELECTION_3 and SELECTION_4)))
falsepositives:
- Legitimate MWC use (unlikely in modern enterprise environments)
fields:
- CommandLine
- ParentCommandLine
id: 419dbf2b-8a9b-4bea-bf99-7544b050ec8d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/13
references:
- https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1127
- attack.t1218
ruletype: SIGMA
