
title: Finger.exe Suspicious Invocation
author: Florian Roth, omkar72, oscd.community
date: 2021/02/24
description: Detects suspicious aged finger.exe tool execution often used in malware
  attacks nowadays
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\finger.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Admin activity (unclear what they do nowadays with finger.exe)
id: af491bca-e752-4b44-9c86-df5680533dbc
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/bigmacjpg/status/1349727699863011328?s=12
- https://app.any.run/tasks/40115012-a919-4208-bfed-41e82cb3dadf/
- http://hyp3rlinx.altervista.org/advisories/Windows_TCPIP_Finger_Command_C2_Channel_and_Bypassing_Security_Software.txt
status: experimental
tags:
- attack.command_and_control
- attack.t1105
ruletype: SIGMA
