
title: Raccine Uninstall
ruletype: Sigma
author: Florian Roth
date: 2021/01/21
description: Detects commands that indicate a Raccine removal from an end system.
  Raccine is a free ransomware protection tool.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*taskkill *'
  SELECTION_3:
    CommandLine: '*RaccineSettings.exe*'
  SELECTION_4:
    CommandLine: '*reg.exe*'
  SELECTION_5:
    CommandLine: '*delete*'
  SELECTION_6:
    CommandLine: '*Raccine Tray*'
  SELECTION_7:
    CommandLine: '*schtasks*'
  SELECTION_8:
    CommandLine: '*/DELETE*'
  SELECTION_9:
    CommandLine: '*Raccine Rules Updater*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Legitimate deinstallation by administrative staff
id: a31eeaed-3fd5-478e-a8ba-e62c6b3f9ecc
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/14
references:
- https://github.com/Neo23x0/Raccine
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
