
title: Suspicious Copy From or To System32
ruletype: Sigma
author: Florian Roth, Markus Neis, Tim Shelton (HAWK.IO)
date: 2020/07/03
description: Detects a suspicious copy command that copies a system program from System32
  to another directory on disk - sometimes used to use LOLBINs like certutil or desktopimgdownldr
  to a different location with a different name
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*xcopy*\System32\\*'
    - '*cmd.exe*/c*copy*\System32\\*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
- Admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/
- False positive when cmd.exe and xcopy.exe are called directly
fields:
- CommandLine
- ParentCommandLine
id: fff9d2b7-e11c-4a69-93d3-40ef66189767
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/12/30
references:
- https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
status: test
tags:
- attack.defense_evasion
- attack.t1036.003
