
title: Suspicious Commandline Escape
author: juju4
date: 2018/12/11
description: Detects suspicious process that use escape characters
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*h^t^t^p*'
    - '*h"t"t"p*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: f0cdd048-82dc-4f7a-8a7a-b87a52b6d0fd
level: low
logsource:
  category: process_creation
  product: windows
modified: 2020/03/14
references:
- https://twitter.com/vysecurity/status/885545634958385153
- https://twitter.com/Hexacorn/status/885553465417756673
- https://twitter.com/Hexacorn/status/885570278637678592
- https://www.fireeye.com/blog/threat-research/2017/06/obfuscation-in-the-wild.html
- http://www.windowsinspired.com/understanding-the-command-line-string-and-arguments-received-by-a-windows-program/
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
