
title: Invoke-Obfuscation CLIP+ Launcher
author: Jonathan Cheong, oscd.community
date: 2020/10/13
description: Detects Obfuscated use of Clip.exe to execute PowerShell
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine|re: .*cmd.{0,5}(?:/c|/r).+clip(?:\.exe)?.{0,4}&&.+clipboard]::\(\s\\"\{\d\}.+\-f.+"
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: b222df08-0e07-11eb-adc1-0242ac120002
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
ruletype: SIGMA
