
title: MsiExec Web Install
author: Florian Roth
date: 2018/02/09
description: Detects suspicious msiexec process starts with web addresses as parameter
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '* msiexec*'
  SELECTION_3:
    CommandLine: '*://*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
references:
- https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.007
- attack.command_and_control
- attack.t1105
