
title: Suspicious Netsh Discovery Command
ruletype: Sigma
author: frack113
date: 2021/12/07
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*netsh *'
  SELECTION_3:
    CommandLine: '*advfirewall *'
  SELECTION_4:
    CommandLine: '*firewall *'
  SELECTION_5:
    CommandLine: '*show *'
  SELECTION_6:
    CommandLine: '*rule *'
  SELECTION_7:
    CommandLine: '*name=all*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- administrator, hotline ask to user
id: 0e4164da-94bc-450d-a7be-a4b176179f1f
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
status: experimental
tags:
- attack.discovery
- attack.t1016
