
title: AWL Bypass with Winrm.vbs and Malicious WsmPty.xsl/WsmTxt.xsl
author: Julia Fomina, oscd.community
date: 2020/10/06
description: Detects execution of attacker-controlled WsmPty.xsl or WsmTxt.xsl via
  winrm.vbs and copied cscript.exe (can be renamed)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*winrm*'
  SELECTION_3:
    CommandLine:
    - '*format:pretty*'
    - '*format:"pretty"*'
    - '*format:"text"*'
    - '*format:text*'
  SELECTION_4:
    Image:
    - C:\Windows\System32\\*
    - C:\Windows\SysWOW64\\*
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unlikely
id: 074e0ded-6ced-4ebd-8b4d-53f55908119d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
references:
- https://posts.specterops.io/application-whitelisting-bypass-and-arbitrary-unsigned-code-execution-technique-in-winrm-vbs-c8c24fb40404
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
ruletype: SIGMA
