
title: MSTSC Shadowing
ruletype: Sigma
author: Florian Roth
date: 2020/01/24
description: Detects RDP session hijacking by using MSTSC shadowing
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*noconsentprompt*'
  SELECTION_3:
    CommandLine: '*shadow:*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 6ba5a05f-b095-4f0a-8654-b825f4f16334
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://twitter.com/kmkz_security/status/1220694202301976576
- https://github.com/kmkz/Pentesting/blob/master/Post-Exploitation-Cheat-Sheet
status: test
tags:
- attack.lateral_movement
- attack.t1563.002
