
title: UAC Bypass Using PkgMgr and DISM
author: Christian Burkard
date: 2021/08/23
description: Detects the pattern of UAC Bypass using pkgmgr.exe and dism.exe (UACMe
  23)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage: '*\pkgmgr.exe'
  SELECTION_3:
    Image: '*\dism.exe'
  SELECTION_4:
    IntegrityLevel:
    - High
    - System
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: a743ceba-c771-4d75-97eb-8a90f7f4844c
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
ruletype: SIGMA
