
title: Suspect Svchost Activity
ruletype: Sigma
author: David Burkett
date: 2019/12/28
description: It is extremely abnormal for svchost.exe to spawn without any CLI arguments
  and is normally observed when a malicious process spawns the process and injects
  code into the process memory space.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*svchost.exe'
  SELECTION_3:
    Image: '*\svchost.exe'
  SELECTION_4:
    ParentImage:
    - '*\rpcnet.exe'
    - '*\rpcnetp.exe'
  SELECTION_5:
    CommandLine|re: ^$
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4
    or SELECTION_5))
falsepositives:
- rpcnet.exe / rpcnetp.exe which is a lojack style software. https://www.blackhat.com/docs/us-14/materials/us-14-Kamlyuk-Kamluk-Computrace-Backdoor-Revisited.pdf
fields:
- CommandLine
- ParentCommandLine
id: 16c37b52-b141-42a5-a3ea-bbe098444397
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/02/24
references:
- https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
