
title: Possible Applocker Bypass
author: juju4
date: 2019/01/16
description: Detects execution of executables that can be used to bypass Applocker
  whitelisting
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*\msdt.exe*'
    - '*\installutil.exe*'
    - '*\regsvcs.exe*'
    - '*\regasm.exe*'
    - '*\msbuild.exe*'
    - '*\ieexec.exe*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
- Using installutil to add features for .NET applications (primarily would occur in
  developer environments)
id: 82a19e3a-2bfe-4a91-8c0d-5d4c98fbb719
level: low
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
references:
- https://github.com/subTee/ApplicationWhitelistBypassTechniques/blob/master/TheList.txt
- https://room362.com/post/2014/2014-01-16-application-whitelist-bypass-using-ieexec-dot-exe/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1127.001/T1127.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1118
- attack.t1218.004
- attack.t1121
- attack.t1218.009
- attack.t1127
- attack.t1127.001
- attack.t1170
- attack.t1218.005
- attack.t1218
ruletype: SIGMA
