
title: Execution via WorkFolders.exe
author: Maxime Thiebaut (@0xThiebaut)
date: 2021/10/21
description: Detects using WorkFolders.exe to execute an arbitrary control.exe
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\control.exe'
  SELECTION_3:
    ParentImage: '*\WorkFolders.exe'
  SELECTION_4:
    Image: C:\Windows\System32\control.exe
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Legitimate usage of the uncommon Windows Work Folders feature.
id: 0bbc6369-43e3-453d-9944-cae58821c173
level: high
logsource:
  category: process_creation
  definition: 'Requirements: Sysmon ProcessCreation logging must be activated'
  product: windows
references:
- https://twitter.com/elliotkillick/status/1449812843772227588
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
ruletype: SIGMA
