
title: Network Sniffing
author: Timur Zinniatullin, oscd.community
date: 2019/10/21
description: Network sniffing refers to using the network interface on a system to
  monitor or capture information sent over a wired or wireless connection. An adversary
  may place a network interface into promiscuous mode to passively access data in
  transit over the network, or use span ports to capture a larger amount of data.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\tshark.exe'
  SELECTION_3:
    CommandLine: '*-i*'
  SELECTION_4:
    Image: '*\windump.exe'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or SELECTION_4))
falsepositives:
- Admin activity
fields:
- Image
- CommandLine
- User
- LogonGuid
- Hashes
- ParentProcessGuid
- ParentCommandLine
id: ba1f7802-adc7-48b4-9ecb-81e227fddfd5
level: low
logsource:
  category: process_creation
  product: windows
modified: 2019/11/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1040/T1040.md
status: experimental
tags:
- attack.credential_access
- attack.discovery
- attack.t1040
