
title: Reconnaissance Activity with Net Command
author: Florian Roth, Markus Neis
date: 2018/08/22
description: Detects a set of commands often used in recon stages by different attack
  groups
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - tasklist
    - net time
    - systeminfo
    - whoami
    - nbtstat
    - net start
    - qprocess
    - nslookup
    - hostname.exe
    - netstat -an
  SELECTION_3:
    CommandLine:
    - '*\net1 start'
    - '*\net1 user /domain'
    - '*\net1 group /domain'
    - '*\net1 group "domain admins" /domain'
    - '*\net1 group "Exchange Trusted Subsystem" /domain'
    - '*\net1 accounts /domain'
    - '*\net1 user net localgroup administrators'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3)) | count() by CommandLine
    > 4
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: 2887e914-ce96-435f-8105-593937e90757
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
references:
- https://twitter.com/haroonmeer/status/939099379834658817
- https://twitter.com/c_APT_ure/status/939475433711722497
- https://www.fireeye.com/blog/threat-research/2016/05/targeted_attacksaga.html
status: experimental
tags:
- attack.discovery
- attack.t1087
- attack.t1082
- car.2016-03-001
