
title: Execution of Renamed PaExec
ruletype: Sigma
author: Jason Lynch
date: 2019/04/17
description: Detects execution of renamed paexec via imphash and executable product
  string
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Product:
    - '*PAExec*'
  SELECTION_3:
    Imphash:
    - 11D40A7B7876288F919AB819CC2D9802
    - 6444f8a34e99b8f7d9647de66aabe516
    - dfd6aa3f7b2b1035b76b718f1ddc689f
    - 1a6cca4d5460b1710a12dea39e4a592c
  SELECTION_4:
    Image: '*paexec*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Unknown imphashes
id: 7b0666ad-3e38-4e3d-9bab-78b06de85f7b
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- sha256=01a461ad68d11b5b5096f45eb54df9ba62c5af413fa9eb544eacb598373a26bc
- https://summit.fireeye.com/content/dam/fireeye-www/summit/cds-2018/presentations/cds18-technical-s05-att&cking-fin7.pdf
status: test
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1036.003
- attack.g0046
- car.2013-05-009
