
title: Exports Critical Registry Keys To a File
ruletype: Sigma
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/12
description: Detects the export of a crital Registry key to a file.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\regedit.exe'
  SELECTION_3:
    CommandLine: '* /E *'
  SELECTION_4:
    CommandLine:
    - '*hklm*'
    - '*hkey_local_machine*'
  SELECTION_5:
    CommandLine:
    - '*\system'
    - '*\sam'
    - '*\security'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Dumping hives for legitimate purpouse i.e. backup or forensic investigation
fields:
- ParentImage
- CommandLine
id: 82880171-b475-4201-b811-e9c826cd5eaa
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regedit.yml
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: test
tags:
- attack.exfiltration
- attack.t1012
