
title: UAC Bypass Using IEInstal - Process
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    IntegrityLevel:
    - High
    - System
  SELECTION_3:
    ParentImage: '*\ieinstal.exe'
  SELECTION_4:
    Image: '*\AppData\Local\Temp\\*'
  SELECTION_5:
    Image: '*consent.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 80fc36aa-945e-4181-89f2-2f907ab6775d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
ruletype: SIGMA
