
title: Psr.exe Capture Screenshots
ruletype: Sigma
author: Beyu Denis, oscd.community
date: 2019/10/12
description: The psr.exe captures desktop screenshots and saves them on the local
  machine
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\Psr.exe'
  SELECTION_3:
    CommandLine: '*/start*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 2158f96f-43c2-43cb-952a-ab4580f32382
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OSBinaries/Psr.yml
- https://www.sans.org/summit-archives/file/summit-archive-1493861893.pdf
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1113/T1113.md
status: test
tags:
- attack.collection
- attack.t1113
