
title: Renamed ProcDump
ruletype: Sigma
author: Florian Roth
date: 2019/11/18
description: Detects the execution of a renamed ProcDump executable often used by
  attackers or malware
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    OriginalFileName: procdump
  SELECTION_3:
    CommandLine: '* -ma *'
  SELECTION_4:
    CommandLine: '* -accepteula *'
  SELECTION_5:
    CommandLine: '* -ma *'
  SELECTION_6:
    CommandLine: '*.dmp*'
  SELECTION_7:
    Image:
    - '*\procdump.exe'
    - '*\procdump64.exe'
  condition: (SELECTION_1 and ((SELECTION_2 or (SELECTION_3 and SELECTION_4)) or (SELECTION_5
    and SELECTION_6)) and  not (SELECTION_7))
falsepositives:
- Procdump illegaly bundled with legitimate software
- Weird admins who renamed binaries
id: 4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/08/16
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/procdump
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1036.003
