
title: File or Folder Permissions Modifications
author: Jakob Weinzettl, oscd.community
date: 2019/10/23
description: Detects a file or folder's permissions being modified.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image:
    - '*\takeown.exe'
    - '*\cacls.exe'
    - '*\icacls.exe'
  SELECTION_3:
    CommandLine: '*/grant*'
  SELECTION_4:
    Image: '*\attrib.exe'
  SELECTION_5:
    CommandLine: '*-r*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5)))
falsepositives:
- Users interacting with the files on their own (unlikely unless privileged users).
fields:
- ComputerName
- User
- CommandLine
id: 37ae075c-271b-459b-8d7b-55ad5f993dd8
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/08
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222.001/T1222.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1222.001
- attack.t1222
ruletype: SIGMA
