
title: Fireball Archer Install
author: Florian Roth
date: 2017/06/03
description: Detects Archer malware invocation via rundll32
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*rundll32.exe*'
  SELECTION_3:
    CommandLine: '*InstallArcherSvc*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 3d4aebe0-6d29-45b2-a8a4-3dfde586a26d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
references:
- https://www.virustotal.com/en/file/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022/analysis/
- https://www.hybrid-analysis.com/sample/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022?environmentId=100
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218.011
- attack.t1085
ruletype: SIGMA
