
title: Suspicious Code Page Switch
ruletype: Sigma
author: Florian Roth, Jonhnathan Ribeiro, oscd.community
date: 2019/10/14
description: Detects a code page switch in command line or batch scripts to a rare
  language
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\chcp.com'
  SELECTION_3:
    CommandLine:
    - '* 936'
    - '* 1258'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Administrative activity (adjust code pages according to your organisation's region)
fields:
- ParentCommandLine
id: c7942406-33dd-4377-a564-0f62db0593a3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
references:
- https://docs.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://twitter.com/cglyer/status/1183756892952248325
status: experimental
tags:
- attack.t1036
- attack.defense_evasion
