
title: Suspicious ZipExec Execution
ruletype: Sigma
author: frack113
date: 2021/11/07
description: ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into
  a password-protected zip file.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*.zip*'
  SELECTION_3:
    CommandLine: '*/generic:Microsoft_Windows_Shell_ZipFolder:filename=*'
  SELECTION_4:
    CommandLine: '*/pass:*'
  SELECTION_5:
    CommandLine: '*/user:*'
  SELECTION_6:
    CommandLine: '*/delete*'
  SELECTION_7:
    CommandLine: '*Microsoft_Windows_Shell_ZipFolder:filename=*'
  condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7)))
falsepositives:
- unknown
id: 90dcf730-1b71-4ae7-9ffc-6fcf62bd0132
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/SBousseaden/status/1451237393017839616
- https://github.com/Tylous/ZipExec
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202
