
title: Suspicious Service Path Modification
author: Victor Sergeev, oscd.community
date: 2019/10/21
description: Detects service path modification to PowerShell or cmd.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\sc.exe'
  SELECTION_3:
    CommandLine: '*config*'
  SELECTION_4:
    CommandLine: '*binpath*'
  SELECTION_5:
    CommandLine:
    - '*powershell*'
    - '*cmd*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 138d3531-8793-4f50-a2cd-f291b2863d78
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/28
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1543.003/T1543.003.md
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
- attack.t1031
ruletype: SIGMA
