
title: Renamed Whoami Execution
author: Florian Roth
date: 2021/08/12
description: Detects the execution of whoami that has been renamed to a different
  name to avoid detection
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    OriginalFileName: whoami.exe
  SELECTION_3:
    Image: '*\whoami.exe'
  condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
falsepositives:
- Unknown
id: f1086bf7-a0c4-4a37-9102-01e573caf4a0
level: critical
logsource:
  category: process_creation
  product: windows
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
status: experimental
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001
ruletype: SIGMA
