
title: PowerShell Base64 Encoded Shellcode
ruletype: Sigma
author: Florian Roth
date: 2018/11/17
description: Detects Base64 encoded Shellcode
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*AAAAYInlM*'
  SELECTION_3:
    CommandLine:
    - '*OiCAAAAYInlM*'
    - '*OiJAAAAYInlM*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 2d117e49-e626-4c7c-bd1f-c3c0147774c8
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://twitter.com/cyb3rops/status/1063072865992523776
status: test
tags:
- attack.defense_evasion
- attack.t1027
