
title: Suspicious Execution from Outlook
author: Markus Neis
date: 2018/12/27
description: Detects EnableUnsafeClientMailRules used for Script Execution from Outlook
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*EnableUnsafeClientMailRules*'
  SELECTION_3:
    ParentImage: '*\outlook.exe'
  SELECTION_4:
    CommandLine: '*\\\\\*'
  SELECTION_5:
    CommandLine: '*\\\*'
  SELECTION_6:
    CommandLine: '*.exe*'
  condition: (SELECTION_1 and (SELECTION_2 or (SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)))
falsepositives:
- unknown
id: e212d415-0e93-435f-9e1a-f29005bb4723
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
references:
- https://github.com/sensepost/ruler
- https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
status: experimental
tags:
- attack.execution
- attack.t1059
- attack.t1202
ruletype: SIGMA
