
title: Abusing Print Executable
ruletype: Sigma
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
date: 2020/10/05
description: Attackers can use print.exe for remote file copy
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image:
    - '*\print.exe'
  SELECTION_3:
    CommandLine:
    - print*
  SELECTION_4:
    CommandLine:
    - '*/D*'
  SELECTION_5:
    CommandLine:
    - '*.exe*'
  SELECTION_6:
    CommandLine:
    - '*print.exe*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not (SELECTION_6))
falsepositives:
- Unknown
id: bafac3d6-7de9-4dd9-8874-4a1194b493ed
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Print.yml
- https://twitter.com/Oddvarmoe/status/985518877076541440
status: test
tags:
- attack.defense_evasion
- attack.t1218
