
title: Suspicious Use of CSharp Interactive Console
ruletype: Sigma
author: Michael R. (@nahamike01)
date: 2020/03/08
description: Detects the execution of CSharp interactive console by PowerShell
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\csi.exe'
  SELECTION_3:
    ParentImage: '*\powershell.exe'
  SELECTION_4:
    OriginalFileName: csi.exe
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Possible depending on environment. Pair with other factors such as net connections,
  command-line args, etc.
id: a9e416a8-e613-4f8b-88b8-a7d1d1af2f61
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://redcanary.com/blog/detecting-attacks-leveraging-the-net-framework/
status: test
tags:
- attack.execution
- attack.t1127
