
title: Suspicious Diantz Alternate Data Stream Execution
ruletype: Sigma
author: frack113
date: 2021/11/26
description: Compress taget file into a cab file stored in the Alternate Data Stream
  (ADS) of the target file.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*diantz.exe*'
  SELECTION_3:
    CommandLine: '*.cab*'
  SELECTION_4:
    CommandLine|re: :[^\\\\]
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Very Possible
id: 6b369ced-4b1d-48f1-b427-fdc0de0790bd
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Diantz/
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
