
title: PsExec/PAExec Escalation to LOCAL SYSTEM
ruletype: Sigma
author: Florian Roth
date: 2021/11/23
description: Detects suspicious flags used by PsExec and PAExec to escalate a command
  line to LOCAL_SYSTEM rights
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*PsExec*'
    - '*PAExec*'
    - '*accepteula*'
    - '*cmd /c *'
  SELECTION_3:
    CommandLine: '* -s cmd.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance
  purposes (rare)
id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
status: experimental
tags:
- attack.develop_capabilities
- attack.t1587.001
