title: Suspicious VHD Image Download From Browser
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021/10/25
description: Malware can use mountable Virtual Hard Disk .vhd file to encapsulate
    payloads and evade security controls
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_10:
        TargetFilename: '*.vhd*'
    SELECTION_2:
        Image: '*chrome.exe'
    SELECTION_3:
        Image: '*firefox.exe'
    SELECTION_4:
        Image: '*microsoftedge.exe'
    SELECTION_5:
        Image: '*microsoftedgecp.exe'
    SELECTION_6:
        Image: '*msedge.exe'
    SELECTION_7:
        Image: '*iexplorer.exe'
    SELECTION_8:
        Image: '*brave.exe'
    SELECTION_9:
        Image: '*opera.exe'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9) and SELECTION_10)
falsepositives:
- Legitimate user creation
id: 8468111a-ef07-4654-903b-b863a80bbc95
level: medium
logsource:
    category: file_event
    definition: in sysmon add "<TargetFilename condition="end with">.vhd</TargetFilename>
        <!--vhd files for ZLoader and lazarus malware vectors -->"
    product: windows
modified: 2021/10/29
references:
- https://redcanary.com/blog/intelligence-insights-october-2021/
- https://www.kaspersky.com/blog/lazarus-vhd-ransomware/36559/
- https://securelist.com/lazarus-on-the-hunt-for-big-game/97757/
status: test
tags:
- attack.resource_development
- attack.t1587.001
yml_filename: file_event_mal_vhd_download.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/file_event

