title: Suspicious PowerShell Invocations - Generic
author: Florian Roth (rule)
date: 2017/03/12
description: Detects suspicious PowerShell invocation command parameters
detection:
    condition: (( -enc  or  -EncodedCommand ) and ( -w hidden  or  -window hidden  or  -windowstyle
        hidden ) and ( -noni  or  -noninteractive ))
falsepositives:
- Penetration tests
- Very special / sneaky PowerShell scripts
id: 3d304fda-78aa-43ed-975c-d740798a49c1
level: high
logsource:
    product: windows
    service: powershell
status: deprecated
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
yml_filename: powershell_suspicious_invocation_generic.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/deprecated

