title: Suspicious Run Key from Download
author: Florian Roth
date: 2019/10/01
description: Detects the suspicious RUN keys created by software located in Download
    or temporary Outlook/Internet Explorer directories
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        Image: '*\Downloads\\*'
    SELECTION_5:
        Image: '*\Temporary Internet Files\Content.Outlook\\*'
    SELECTION_6:
        Image: '*\Local Settings\Temporary Internet Files\\*'
    SELECTION_7:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\\*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 or SELECTION_5
        or SELECTION_6) and SELECTION_7)
falsepositives:
- Software installers downloaded and used by users
id: 9c5037d1-c568-49b3-88c7-9846a5bdc2be
level: high
logsource:
    category: registry_event
    product: windows
modified: 2020/09/06
references:
- https://app.any.run/tasks/c5bef5b7-f484-4c43-9cf3-d5c5c7839def/
status: experimental
tags:
- attack.persistence
- attack.t1060
- attack.t1547.001
yml_filename: sysmon_susp_download_run_key.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/registry_event

