title: SilentProcessExit Monitor Registrytion
author: Florian Roth
date: 2021/02/26
description: Detects changes to the Registry in which a monitor program gets registered
    to monitor the exit of another process
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        TargetObject: '*Microsoft\Windows NT\CurrentVersion\SilentProcessExit*'
    SELECTION_5:
        Details: '*MonitorProcess*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: c81fe886-cac0-4913-a511-2822d72ff505
level: high
logsource:
    category: registry_event
    product: windows
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
- https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
tags:
- attack.persistence
- attack.t1546.012
yml_filename: sysmon_reg_silentprocessexit.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/registry_event

