title: Disable PUA Protection on Windows Defender
author: Austin Songer @austinsonger
date: 2021/08/04
description: Detects disabling Windows Defender PUA protection
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*HKLM\SOFTWARE\Policies\Microsoft\Windows Defender\PUAProtection*'
    SELECTION_6:
        Details: DWORD (0x00000000)
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 8ffc5407-52e3-478f-9596-0a7371eafe13
level: high
logsource:
    category: registry_event
    product: windows
references:
- https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: sysmon_disabled_pua_protection_on_microsoft_defender.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/registry_event

