title: Remove Windows Defender Definition Files
author: frack113
date: 2021/07/07
description: Adversaries may disable security tools to avoid possible detection of
    their tools and activities by removing Windows Defender Definition Files
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        OriginalFileName: MpCmdRun.exe
    SELECTION_3:
        CommandLine: '* -RemoveDefinitions*'
    SELECTION_4:
        CommandLine: '* -All*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 9719a8aa-401c-41af-8108-ced7ec9cd75c
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
- https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: sysmon_remove_windows_defender_definition_files.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

