title: Abusing Azure Browser SSO
author: Den Iuzvyk
date: 2020/07/15
description: Detects abusing Azure Browser SSO by requesting OAuth 2.0 refresh tokens
    for an Azure-AD-authenticated Windows user (i.e. the machine is joined to Azure
    AD and a user logs in with their Azure AD account) wanting to perform SSO authentication
    in the browser. An attacker can use this to authenticate to Azure AD in a browser
    as that user.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        ImageLoaded: '*MicrosoftAccountTokenProvider.dll'
    SELECTION_3:
        Image: '*BackgroundTaskHost.exe'
    SELECTION_4:
        Image: '*devenv.exe'
    SELECTION_5:
        Image: '*iexplore.exe'
    SELECTION_6:
        Image: '*MicrosoftEdge.exe'
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3 or SELECTION_4
        or SELECTION_5 or SELECTION_6)))
falsepositives:
- unknown
id: 50f852e6-af22-4c78-9ede-42ef36aa3453
level: high
logsource:
    category: image_load
    product: windows
modified: 2020/12/23
references:
- https://posts.specterops.io/requesting-azure-ad-request-tokens-on-azure-ad-joined-machines-for-browser-sso-2b0409caad30
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1073
- attack.t1574.002
yml_filename: sysmon_abusing_azure_browser_sso.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/image_load

