title: Reg Disable Security Service
author: Florian Roth, John Lambert (idea)
date: 2021/07/14
description: Detects a suspicious reg.exe invocation that looks as if it would disable
    an important security service
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*\WdBoot *'
    SELECTION_11:
        CommandLine: '*\WdNisDrv*'
    SELECTION_12:
        CommandLine: '*\WdNisSvc*'
    SELECTION_13:
        CommandLine: '*\wscsvc *'
    SELECTION_14:
        CommandLine: '*\SecurityHealthService*'
    SELECTION_15:
        CommandLine: '*\wuauserv*'
    SELECTION_16:
        CommandLine: '*\UsoSvc *'
    SELECTION_2:
        CommandLine: '*reg*'
    SELECTION_3:
        CommandLine: '*add*'
    SELECTION_4:
        CommandLine: '* /d 4*'
    SELECTION_5:
        CommandLine: '* /v Start*'
    SELECTION_6:
        CommandLine: '*\Sense *'
    SELECTION_7:
        CommandLine: '*\WinDefend*'
    SELECTION_8:
        CommandLine: '*\MsMpSvc*'
    SELECTION_9:
        CommandLine: '*\NisSrv*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and (SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14 or SELECTION_15
        or SELECTION_16))
falsepositives:
- Unknown
- Other security solution installers
id: 5e95028c-5229-4214-afae-d653d573d0ec
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/JohnLaTwC/status/1415295021041979392
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: win_susp_reg_disable_sec_services.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

