title: Suspicious Child Process Created as System
author: Teymur Kheirkhabarov, Roberto Rodriguez (@Cyb3rWard0g), Open Threat Research
    (OTR)
date: 2019/10/26
description: Detection of child processes spawned with SYSTEM privileges by parents
    with LOCAL SERVICE or NETWORK SERVICE accounts
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        ParentUser: NT AUTHORITY\NETWORK SERVICE
    SELECTION_3:
        ParentUser: NT AUTHORITY\LOCAL SERVICE
    SELECTION_4:
        ParentUser: AUTORITE NT\
    SELECTION_5:
        User: NT AUTHORITY\SYSTEM
    SELECTION_6:
        User: AUTORITE NT\Sys
    SELECTION_7:
        IntegrityLevel: System
    SELECTION_8:
        Image: '*\rundll32.exe'
    SELECTION_9:
        CommandLine: '*DavSetCookie*'
    condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3 or SELECTION_4) and (SELECTION_5
        or SELECTION_6) and SELECTION_7) and  not (SELECTION_8 and SELECTION_9))
falsepositives:
- Unknown
id: 590a5f4c-6c8c-4f10-8307-89afe9453a9d
level: high
logsource:
    category: process_creation
    definition: ParentUser field needs sysmon >= 13.30
    product: windows
modified: 2020/10/26
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
- https://github.com/antonioCoco/RogueWinRM
- https://twitter.com/Cyb3rWard0g/status/1453123054243024897
status: experimental
tags:
- attack.privilege_escalation
- attack.t1134
- attack.t1134.002
yml_filename: win_susp_child_process_as_system_.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

