title: UNC2452 PowerShell Pattern
author: Florian Roth
date: 2021/01/20
description: Detects a specific PowerShell command line pattern used by the UNC2452
    actors as mentioned in Microsoft and Symantec reports
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*Invoke-WMIMethod win32_process -name create -argumentlist*'
    SELECTION_3:
        CommandLine: '*rundll32 c:\windows*'
    SELECTION_4:
        CommandLine: '*wmic /node:*'
    SELECTION_5:
        CommandLine: '*process call create "rundll32 c:\windows*'
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
        SELECTION_5)))
falsepositives:
- Unknown, unlikely, but possible
id: b7155193-8a81-4d8f-805d-88de864ca50c
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2021/01/22
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-raindrop-malware
- https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1047/T1047.md#atomic-test-7---create-a-process-using-wmi-query-and-an-encoded-command
tags:
- attack.execution
- attack.t1059.001
- attack.t1047
yml_filename: win_apt_unc2452_ps.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

