title: Addition of SID History to Active Directory Object
author: Thomas Patzke, @atc_project (improvements)
date: 2017/02/19
description: An attacker can use the SID history attribute to gain additional privileges.
detection:
    SELECTION_1:
        EventID: 4765
    SELECTION_2:
        EventID: 4766
    SELECTION_3:
        EventID: 4738
    SELECTION_4:
        SidHistory: '-'
    SELECTION_5:
        SidHistory: '%%1793'
    SELECTION_6:
        SidHistory|re: ^$
    condition: ((SELECTION_1 or SELECTION_2) or ((SELECTION_3 and  not ((SELECTION_4
        or SELECTION_5))) and  not (SELECTION_6)))
falsepositives:
- Migration of an account into a new domain
id: 2632954e-db1c-49cb-9936-67d1ef1d17d2
level: medium
logsource:
    product: windows
    service: security
references:
- https://adsecurity.org/?p=1772
status: stable
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1178
- attack.t1134.005
yml_filename: win_susp_add_sid_history.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

