title: Service Execution
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
date: 2019/10/21
description: Detects manual service execution (start) via system utilities.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\net.exe'
    SELECTION_3:
        Image: '*\net1.exe'
    SELECTION_4:
        CommandLine: '* start *'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Legitimate administrator or user executes a service for legitimate reasons.
id: 2a072a96-a086-49fa-bcb5-15cc5a619093
level: low
logsource:
    category: process_creation
    product: windows
modified: 2019/11/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1569.002/T1569.002.md
status: experimental
tags:
- attack.execution
- attack.t1035
- attack.t1569.002
yml_filename: win_service_execution.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

