title: Mimikatz Command Line
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
description: Detection well-known mimikatz command line arguments
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*lsadump*'
    SELECTION_11:
        CommandLine: '*privilege*'
    SELECTION_12:
        CommandLine: '*process*'
    SELECTION_13:
        CommandLine: '*::*'
    SELECTION_2:
        CommandLine: '*DumpCreds*'
    SELECTION_3:
        CommandLine: '*invoke-mimikatz*'
    SELECTION_4:
        CommandLine: '*rpc*'
    SELECTION_5:
        CommandLine: '*token*'
    SELECTION_6:
        CommandLine: '*crypto*'
    SELECTION_7:
        CommandLine: '*dpapi*'
    SELECTION_8:
        CommandLine: '*sekurlsa*'
    SELECTION_9:
        CommandLine: '*kerberos*'
    condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3) or ((SELECTION_4 or
        SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or
        SELECTION_10 or SELECTION_11 or SELECTION_12) and (SELECTION_13))))
falsepositives:
- Legitimate Administrator using tool for password recovery
id: a642964e-bead-4bed-8910-1bb4d63e3b4d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2020/09/01
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
- attack.t1003.006
yml_filename: win_mimikatz_command_line.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

