title: REvil Kaseya Incident Malware Patterns
author: Florian Roth
date: 2021/07/03
description: Detects process command line patterns and locations used by REvil group
    in Kaseya incident (can also match on other malware)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*c:\kworking1\agent.crt*'
    SELECTION_11:
        Image: C:\Windows\MsMpEng.exe
    SELECTION_12:
        Image: C:\Windows\cert.exe
    SELECTION_13:
        Image: C:\kworking\agent.exe
    SELECTION_14:
        Image: C:\kworking1\agent.exe
    SELECTION_2:
        CommandLine: '*C:\Windows\cert.exe*'
    SELECTION_3:
        CommandLine: '*Set-MpPreference -DisableRealtimeMonitoring $true -DisableIntrusionPreventionSystem
            $true -DisableIOAVProtection $true -DisableScriptScanning $true -EnableControlledFolderAccess
            Disabled -EnableNetworkProtection AuditMode -Force -MAPSReporting Disabled*'
    SELECTION_4:
        CommandLine: '*del /q /f c:\kworking\agent.crt*'
    SELECTION_5:
        CommandLine: '*Kaseya VSA Agent Hot-fix*'
    SELECTION_6:
        CommandLine: '*\AppData\Local\Temp\MsMpEng.exe*'
    SELECTION_7:
        CommandLine: '*rmdir /s /q %SystemDrive%\inetpub\logs*'
    SELECTION_8:
        CommandLine: '*del /s /q /f %SystemDrive%\\*.log*'
    SELECTION_9:
        CommandLine: '*c:\kworking1\agent.exe*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10)
        and (SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14))
falsepositives:
- Unknown
id: 5de632bc-7fbd-4c8a-944a-fce55c59eae5
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2021/07/05
references:
- https://community.sophos.com/b/security-blog/posts/active-ransomware-attack-on-kaseya-customers
- https://www.joesandbox.com/analysis/443736/0/html
- https://doublepulsar.com/kaseya-supply-chain-attack-delivers-mass-ransomware-event-to-us-companies-76e4ec6ec64b
- https://therecord.media/revil-ransomware-executes-supply-chain-attack-via-malicious-kaseya-update/
- https://blog.truesec.com/2021/07/04/kaseya-supply-chain-attack-targeting-msps-to-deliver-revil-ransomware/
status: experimental
tags:
- attack.execution
- attack.g0115
yml_filename: win_apt_revil_kaseya.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

