title: NetNTLM Downgrade Attack
author: Florian Roth, wagga
date: 2018/03/20
description: Detects NetNTLM downgrade attack
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        ObjectName: '*\REGISTRY\MACHINE\SYSTEM*'
    SELECTION_3:
        ObjectName: '*ControlSet*'
    SELECTION_4:
        ObjectName: '*\Control\Lsa*'
    SELECTION_5:
        ObjectValueName: LmCompatibilityLevel
    SELECTION_6:
        ObjectValueName: NtlmMinClientSec
    SELECTION_7:
        ObjectValueName: RestrictSendingNTLMTraffic
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and (SELECTION_5
        or SELECTION_6 or SELECTION_7))
falsepositives:
- Unknown
id: d3abac66-f11c-4ed0-8acb-50cc29c97eed
level: critical
logsource:
    definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
    product: windows
    service: security
modified: 2021/06/27
references:
- https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
related:
-   id: d67572a0-e2ec-45d6-b8db-c100d14b8ef2
    type: derived
tags:
- attack.defense_evasion
- attack.t1089
- attack.t1562.001
- attack.t1112
yml_filename: win_net_ntlm_downgrade.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

