title: AD Privileged Users or Groups Reconnaissance
author: Samir Bousseaden
date: 2019/04/03
description: Detect priv users or groups recon based on 4661 eventid and known privileged
    users or groups SIDs
detection:
    SELECTION_1:
        EventID: 4661
    SELECTION_10:
        ObjectName: '*-544'
    SELECTION_11:
        ObjectName: '*-551'
    SELECTION_12:
        ObjectName: '*-555'
    SELECTION_13:
        ObjectName: '*admin*'
    SELECTION_2:
        ObjectType: SAM_USER
    SELECTION_3:
        ObjectType: SAM_GROUP
    SELECTION_4:
        ObjectName: '*-512'
    SELECTION_5:
        ObjectName: '*-502'
    SELECTION_6:
        ObjectName: '*-500'
    SELECTION_7:
        ObjectName: '*-505'
    SELECTION_8:
        ObjectName: '*-519'
    SELECTION_9:
        ObjectName: '*-520'
    condition: ((SELECTION_1 and (SELECTION_2 or SELECTION_3)) and ((SELECTION_4 or
        SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or
        SELECTION_10 or SELECTION_11 or SELECTION_12) or SELECTION_13))
falsepositives:
- if source account name is not an admin then its super suspicious
id: 35ba1d85-724d-42a3-889f-2e2362bcaf23
level: high
logsource:
    definition: 'Requirements: enable Object Access SAM on your Domain Controllers'
    product: windows
    service: security
modified: 2021/09/08
references:
- https://blog.menasec.net/2019/02/threat-hunting-5-detecting-enumeration.html
status: experimental
tags:
- attack.discovery
- attack.t1087
- attack.t1087.002
yml_filename: win_account_discovery.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/builtin

