title: TAIDOOR RAT DLL Load
author: Florian Roth
date: 2020/07/30
description: Detects specific process characteristics of Chinese TAIDOOR RAT malware
    load
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*dll,MyStart*'
    SELECTION_3:
        CommandLine: '*dll MyStart*'
    SELECTION_4:
        EventID: 1
    SELECTION_5:
        CommandLine: '* MyStart'
    SELECTION_6:
        CommandLine: '*rundll32.exe*'
    condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3) or (SELECTION_4 and
        (SELECTION_5) and (SELECTION_6))))
falsepositives:
- Unknown
id: d1aa3382-abab-446f-96ea-4de52908210b
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://us-cert.cisa.gov/ncas/analysis-reports/ar20-216a
status: experimental
tags:
- attack.execution
- attack.t1055
- attack.t1055.001
yml_filename: win_apt_taidoor.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

