title: Suspicious WMI Execution Using Rundll32
author: Florian Roth
date: 2020/10/12
description: Detects WMI executing rundll32
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*process call create*'
    SELECTION_3:
        CommandLine: '*rundll32*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://thedfirreport.com/2020/10/08/ryuks-return/
status: experimental
tags:
- attack.execution
- attack.t1047
yml_filename: win_susp_wmic_proc_create_rundll32.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

