title: Wmiprvse Spawning Process
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/15
description: Detects wmiprvse spawning processes
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        ParentImage: '*\WmiPrvSe.exe'
    SELECTION_3:
        LogonId: '0x3e7'
    SELECTION_4:
        LogonId: 'null'
    SELECTION_5:
        User: NT AUTHORITY\SYSTEM*
    SELECTION_6:
        User: AUTORITE NT\Sys*
    SELECTION_7:
        Image: '*\WmiPrvSE.exe'
    SELECTION_8:
        Image: '*\WerFault.exe'
    SELECTION_9:
        LogonId|re: ^$
    condition: (SELECTION_1 and (SELECTION_2 and  not ((SELECTION_3 or SELECTION_4)
        or (SELECTION_5 or SELECTION_6) or (SELECTION_7 or SELECTION_8))) and  not
        (SELECTION_9))
falsepositives:
- Unknown
id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/10
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190810201010.html
status: experimental
tags:
- attack.execution
- attack.t1047
yml_filename: win_wmiprvse_spawning_process.yml
yml_path: /Users/user/Documents/YamatoSecurity/sigma/rules/windows/process_creation

