author: Zach Mathis
date: 2021/12/11
modified: 2021/12/11

title: Process Creation Sysmon Rule Alert
title_jp: プロセス起動 - Sysmonルールアラート
output: 'Rule: %RuleName%  :  Command: %CommandLine%  :  Path: %Image%  :  User: %User%  :  Parent Command: %ParentCommandLine%'
output_jp: 'ルール: %RuleName%  :  コマンド: %CommandLine%  :  パス: %Image%  :  ユーザ: %User%  :  親コマンド: %ParentCommandLine%'
description: Sysmon process creation
description_jp: Sysmonログによるプロセス起動のログ

id: d5e4fb89-b027-43bf-bd3a-2e7f74f105ac
level: high
status: stable
detection:
    selection:
        Channel: Microsoft-Windows-Sysmon/Operational
        EventID: 1
    filter:
        - RuleName: ""
        - RuleName: "-"
    condition: selection and not filter
falsepositives:
    - bad sysmon rule
tags:
references:
sample-evtx: 
logsource: sysmon
ruletype: Hayabusa