
title: CobaltStrike Process Injection
ruletype: Sigma
author: Olaf Hartong, Florian Roth, Aleksey Potapov, oscd.community
date: 2018/11/30
description: Detects a possible remote threat creation with certain characteristics
  which are typical for Cobalt Strike beacons
detection:
  SELECTION_1:
    EventID: 8
  SELECTION_2:
    StartAddress:
    - '*0B80'
    - '*0C7C'
    - '*0C88'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- unknown
id: 6309645e-122d-4c5b-bb2b-22e4f9c2fa42
level: high
logsource:
  category: create_remote_thread
  product: windows
modified: 2021/11/20
references:
- https://medium.com/@olafhartong/cobalt-strike-remote-threads-detection-206372d11d0f
- https://blog.cobaltstrike.com/2018/04/09/cobalt-strike-3-11-the-snake-that-eats-its-tail/
status: experimental
tags:
- attack.defense_evasion
- attack.t1055
- attack.t1055.001
