title: Lolbins Process Creation with WmiPrvse
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: This rule will monitor LOLBin process creations by wmiprvse. Add more
    LOLBins to rule logic if needed.
detection:
    SELECTION_1:
        Image: '*regsvr32'
    SELECTION_2:
        Image: '*rundll32'
    SELECTION_3:
        Image: '*msiexec'
    SELECTION_4:
        Image: '*mshta'
    SELECTION_5:
        Image: '*verclsid'
    SELECTION_6:
        ParentImage: '*\wbem\WmiPrvSE.exe'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5)
        and SELECTION_6)
falsepositives:
- Unknown
id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
level: high
logsource:
    category: process_creation
    product: Windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
yml_filename: process_creation_lolbins_with_wmiprvse_parent_process.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

