title: PsExec Tool Execution
author: Thomas Patzke
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
    Sysmon)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\PSEXESVC.exe'
    SELECTION_3:
        User: NT AUTHORITY\SYSTEM*
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- unknown
fields:
- EventID
- CommandLine
- ParentCommandLine
- ServiceName
- ServiceFileName
- TargetFilename
- PipeName
id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
level: low
logsource:
    category: process_creation
    product: windows
modified: 2021/09/21
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
related:
-   id: 42c575ea-e41e-41f1-b248-8093c3e82a28
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1035
- attack.t1569.002
- attack.s0029
yml_filename: process_creation_tool_psexec.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

