title: Sysinternals SDelete Delete File
author: frack113
date: 2021/06/03
description: Use of SDelete to erase a file not the free space
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        OriginalFileName: sdelete.exe
    SELECTION_3:
        CommandLine: '* -h*'
    SELECTION_4:
        CommandLine: '* -c*'
    SELECTION_5:
        CommandLine: '* -z*'
    SELECTION_6:
        CommandLine: '* /?*'
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3 or SELECTION_4
        or SELECTION_5 or SELECTION_6)))
falsepositives:
- System administrator Usage
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: a4824fca-976f-4964-b334-0621379e84c4
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.md
status: experimental
tags:
- attack.impact
- attack.t1485
yml_filename: process_creation_sdelete.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

