title: Discover Private Keys
author: frack113
date: 2021/07/20
description: Adversaries may search for private key certificate files on compromised
    systems for insecurely stored credential
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*.pfx*'
    SELECTION_11:
        CommandLine: '*.cer*'
    SELECTION_12:
        CommandLine: '*.p7b*'
    SELECTION_13:
        CommandLine: '*.asc*'
    SELECTION_2:
        CommandLine: '*dir *'
    SELECTION_3:
        CommandLine: '*findstr *'
    SELECTION_4:
        CommandLine: '*.key*'
    SELECTION_5:
        CommandLine: '*.pgp*'
    SELECTION_6:
        CommandLine: '*.gpg*'
    SELECTION_7:
        CommandLine: '*.ppk*'
    SELECTION_8:
        CommandLine: '*.p12*'
    SELECTION_9:
        CommandLine: '*.pem*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and (SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13))
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 213d6a77-3d55-4ce8-ba74-fcfef741974e
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1552.004/T1552.004.md
status: experimental
tags:
- attack.credential_access
- attack.t1552.004
yml_filename: process_creation_discover_private_keys.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

