
title: Excel Proxy Executing Regsvr32 With Payload
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: Excel called wmic to finally proxy execute regsvr32 with the payload.
  An attacker wanted to break suspicious parent-child chain (Office app spawns LOLBin).But
  we have command-line in the event which allow us to "restore" this suspicious parent-child
  chain and detect it. Monitor process creation with "wmic process call create" and
  LOLBins in command-line with parent Office application processes.
detection:
  SELECTION_1:
    ProcessCommandLine:
    - '*regsvr32*'
    - '*rundll32*'
    - '*msiexec*'
    - '*mshta*'
    - '*verclsid*'
  SELECTION_2:
    Image: '*\wbem\WMIC.exe'
  SELECTION_3:
    ProcessCommandLine: '*wmic *'
  SELECTION_4:
    ParentImage:
    - '*winword.exe'
    - '*excel.exe'
    - '*powerpnt.exe'
  SELECTION_5:
    processCommandLine: '*process*'
  SELECTION_6:
    processCommandLine: '*create*'
  SELECTION_7:
    processCommandLine: '*call*'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: c0e1c3d5-4381-4f18-8145-2583f06a1fe5
level: high
logsource:
  category: process_creation
  product: Windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
