title: Dotnet.exe Exec Dll and Execute Unsigned Code LOLBIN
author: Beyu Denis, oscd.community
date: 2020/10/18
description: dotnet.exe will execute any DLL and execute unsigned code
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*.dll'
    SELECTION_3:
        CommandLine: '*.csproj'
    SELECTION_4:
        Image: '*\dotnet.exe'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and (SELECTION_4))
falsepositives:
- System administrator Usage
- Penetration test
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: d80d5c81-04ba-45b4-84e4-92eba40e0ad3
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Dotnet.yml
- https://twitter.com/_felamos/status/1204705548668555264
- https://bohops.com/2019/08/19/dotnet-core-a-vector-for-awl-bypass-defense-evasion/
status: experimental
tags:
- attack.execution
- attack.t1218
yml_filename: process_creation_dotnet.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

