
title: Abusable Invoke-ATHRemoteFXvGPUDisablementCommand
author: frack113
date: 2021/07/13
description: RemoteFXvGPUDisablement.exe is an abusable, signed PowerShell host executable
  that was introduced in Windows 10 and Server 2019 (OS Build 17763.1339).
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*Invoke-ATHRemoteFXvGPUDisablementCommand *'
  SELECTION_3:
    CommandLine:
    - '*-ModuleName *'
    - '*-ModulePath *'
    - '*-ScriptBlock *'
    - '*-RemoteFXvGPUDisablementFilePath*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: a6fc3c46-23b8-4996-9ea2-573f4c4d88c5
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/07
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
related:
- id: 38a7625e-b2cb-485d-b83d-aff137d859f4
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
