
title: Proxy Execution via Wuauclt
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), Florian Roth
date: 2020/10/12
description: Detects the use of the Windows Update Client binary (wuauclt.exe) to
  proxy execute code.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*wuauclt*'
  SELECTION_3:
    OriginalFileName: wuauclt.exe
  SELECTION_4:
    CommandLine: '*UpdateDeploymentProvider*'
  SELECTION_5:
    CommandLine: '*.dll*'
  SELECTION_6:
    CommandLine: '*RunHandlerComServer*'
  SELECTION_7:
    CommandLine:
    - '* /UpdateDeploymentProvider UpdateDeploymentProvider.dll *'
    - '* wuaueng.dll *'
  condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3) and (SELECTION_4 and SELECTION_5
    and SELECTION_6)) and  not (SELECTION_7))
falsepositives:
- Unknown
id: af77cf95-c469-471c-b6a0-946c685c4798
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/05/10
references:
- https://dtm.uk/wuauclt/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
