title: Suspicious MsiExec Directory
author: Florian Roth
date: 2019/11/14
description: Detects suspicious msiexec process starts in an uncommon directory
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\msiexec.exe'
    SELECTION_3:
        Image: C:\Windows\System32\\*
    SELECTION_4:
        Image: C:\Windows\SysWOW64\\*
    SELECTION_5:
        Image: C:\Windows\WinSxS\\*
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3 or SELECTION_4
        or SELECTION_5)))
falsepositives:
- Unknown
id: e22a6eb2-f8a5-44b5-8b44-a2dbd47b1144
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/200_okay_/status/1194765831911215104
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.005
- attack.t1036
yml_filename: win_susp_msiexec_cwd.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

