title: UAC Bypass Abusing Winsat Path Parsing - Process
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
    (UACMe 52)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        IntegrityLevel: High
    SELECTION_3:
        IntegrityLevel: System
    SELECTION_4:
        ParentImage: '*\AppData\Local\Temp\system32\winsat.exe'
    SELECTION_5:
        ParentCommandLine: '*C:\Windows \system32\winsat.exe*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 7a01183d-71a2-46ad-ad5c-acd989ac1793
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
yml_filename: win_uac_bypass_winsat.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

