title: Suspicious Parent of Csc.exe
author: Florian Roth
date: 2019/02/11
description: Detects a suspicious parent of csc.exe, which could by a sign of payload
    delivery
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\csc.exe'
    SELECTION_3:
        ParentImage: '*\wscript.exe'
    SELECTION_4:
        ParentImage: '*\cscript.exe'
    SELECTION_5:
        ParentImage: '*\mshta.exe'
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
id: b730a276-6b63-41b8-bcf8-55930c8fc6ee
level: high
logsource:
    category: process_creation
    product: windows
modified: 2020/11/28
references:
- https://twitter.com/SBousseaden/status/1094924091256176641
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
- attack.defense_evasion
- attack.t1500
- attack.t1218.005
- attack.t1027.004
yml_filename: win_susp_csc.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

