title: Disable or Delete Windows Eventlog
author: Florian Roth
date: 2021/02/11
description: Detects command that is used to disable or delete Windows eventlog via
    logman Windows utility
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*logman *'
    SELECTION_3:
        CommandLine: '*stop *'
    SELECTION_4:
        CommandLine: '*delete *'
    SELECTION_5:
        CommandLine: '*EventLog-System*'
    condition: (SELECTION_1 and (SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5))
falsepositives:
- Legitimate deactivation by administrative staff
- Installer tools that disable services, e.g. before log collection agent installation
id: cd1f961e-0b96-436b-b7c6-38da4583ec00
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/06/21
references:
- https://twitter.com/0gtweet/status/1359039665232306183?s=21
- https://ss64.com/nt/logman.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
- attack.t1070.001
yml_filename: win_susp_disable_eventlog.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

