title: Turla Group Commands May 2020
author: Florian Roth
date: 2020/05/26
description: Detects commands used by Turla group as reported by ESET in May 2020
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*tracert -h 10 yahoo.com*'
    SELECTION_3:
        CommandLine: '*.WSqmCons))|iex;*'
    SELECTION_4:
        CommandLine: '*Fr`omBa`se6`4Str`ing*'
    SELECTION_5:
        CommandLine: '*net use https://docs.live.net*'
    SELECTION_6:
        CommandLine: '*@aol.co.uk*'
    condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3 or SELECTION_4) or (SELECTION_5
        and SELECTION_6)))
falsepositives:
- Unknown
id: 9e2e51c5-c699-4794-ba5a-29f5da40ac0c
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2020/08/27
references:
- https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf
status: experimental
tags:
- attack.g0010
- attack.execution
- attack.t1086
- attack.t1059.001
- attack.t1053
- attack.t1053.005
- attack.t1027
yml_filename: win_apt_turla_comrat_may20.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

