title: Suspicious Userinit Child Process
author: Florian Roth (rule), Samir Bousseaden (idea)
date: 2019/06/17
description: Detects a suspicious child process of userinit
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        ParentImage: '*\userinit.exe'
    SELECTION_3:
        CommandLine: '*\netlogon\\*'
    SELECTION_4:
        Image: '*\explorer.exe'
    condition: (SELECTION_1 and (SELECTION_2 and  not (SELECTION_3)) and  not (SELECTION_4))
falsepositives:
- Administrative scripts
fields:
- CommandLine
- ParentCommandLine
id: b655a06a-31c0-477a-95c2-3726b83d649d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/06/27
references:
- https://twitter.com/SBousseaden/status/1139811587760562176
status: experimental
tags:
- attack.defense_evasion
- attack.t1055
yml_filename: win_susp_userinit_child.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

