
title: CrackMapExec Command Execution
author: Thomas Patzke
date: 2020/05/22
description: Detect various execution methods of the CrackMapExec pentesting framework
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*cmd.exe /Q /c * 1> \\\\*\\*\\* 2>&1'
    - '*cmd.exe /C * > \\\\*\\*\\* 2>&1'
    - '*cmd.exe /C * > *\\Temp\\* 2>&1'
  SELECTION_3:
    CommandLine:
    - '*powershell.exe -exec bypass -noni -nop -w 1 -C "*'
    - '*powershell.exe -noni -nop -w 1 -enc *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
id: 058f4380-962d-40a5-afce-50207d36d7e2
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/byt3bl33d3r/CrackMapExec
status: stable
tags:
- attack.execution
- attack.t1047
- attack.t1053
- attack.t1059.003
- attack.t1059.001
- attack.s0106
- attack.t1086
