title: Empire PowerShell UAC Bypass
author: Ecco
date: 2019/08/30
description: Detects some Empire PowerShell UAC bypass methods
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '* -NoP -NonI -w Hidden -c $x=$((gp HKCU:Software\\Microsoft\\Windows
            Update).Update)*'
    SELECTION_3:
        CommandLine: '* -NoP -NonI -c $x=$((gp HKCU:Software\\Microsoft\\Windows Update).Update);*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- unknown
fields:
- CommandLine
- ParentCommandLine
id: 3268b746-88d8-4cd3-bffc-30077d02c787
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-EventVwrBypass.ps1#L64
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-FodHelperBypass.ps1#L64
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- attack.t1088
- car.2019-04-001
yml_filename: win_susp_powershell_empire_uac_bypass.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

