
title: TrustedPath UAC Bypass Pattern
author: Florian Roth
date: 2021/08/27
description: Detects indicators of a UAC bypass method by mocking directories
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*C:\Windows \System32\\*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 4ac47ed3-44c2-4b1f-9d51-bf46e8914126
level: critical
logsource:
  category: process_creation
  product: windows
references:
- https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e
- https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
- https://github.com/netero1010/TrustedPath-UACBypass-BOF
status: experimental
tags:
- attack.defense_evasion
- attack.t1548.002
