
title: Application Whitelisting Bypass via Dnx.exe
author: Beyu Denis, oscd.community
date: 2019/10/26
description: Execute C# code located in the consoleapp folder
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\dnx.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate use of dnx.exe by legitimate user
id: 81ebd28b-9607-4478-bf06-974ed9d53ed7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/30
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Csi.yml
- https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1027.004
- attack.execution
