title: CrackMapExec Command Execution
author: Thomas Patzke
date: 2020/05/22
description: Detect various execution methods of the CrackMapExec pentesting framework
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*cmd.exe /Q /c * 1> \\\\*\\*\\* 2>&1'
    SELECTION_3:
        CommandLine: '*cmd.exe /C * > \\\\*\\*\\* 2>&1'
    SELECTION_4:
        CommandLine: '*cmd.exe /C * > *\\Temp\\* 2>&1'
    SELECTION_5:
        CommandLine: '*powershell.exe -exec bypass -noni -nop -w 1 -C "*'
    SELECTION_6:
        CommandLine: '*powershell.exe -noni -nop -w 1 -enc *'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4) and (SELECTION_5
        or SELECTION_6))
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
id: 058f4380-962d-40a5-afce-50207d36d7e2
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/byt3bl33d3r/CrackMapExec
status: stable
tags:
- attack.execution
- attack.t1047
- attack.t1053
- attack.t1059.003
- attack.t1059.001
- attack.s0106
- attack.t1086
yml_filename: win_susp_crackmapexec_execution.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

