title: Suspicious MSHTA Process Patterns
author: Florian Roth
date: 2021/07/17
description: Detects suspicious mshta process patterns
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*.htm*'
    SELECTION_11:
        CommandLine: '*.hta*'
    SELECTION_12:
        CommandLine: '*mshta.exe'
    SELECTION_13:
        CommandLine: '*mshta'
    SELECTION_2:
        Image: '*\mshta.exe'
    SELECTION_3:
        ParentImage: '*\cmd.exe'
    SELECTION_4:
        ParentImage: '*\powershell.exe'
    SELECTION_5:
        CommandLine: '*\AppData\Local*'
    SELECTION_6:
        CommandLine: '*C:\Windows\Temp*'
    SELECTION_7:
        CommandLine: '*C:\Users\Public*'
    SELECTION_8:
        Image: '*C:\Windows\System32*'
    SELECTION_9:
        Image: '*C:\Windows\SysWOW64*'
    condition: (SELECTION_1 and SELECTION_2 and ((((SELECTION_3 or SELECTION_4) or
        (SELECTION_5 or SELECTION_6 or SELECTION_7)) or  not ((SELECTION_8 or SELECTION_9)))
        or  not ((SELECTION_10 or SELECTION_11) and (SELECTION_12 or SELECTION_13))))
falsepositives:
- Unknown
id: e32f92d1-523e-49c3-9374-bdb13b46a3ba
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://en.wikipedia.org/wiki/HTML_Application
- https://www.echotrail.io/insights/search/mshta.exe
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
status: experimental
tags:
- attack.execution
yml_filename: win_susp_mshta_pattern.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

