
title: Run PowerShell Script from Redirected Input Stream
author: Moriarty Meng (idea), Anton Kutepov (rule), oscd.community
date: 2020/10/17
description: Detects PowerShell script execution via input stream redirect
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\powershell.exe'
  SELECTION_3:
    CommandLine|re: \s-\s*<
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: c83bf4b5-cdf0-437c-90fa-43d734f7c476
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OSBinaries/Powershell.yml
- https://twitter.com/Moriarty_Meng/status/984380793383370752
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
