
title: UAC Bypass Using Windows Media Player - Process
author: Christian Burkard
date: 2021/08/23
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
  (UACMe 32)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    IntegrityLevel:
    - High
    - System
  SELECTION_3:
    Image: C:\Program Files\Windows Media Player\osk.exe
  SELECTION_4:
    Image: C:\Windows\System32\cmd.exe
  SELECTION_5:
    ParentCommandLine: '"C:\Windows\system32\mmc.exe" "C:\Windows\system32\eventvwr.msc"
      /s'
  condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or (SELECTION_4 and SELECTION_5)))
falsepositives:
- Unknown
id: 0058b9e5-bcd7-40d4-9205-95ca5a16d7b2
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
