title: WMI Backdoor Exchange Transport Agent
author: Florian Roth
date: 2019/10/11
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        ParentImage: '*\EdgeTransport.exe'
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/cglyer/status/1182389676876980224
- https://twitter.com/cglyer/status/1182391019633029120
status: experimental
tags:
- attack.persistence
- attack.t1546.003
- attack.t1084
yml_filename: win_wmi_backdoor_exchange_transport_agent.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

