title: Suspicious SYSVOL Domain Group Policy Access
author: Markus Neis, Jonhnathan Ribeiro, oscd.community
date: 2018/04/09
description: Detects Access to Domain Group Policies stored in SYSVOL
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*\SYSVOL\\*'
    SELECTION_3:
        CommandLine: '*\policies\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- administrative activity
id: 05f3c945-dcc8-4393-9f3d-af65077a8f86
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2020/11/28
references:
- https://adsecurity.org/?p=2288
- https://www.hybrid-analysis.com/sample/f2943f5e45befa52fb12748ca7171d30096e1d4fc3c365561497c618341299d5?environmentId=100
status: experimental
tags:
- attack.credential_access
- attack.t1552.006
- attack.t1003
yml_filename: win_susp_sysvol_access.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

