title: ZxShell Malware
author: Florian Roth, oscd.community, Jonhnathan Ribeiro
date: 2017/07/20
description: Detects a ZxShell start by the called and well-known function name
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\rundll32.exe'
    SELECTION_3:
        CommandLine: '*zxFunction*'
    SELECTION_4:
        CommandLine: '*RemoteDiskXXXXX*'
    condition: (SELECTION_1 and (SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unlikely
fields:
- CommandLine
- ParentCommandLine
id: f0b70adb-0075-43b0-9745-e82a1c608fcc
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2020/08/26
references:
- https://www.hybrid-analysis.com/sample/5d2a4cde9fa7c2fdbf39b2e2ffd23378d0c50701a3095d1e91e3cf922d7b0b16?environmentId=100
tags:
- attack.execution
- attack.t1059.003
- attack.t1059
- attack.defense_evasion
- attack.t1218.011
- attack.t1085
- attack.s0412
- attack.g0001
yml_filename: win_apt_zxshell.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

