
title: MMC Spawning Windows Shell
author: Karneades, Swisscom CSIRT
date: 2019/08/05
description: Detects a Windows command line executable started from MMC
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage: '*\mmc.exe'
  SELECTION_3:
    Image:
    - '*\cmd.exe'
    - '*\powershell.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\reg.exe'
    - '*\regsvr32.exe'
  SELECTION_4:
    Image:
    - '*\BITSADMIN*'
  condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4))
fields:
- CommandLine
- Image
- ParentCommandLine
id: 05a2ab7e-ce11-4b63-86db-ab32e763e11d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
references:
- https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
status: experimental
tags:
- attack.lateral_movement
- attack.t1175
- attack.t1021.003
