title: Malicious Windows Script Components File Execution by TAEF Detection
author: Agro (@agro_sev) oscd.community
date: 2020/10/13
description: Windows Test Authoring and Execution Framework (TAEF) framework allows
    you to run automation by executing tests files written on different languages
    (C, C#, Microsoft COM Scripting interfaces). Adversaries may execute malicious
    code (such as WSC file with VBScript, dll and so on) directly by running te.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\te.exe'
    SELECTION_3:
        ParentImage: '*\te.exe'
    SELECTION_4:
        OriginalFileName: \te.exe
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4))
falsepositives:
- It's not an uncommon to use te.exe directly to execute legal TAEF tests
id: 634b00d5-ccc3-4a06-ae3b-0ec8444dd51b
level: low
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Te.yml
- https://twitter.com/pabraeken/status/993298228840992768
- https://docs.microsoft.com/en-us/windows-hardware/drivers/taef/
status: experimental
tags:
- attack.t1218
yml_filename: win_susp_use_of_te_bin.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

