
title: SILENTTRINITY Stager Execution
author: Aleksey Potapov, oscd.community
date: 2019/10/22
description: Detects SILENTTRINITY stager use
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Description: '*st2stager*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- unknown
id: 03552375-cc2c-4883-bbe4-7958d5a980be
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
references:
- https://github.com/byt3bl33d3r/SILENTTRINITY
status: experimental
tags:
- attack.command_and_control
