title: UAC Bypass Using ComputerDefaults
author: Christian Burkard
date: 2021/08/31
description: Detects the pattern of UAC Bypass using computerdefaults.exe (UACMe 59)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        IntegrityLevel: High
    SELECTION_3:
        IntegrityLevel: System
    SELECTION_4:
        Image: C:\Windows\System32\ComputerDefaults.exe
    SELECTION_5:
        ParentImage: '*:\Windows\System32*'
    SELECTION_6:
        ParentImage: '*:\Program Files*'
    condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3) and SELECTION_4) and  not
        ((SELECTION_5 or SELECTION_6)))
falsepositives:
- Unknown
id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
yml_filename: win_uac_bypass_computerdefaults.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

