title: Suspicious Process Start Locations
author: juju4, Jonhnathan Ribeiro, oscd.community
date: 2019/01/16
description: Detects suspicious process run from unusual locations
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        Image: C:\Windows\cursors\\*
    SELECTION_11:
        Image: C:\Windows\system32\tasks\\*
    SELECTION_2:
        Image: '*:\RECYCLER\\*'
    SELECTION_3:
        Image: '*:\SystemVolumeInformation\\*'
    SELECTION_4:
        Image: C:\Windows\Tasks\\*
    SELECTION_5:
        Image: C:\Windows\debug\\*
    SELECTION_6:
        Image: C:\Windows\fonts\\*
    SELECTION_7:
        Image: C:\Windows\help\\*
    SELECTION_8:
        Image: C:\Windows\drivers\\*
    SELECTION_9:
        Image: C:\Windows\addins\\*
    condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3) or (SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11)))
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
    environment
id: 15b75071-74cc-47e0-b4c6-b43744a62a2b
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2020/11/28
references:
- https://car.mitre.org/wiki/CAR-2013-05-002
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- car.2013-05-002
yml_filename: win_susp_run_locations.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

