title: Empire PowerShell Launch Parameters
author: Florian Roth
date: 2019/04/20
description: Detects suspicious powershell command line parameters used in Empire
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '* -NoP -sta -NonI -W Hidden -Enc *'
    SELECTION_3:
        CommandLine: '* -noP -sta -w 1 -enc *'
    SELECTION_4:
        CommandLine: '* -NoP -NonI -W Hidden -enc *'
    SELECTION_5:
        CommandLine: '* -noP -sta -w 1 -enc*'
    SELECTION_6:
        CommandLine: '* -enc  SQB*'
    SELECTION_7:
        CommandLine: '* -nop -exec bypass -EncodedCommand *'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7))
falsepositives:
- Other tools that incidentally use the same command line parameters
id: 79f4ede3-402e-41c8-bc3e-ebbf5f162581
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2020/07/20
references:
- https://github.com/EmpireProject/Empire/blob/c2ba61ca8d2031dad0cfc1d5770ba723e8b710db/lib/common/helpers.py#L165
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/lib/modules/powershell/persistence/powerbreach/deaduser.py#L191
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/lib/modules/powershell/persistence/powerbreach/resolver.py#L178
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-EventVwrBypass.ps1#L64
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
yml_filename: win_susp_powershell_empire_launch.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

