title: Suspicious RASdial Activity
author: juju4
date: 2019/01/16
description: Detects suspicious process related to rasdial.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*rasdial.exe'
    condition: (SELECTION_1 and (SELECTION_2))
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
    environment
id: 6bba49bf-7f8c-47d6-a1bb-6b4dece4640e
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/subTee/status/891298217907830785
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
- attack.t1064
yml_filename: win_susp_rasdial_activity.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

