
title: Wsreset UAC Bypass
author: Florian Roth
date: 2020/01/30
description: Detects a method that uses Wsreset.exe tool that can be used to reset
  the Windows Store to bypass UAC
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage:
    - '*\WSreset.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown sub processes of Wsreset.exe
fields:
- CommandLine
id: bdc8918e-a1d5-49d1-9db7-ea0fd91aa2ae
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
references:
- https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
- https://www.activecyber.us/activelabs/windows-uac-bypass
- https://twitter.com/ReaQta/status/1222548288731217921
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
- attack.t1088
