title: Run Whoami Showing Privileges
author: Florian Roth
date: 2021/05/05
description: Detects a whoami.exe executed with the /priv command line flag instructing
    the tool to show all current user privieleges. This is often used after a privilege
    escalation attempt.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\whoami.exe'
    SELECTION_3:
        CommandLine: '*/priv*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Administrative activity (rare lookups on current privileges)
id: 97a80ec7-0e2f-4d05-9ef4-65760e634f6b
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
status: experimental
tags:
- attack.privilege_escalation
- attack.discovery
- attack.t1033
yml_filename: win_whoami_priv.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

