
title: Invoke-Obfuscation Obfuscated IEX Invocation
author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the following code block — https://github.com/danielbohannon/Invoke-Obfuscation/blob/master/Out-ObfuscatedStringCommand.ps1#L873-L888
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  SELECTION_3:
    CommandLine|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  SELECTION_4:
    CommandLine|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  SELECTION_5:
    CommandLine|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  SELECTION_6:
    CommandLine|re: \\\\*mdr\\\\*\W\s*\)\.Name
  SELECTION_7:
    CommandLine|re: \$VerbosePreference\.ToString\(
  SELECTION_8:
    CommandLine|re: \\\\String\]\s*\$VerbosePreference
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
    or SELECTION_6 or SELECTION_7 or SELECTION_8))
falsepositives:
- Unknown
id: 4bf943c6-5146-4273-98dd-e958fd1e3abf
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
- attack.t1086
