title: Regsvr32 Command Line Without DLL
author: Florian Roth
date: 2019/07/17
description: Detects a regsvr.exe execution that doesn't contain a DLL in the command
    line
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\regsvr32.exe'
    SELECTION_3:
        CommandLine: '*.dll*'
    SELECTION_4:
        CommandLine: '*.ocx*'
    SELECTION_5:
        CommandLine: '*.cpl*'
    SELECTION_6:
        CommandLine: '*.ax*'
    SELECTION_7:
        CommandLine: '*.bav*'
    SELECTION_8:
        CommandLine: '*.ppl*'
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3 or SELECTION_4
        or SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8)))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 50919691-7302-437f-8e10-1fe088afa145
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/10/07
references:
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
status: experimental
tags:
- attack.defense_evasion
- attack.execution
yml_filename: win_susp_regsvr32_no_dll.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

