title: Suspicious GUP Usage
author: Florian Roth
date: 2019/02/06
description: Detects execution of the Notepad++ updater in a suspicious directory,
    which is often used in DLL side-loading attacks
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\GUP.exe'
    SELECTION_3:
        Image: '*\Users\\*\AppData\Local\Notepad++\updater\GUP.exe'
    SELECTION_4:
        Image: '*\Users\\*\AppData\Roaming\Notepad++\updater\GUP.exe'
    SELECTION_5:
        Image: '*\Program Files\Notepad++\updater\GUP.exe'
    SELECTION_6:
        Image: '*\Program Files (x86)\Notepad++\updater\GUP.exe'
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3 or SELECTION_4
        or SELECTION_5 or SELECTION_6)))
falsepositives:
- Execution of tools named GUP.exe and located in folders different than Notepad++\updater
id: 0a4f6091-223b-41f6-8743-f322ec84930b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2020/11/09
references:
- https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
- attack.t1073
yml_filename: win_susp_gup.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

