title: Regsvr32 Anomaly
author: Florian Roth, oscd.community
date: 2019/01/16
description: Detects various anomalies in relation to regsvr32.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*http*'
    SELECTION_11:
        CommandLine: '*ftp*'
    SELECTION_12:
        CommandLine: '*scrobj.dll'
    SELECTION_13:
        Image: '*\wscript.exe'
    SELECTION_14:
        ParentImage: '*\regsvr32.exe'
    SELECTION_15:
        Image: '*\EXCEL.EXE'
    SELECTION_16:
        CommandLine: '*..\..\..\Windows\System32\regsvr32.exe *'
    SELECTION_17:
        ParentImage: '*\mshta.exe'
    SELECTION_18:
        Image: '*\regsvr32.exe'
    SELECTION_19:
        Image: '*\regsvr32.exe'
    SELECTION_2:
        Image: '*\regsvr32.exe'
    SELECTION_20:
        CommandLine: '*\AppData\Local*'
    SELECTION_21:
        CommandLine: '*C:\Users\Public*'
    SELECTION_3:
        CommandLine: '*\Temp\\*'
    SELECTION_4:
        Image: '*\regsvr32.exe'
    SELECTION_5:
        ParentImage: '*\powershell.exe'
    SELECTION_6:
        Image: '*\regsvr32.exe'
    SELECTION_7:
        ParentImage: '*\cmd.exe'
    SELECTION_8:
        Image: '*\regsvr32.exe'
    SELECTION_9:
        CommandLine: '*/i:*'
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and (SELECTION_10 or SELECTION_11) and SELECTION_12) or (SELECTION_13 and
        SELECTION_14) or (SELECTION_15 and SELECTION_16) or (SELECTION_17 and SELECTION_18)
        or (SELECTION_19 and (SELECTION_20 or SELECTION_21))))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/07/18
references:
- https://subt0x10.blogspot.de/2017/04/bypass-application-whitelisting-script.html
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010
- attack.execution
- attack.t1117
- car.2019-04-002
- car.2019-04-003
yml_filename: win_susp_regsvr32_anomalies.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

