title: Suspicious Double Extension
author: Florian Roth (rule), @blu3_team (idea)
date: 2019/06/26
description: Detects suspicious use of an .exe extension after a non-executable file
    extension like .pdf.exe, a set of spaces or underlines to cloak the executable
    file in spear phishing campaigns
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        Image: '*.txt.exe'
    SELECTION_11:
        Image: '*      .exe'
    SELECTION_12:
        Image: '*______.exe'
    SELECTION_2:
        Image: '*.doc.exe'
    SELECTION_3:
        Image: '*.docx.exe'
    SELECTION_4:
        Image: '*.xls.exe'
    SELECTION_5:
        Image: '*.xlsx.exe'
    SELECTION_6:
        Image: '*.ppt.exe'
    SELECTION_7:
        Image: '*.pptx.exe'
    SELECTION_8:
        Image: '*.rtf.exe'
    SELECTION_9:
        Image: '*.pdf.exe'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12))
falsepositives:
- Unknown
id: 1cdd9a09-06c9-4769-99ff-626e2b3991b8
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html
- https://twitter.com/blackorbird/status/1140519090961825792
tags:
- attack.initial_access
- attack.t1566.001
- attack.t1193
yml_filename: win_susp_double_extension.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

