title: Interactive AT Job
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: 2019/10/24
description: Detect an interactive AT job, which may be used as a form of privilege
    escalation.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\at.exe'
    SELECTION_3:
        CommandLine: '*interactive*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely (at.exe deprecated as of Windows 8)
fields:
- ComputerName
- User
- CommandLine
id: 60fc936d-2eb0-4543-8a13-911c750a1dfc
level: high
logsource:
    category: process_creation
    product: windows
modified: 2019/11/11
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053.002/T1053.002.md
- https://eqllib.readthedocs.io/en/latest/analytics/d8db43cf-ed52-4f5c-9fb3-c9a4b95a0b56.html
status: experimental
tags:
- attack.privilege_escalation
- attack.t1053.002
- attack.t1053
yml_filename: win_interactive_at.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

