title: Harvesting of Wifi Credentials Using netsh.exe
author: Andreas Hunkeler (@Karneades), oscd.community
date: 2020/04/20
description: Detect the harvesting of wifi credentials using netsh.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\netsh.exe'
    SELECTION_3:
        CommandLine: '*wlan*'
    SELECTION_4:
        CommandLine: '* s*'
    SELECTION_5:
        CommandLine: '* p*'
    SELECTION_6:
        CommandLine: '* k*'
    SELECTION_7:
        CommandLine: '*=clear*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Legitimate administrator or user uses netsh.exe wlan functionality for legitimate
    reason
id: 42b1a5b8-353f-4f10-b256-39de4467faff
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2020/11/28
references:
- https://blog.malwarebytes.com/threat-analysis/2020/04/new-agenttesla-variant-steals-wifi-credentials/
status: experimental
tags:
- attack.discovery
- attack.credential_access
- attack.t1040
yml_filename: win_netsh_wifi_credential_harvesting.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

