
title: UAC Bypass Using Disk Cleanup
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using scheduled tasks and variable
  expansion of cleanmgr.exe (UACMe 34)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*"\system32\cleanmgr.exe /autoclean /d C:'
  SELECTION_3:
    ParentCommandLine: C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule
  SELECTION_4:
    IntegrityLevel:
    - High
    - System
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: b697e69c-746f-4a86-9f59-7bfff8eab881
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
