title: Suspicious Rundll32 Invoking Inline VBScript
author: Florian Roth
date: 2021/03/05
description: Detects suspicious process related to rundll32 based on command line
    that invokes inline VBScript as seen being used by UNC2452
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine: '*rundll32.exe*'
    SELECTION_3:
        CommandLine: '*Execute*'
    SELECTION_4:
        CommandLine: '*RegRead*'
    SELECTION_5:
        CommandLine: '*window.close*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
status: experimental
tags:
- attack.defense_evasion
- attack.t1055
yml_filename: win_susp_rundll32_inline_vbs.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

