title: Copying Sensitive Files with Credential Data
author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
date: 2019/10/22
description: Files with well-known filenames (sensitive files with credential data)
    copying
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*\repair\sam*'
    SELECTION_11:
        CommandLine: '*\repair\system*'
    SELECTION_12:
        CommandLine: '*\repair\security*'
    SELECTION_13:
        CommandLine: '*\config\RegBack\sam*'
    SELECTION_14:
        CommandLine: '*\config\RegBack\system*'
    SELECTION_15:
        CommandLine: '*\config\RegBack\security*'
    SELECTION_2:
        Image: '*\esentutl.exe'
    SELECTION_3:
        CommandLine: '*vss*'
    SELECTION_4:
        CommandLine: '* /m *'
    SELECTION_5:
        CommandLine: '* /y *'
    SELECTION_6:
        CommandLine: '*\windows\ntds\ntds.dit*'
    SELECTION_7:
        CommandLine: '*\config\sam*'
    SELECTION_8:
        CommandLine: '*\config\security*'
    SELECTION_9:
        CommandLine: '*\config\system *'
    condition: (SELECTION_1 and ((SELECTION_2 and (SELECTION_3 or SELECTION_4 or SELECTION_5))
        or (SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14 or SELECTION_15)))
falsepositives:
- Copying sensitive files for legitimate use (eg. backup) or forensic investigation
    by legitimate incident responder or forensic invetigator
id: e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
level: high
logsource:
    category: process_creation
    product: windows
modified: 2019/11/13
references:
- https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.003
- attack.t1003
- car.2013-07-001
- attack.s0404
yml_filename: win_copying_sensitive_files_with_credential_data.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

