title: Suspicious Svchost Process
author: Florian Roth
date: 2017/08/15
description: Detects a suspicious svchost process start
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\svchost.exe'
    SELECTION_3:
        ParentImage: '*\services.exe'
    SELECTION_4:
        ParentImage: '*\MsMpEng.exe'
    SELECTION_5:
        ParentImage: '*\Mrt.exe'
    SELECTION_6:
        ParentImage: '*\rpcnet.exe'
    SELECTION_7:
        ParentImage: '*\svchost.exe'
    SELECTION_8:
        ParentImage|re: ^$
    condition: (SELECTION_1 and (SELECTION_2 and  not ((SELECTION_3 or SELECTION_4
        or SELECTION_5 or SELECTION_6 or SELECTION_7))) and  not (SELECTION_8))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2020/08/28
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.005
- attack.t1036
yml_filename: win_susp_svchost.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

