
title: Whoami Execution
author: Florian Roth
date: 2018/08/13
description: Detects the execution of whoami, which is often used by attackers after
  exloitation / privilege escalation but rarely used by administrators
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\whoami.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Admin activity
- Scripts and administrative tools used in the monitored environment
- Monitoring activity
id: e28a5a99-da44-436d-b7a0-2afc20a5f413
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
status: experimental
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001
