title: Shadow Copies Deletion Using Operating Systems Utilities
author: Florian Roth, Michael Haag, Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community,
    Andreas Hunkeler (@Karneades)
date: 2019/10/22
description: Shadow Copies deletion using operating systems utilities
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*quiet*'
    SELECTION_2:
        CommandLine: '*delete*'
    SELECTION_3:
        Image: '*\powershell.exe'
    SELECTION_4:
        Image: '*\wmic.exe'
    SELECTION_5:
        Image: '*\vssadmin.exe'
    SELECTION_6:
        Image: '*\diskshadow.exe'
    SELECTION_7:
        CommandLine: '*shadow*'
    SELECTION_8:
        Image: '*\wbadmin.exe'
    SELECTION_9:
        CommandLine: '*catalog*'
    condition: (SELECTION_1 and SELECTION_2 and (((SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6) and SELECTION_7) or ((SELECTION_8) and SELECTION_9 and SELECTION_10)))
falsepositives:
- Legitimate Administrator deletes Shadow Copies using operating systems utilities
    for legitimate reason
fields:
- CommandLine
- ParentCommandLine
id: c947b146-0abc-4c87-9c64-b17e9d7274a2
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2021/06/02
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://blog.talosintelligence.com/2017/05/wannacry.html
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/
- https://www.bleepingcomputer.com/news/security/why-everyone-should-disable-vssadmin-exe-now/
- https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
- https://github.com/Neo23x0/Raccine#the-process
- https://github.com/Neo23x0/Raccine/blob/main/yara/gen_ransomware_command_lines.yar
status: stable
tags:
- attack.defense_evasion
- attack.impact
- attack.t1070
- attack.t1490
yml_filename: win_shadow_copies_deletion.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

