title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION
author: Timur Zinniatullin, oscd.community
date: 2020/10/13
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        CommandLine|re: (?i).*&&set.*(\{\d\}){2,}\\\"\s+?\-f.*&&.*cmd.*\/c
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: e9f55347-2928-4c06-88e5-1a7f8169942e
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
yml_filename: win_invoke_obfuscation_via_var.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

