title: Imports Registry Key From an ADS
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/12
description: Detects the import of a alternate datastream to the registry with regedit.exe.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Image: '*\regedit.exe'
    SELECTION_3:
        CommandLine: '* /i *'
    SELECTION_4:
        CommandLine: '*.reg*'
    SELECTION_5:
        CommandLine|re: :[^ \\\\]
    SELECTION_6:
        CommandLine: '* /e *'
    SELECTION_7:
        CommandLine: '* /a *'
    SELECTION_8:
        CommandLine: '* /c *'
    condition: (SELECTION_1 and (SELECTION_2 and (SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6 or SELECTION_7 or SELECTION_8)))
falsepositives:
- Unknown
fields:
- ParentImage
- CommandLine
id: 0b80ade5-6997-4b1d-99a1-71701778ea61
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regedit.yml
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: experimental
tags:
- attack.t1112
- attack.defense_evasion
yml_filename: win_regedit_import_keys_ads.yml
yml_path: /home/itib/git/sigma/rules/windows/process_creation

