title: The ... service entered the stopped|running state
description: hogehoge
author: Yea
logsource: 
    product: windows
detection:
    selection:
        Channel: System
        EventID: 7036
        param1:
            regexes: ./regexes.txt
    condition: selection
falsepositives:
    - unknown
level: low
output: 'Suspicious Service Name¥nService name: %ServiceName%'
creation_date: 2020/11/8
uodated_date: 2020/11/8
