author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: 1 of them
  selection_service:
    EventID: 7045
    ServiceName:
    - SC Scheduled Scan
    - UpdatMachine
falsepositives:
- Unknown
id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
level: critical
logsource:
  product: windows
  service: system
modified: 2020/08/26
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
tags:
- attack.persistence
- attack.g0049
- attack.t1053
- attack.t1053.005
- attack.s0111
- attack.t1050
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071
- attack.t1071.004
title: Chafer Activity

author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: 1 of them
  selection_service:
    EventID: 4698
    TaskName:
    - SC Scheduled Scan
    - UpdatMachine
falsepositives:
- Unknown
id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
level: critical
logsource:
  product: windows
  service: security
modified: 2020/08/26
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
tags:
- attack.persistence
- attack.g0049
- attack.t1053
- attack.t1053.005
- attack.s0111
- attack.t1050
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071
- attack.t1071.004
title: Chafer Activity

author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: 1 of them
  selection_reg1:
    TargetObject|endswith:
    - SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\UMe
    - SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\UT
falsepositives:
- Unknown
id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2020/08/26
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
tags:
- attack.persistence
- attack.g0049
- attack.t1053
- attack.t1053.005
- attack.s0111
- attack.t1050
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071
- attack.t1071.004
title: Chafer Activity

author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: 1 of them
  selection_process0:
    CommandLine|contains: \\Service.exe
    CommandLine|endswith:
    - i
    - u
  selection_process1:
  - CommandLine|endswith: \\microsoft\\Taskbar\\autoit3.exe
  - CommandLine|startswith: C:\\wsc.exe
  selection_process2:
    Image|contains: \\Windows\\Temp\\DB\\
    Image|endswith: .exe
  selection_process3:
    CommandLine|contains|all:
    - \\nslookup.exe
    - -q=TXT
    ParentImage|contains: \\Autoit
falsepositives:
- Unknown
id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
tags:
- attack.persistence
- attack.g0049
- attack.t1053
- attack.t1053.005
- attack.s0111
- attack.t1050
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071
- attack.t1071.004
title: Chafer Activity

==============
