
title: Suspicious Shells Spawn by WinRM
author: Andreas Hunkeler (@Karneades), Markus Neis
date: 2021/05/20
description: Detects suspicious shell spawn from WinRM host process
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage: '*\wsmprovhost.exe'
  SELECTION_3:
    Image:
    - '*\cmd.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\powershell.exe'
    - '*\schtasks.exe'
    - '*\certutil.exe'
    - '*\whoami.exe'
    - '*\bitsadmin.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate WinRM usage
id: 5cc2cda8-f261-4d88-a2de-e9e193c86716
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/05/22
status: experimental
tags:
- attack.t1190
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
