title: Sysmon Check command lines
id : 4fe151c2-ecf9-4fae-95ae-b88ec9c2fca6
description: hogehoge
enabled: true
author: Yea
logsource: 
    product: windows
detection:
    selection:
        EventLog: Sysmon
        EventID: 1
        CommandLine: '*'
    condition: selection
falsepositives:
    - unknown
level: medium
output: 'CommandLine=%CommandLine%¥nParentImage=%ParentImage%'
creation_date: 2020/11/8
updated_date: 2020/11/8

