title: Sysmon Check command lines
description: hogehoge
enabled: true
author: Yea
logsource: 
    product: windows
detection:
    selection:
        EventLog: Sysmon
        EventID: 1
        CommandLine: '*'
    condition: selection
falsepositives:
    - unknown
level: medium
output: 'CommandLine=%CommandLine%¥nParentImage=%ParentImage%'
creation_date: 2020/11/8
uodated_date: 2020/11/8

