title: Excluded Rule Test 1
id : 00000000-0000-0000-0000-000000000000
description: hogehoge
enabled: true
author: Yea
logsource: 
    product: windows
detection:
    selection:
        EventLog: Sysmon
        EventID: 1
        CommandLine: '*'
    condition: selection
falsepositives:
    - unknown
level: medium
output: 'CommandLine=%CommandLine%¥nParentImage=%ParentImage%'
creation_date: 2020/11/8
updated_date: 2020/11/8