
title: UAC Bypass via Event Viewer
author: Florian Roth
date: 2017/03/19
description: Detects UAC bypass method using Windows event viewer
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: HKCU\\*
  SELECTION_5:
    TargetObject: '*\mscfile\shell\open\command'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- unknown
id: 7c81fec3-1c1d-43b0-996a-46753041b1b6
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2021/09/12
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1088
- attack.t1548.002
- car.2019-04-001
