
title: Esentutl Volume Shadow Copy Service Keys
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/20
description: Detects the volume shadow copy service initialization and processing
  via esentutl. Registry keys such as HKLM\\System\\CurrentControlSet\\Services\\VSS\\Diag\\VolSnap\\Volume
  are captured.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: '*System\CurrentControlSet\Services\VSS*'
  SELECTION_5:
    Image: '*esentutl.exe'
  SELECTION_6:
    TargetObject: '*System\CurrentControlSet\Services\VSS\Start*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 and SELECTION_5)
    and  not (SELECTION_6))
falsepositives:
- Unknown
id: 5aad0995-46ab-41bd-a9ff-724f41114971
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/12/08
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
