
title: Commun Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject:
    - '*\SOFTWARE\Wow6432Node\Microsoft\Windows CE Services\AutoStart*'
    - '*\Software\Wow6432Node\Microsoft\Command Processor\Autorun*'
    - '*\SOFTWARE\Wow6432Node\Microsoft\Active Setup\Installed Components*'
    - '*\SOFTWARE\Microsoft\Windows CE Services\AutoStartOnDisconnect*'
    - '*\SOFTWARE\Microsoft\Windows CE Services\AutoStartOnConnect*'
    - '*\SYSTEM\Setup\CmdLine*'
    - '*\Software\Microsoft\Ctf\LangBarAddin*'
    - '*\Software\Microsoft\Command Processor\Autorun*'
    - '*\SOFTWARE\Microsoft\Active Setup\Installed Components*'
    - '*\SOFTWARE\Classes\Protocols\Handler*'
    - '*\SOFTWARE\Classes\Protocols\Filter*'
    - '*\SOFTWARE\Classes\Htmlfile\Shell\Open\Command\(Default)*'
    - '*\Environment\UserInitMprLogonScript*'
    - '*\SOFTWARE\Policies\Microsoft\Windows\Control Panel\Desktop\Scrnsave.exe*'
    - '*\Software\Microsoft\Internet Explorer\UrlSearchHooks*'
    - '*\SOFTWARE\Microsoft\Internet Explorer\Desktop\Components*'
    - '*\Software\Classes\Clsid\{AB8902B4-09CA-4bb6-B78D-A8F59079A8D5}\Inprocserver32*'
    - '*\Control Panel\Desktop\Scrnsave.exe*'
  SELECTION_5:
    Details: (Empty)
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and  not
    (SELECTION_5))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: f59c3faf-50f3-464b-9f4c-1b67ab512d99
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2021/12/05
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
