
title: Suspicious New Printer Ports in Registry (CVE-2020-1048)
ruletype: Sigma
author: EagleEye Team, Florian Roth, NVISO
date: 2020/05/13
description: Detects a new and suspicious printer port creation in Registry that could
  be an attempt to exploit CVE-2020-1048
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Ports*
  SELECTION_5:
    Details:
    - '*.dll*'
    - '*.exe*'
    - '*.bat*'
    - '*.com*'
    - '*C:*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- New printer port install on host
id: 7ec912f2-5175-4868-b811-ec13ad0f8567
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/11/27
references:
- https://windows-internals.com/printdemon-cve-2020-1048/
status: test
tags:
- attack.persistence
- attack.execution
- attack.defense_evasion
- attack.t1112
