
title: Registry Persistence Mechanisms in Recycle Bin
author: frack113
date: 2021/11/18
description: Detects persistence registry keys for Recycle Bin
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: RenameKey
  SELECTION_5:
    NewName: HKCR\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open
  SELECTION_6:
    EventType: SetValue
  SELECTION_7:
    TargetObject: HKCR\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open\command\(Default)
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and ((SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7)))
falsepositives:
- unknown
id: 277efb8f-60be-4f10-b4d3-037802f37167
level: critical
logsource:
  category: registry_event
  product: windows
references:
- https://github.com/vxunderground/VXUG-Papers/blob/main/The%20Persistence%20Series/Persistence%20via%20Recycle%20Bin/Persistence_via_Recycle_Bin.pdf
tags:
- attack.persistence
- attack.t1547
