
title: Windows Registry Trust Record Modification
author: Antonlovesdnb
date: 2020/02/19
description: Alerts on trust record modification within the registry, indicating usage
  of macros
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: '*TrustRecords*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: 295a59c1-7b79-4b47-a930-df12c15fc9c2
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
references:
- https://outflank.nl/blog/2018/01/16/hunting-for-evil-detect-macros-being-executed/
- http://az4n6.blogspot.com/2016/02/more-on-trust-records-macros-and.html
status: experimental
tags:
- attack.initial_access
- attack.t1193
- attack.t1566.001
ruletype: SIGMA
