
title: Enabling COR Profiler Environment Variables
author: Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research)
date: 2020/09/10
description: This rule detects cor_enable_profiling and cor_profiler environment variables
  being set and configured.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject:
    - '*\COR_ENABLE_PROFILING'
    - '*\COR_PROFILER'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4)
id: ad89044a-8f49-4673-9a55-cbd88a1b374f
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://twitter.com/jamieantisocial/status/1304520651248668673
- https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors
- https://www.sans.org/cyber-security-summit/archives
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1574.012
ruletype: SIGMA
