
title: DLL Load via LSASS
ruletype: Sigma
author: Florian Roth
date: 2019/10/16
description: Detects a method to load DLL via LSASS process using an undocumented
  Registry key
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject:
    - '*\CurrentControlSet\Services\NTDS\DirectoryServiceExtPt*'
    - '*\CurrentControlSet\Services\NTDS\LsaDbExtPt*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Unknown
id: b3503044-60ce-4bf4-bbcb-e3db98788823
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/11/27
references:
- https://blog.xpnsec.com/exploring-mimikatz-part-1/
- https://twitter.com/SBousseaden/status/1183745981189427200
status: test
tags:
- attack.execution
- attack.persistence
- attack.t1177
- attack.t1547.008
