
title: New File Association Using Exefile
ruletype: Sigma
author: Andreas Hunkeler (@Karneades)
date: 2021/11/19
description: Detects the abuse of the exefile handler in new file association. Used
  for bypass of security products.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: '*Classes\.*'
  SELECTION_5:
    Details: exefile
  SELECTION_6:
    EventType: SetValue
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 44a22d59-b175-4f13-8c16-cbaef5b581ff
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://twitter.com/mrd0x/status/1461041276514623491
status: experimental
tags:
- attack.defense_evasion
